package com.type_moon.codeflame.fatedictionary;

import android.content.Context;
import android.database.Cursor;
import android.graphics.Bitmap;
import android.graphics.BitmapFactory;
import android.os.Environment;

import java.io.File;
import java.io.FileNotFoundException;
import java.io.FileOutputStream;
import java.io.IOException;
import java.lang.reflect.Field;

public class FirstInsert {

    public FirstInsert(){
    }

    static void insertCharacter(Context context){
        if (CharacterDataBase.getInstances(context).query().getCount() == 0){
            AddNumberDataBase.getInstances(context).insert(10);
            CharacterDataBase.getInstances(context).insert(1,"赵云(子龙)","lancer","男","184","85","常山真定","秩序·善","    身长八尺，姿颜雄伟，蜀汉五虎上将之一。\n    汉末军阀混战，赵云受本郡推举，率领义从加入白马将军公孙瓒。期间结识了汉室皇亲刘备，但不久之后，因为兄长去世而离开。赵云离开公孙瓒大约七年左右的时间，在邺城与刘备相见，从此追随刘备。","A","B","A+","A","EX","EX");
            CharacterDataBase.getInstances(context).insert(2,"孙尚香","archer","女","167","56","吴郡富春","中立·善","    孙夫人，乃孙权之妹，名曰孙仁。刘备向东吴借荆州不还，周瑜上书孙权，教使“美人计”，进妹予刘备为夫人，不料在诸葛亮的锦囊妙计安排下，假婚成真姻；后来夫人更助刘备返蜀，于路上怒斥追袭的吴将。后刘备入益州，孙权闻知刘备西征，遣周善引领舟船以迎孙夫人，而夫人带着后主刘禅回吴，幸得赵云与张飞勒兵截江，方重夺刘禅。\n    彝陵之战，刘备战败，有讹言传入吴中，道刘备已死，孙夫人伤心不已，望西痛哭，投江而死。后人为其立庙，号曰“枭姬祠”。","B","C","A++","B","A++","B");
            CharacterDataBase.getInstances(context).insert(3,"黄月英","caster","女","160","41","沔南白水","混沌·中庸","    黄承彦之女,有传闻说她容貌甚丑却知识广博。也有传闻说其极美，故意令黄承彦提亲时说自己貌丑以试探孔明心意。\n  黄月英十分擅长机关术，曾制木虎、木犬、木人等物，无需人力操控即可自动。诸葛亮发明木牛流马，据说也是从黄月英的传授的技巧上发展出来的。","E","D","C","A+++","A","EX");
            CharacterDataBase.getInstances(context).insert(4,"蔡琰(文姬)","caster","女","165","50","陈留圉县","秩序·善","    东汉大文学家蔡邕的女儿。初嫁于卫仲道，丈夫死去而回到自己家里，后值因匈奴入侵，蔡琰被匈奴左贤王掳走，嫁给匈奴人，并生育了两个孩子。十二年后，曹操统一北方，用重金将蔡琰赎回，并将其嫁给董祀。","E","C","D","A++","D","EX");
            CharacterDataBase.getInstances(context).insert(5,"貂蝉","assassin","女","171","58","未知","中立·善","    中国古代四大美女之一，因遭十常侍之乱，避难出宫，为司徒王允收留为歌女。董卓祸乱朝纲，残忍暴戾，貂蝉挺身而出离间董卓和他的义子吕布，最终铲除了权倾一时的董卓。","D","D","A+","B","A+","EX");
            CharacterDataBase.getInstances(context).insert(6,"甄宓","caster","女","165","44","中山无极","中立·善","    文昭甄皇后，上蔡令甄逸之女。魏文帝曹丕的正室，魏明帝曹叡的生母。初嫁与袁熙，袁氏败亡后，被曹丕纳为己有。\n    甄氏风华绝代，曹植以《洛神赋》赞之。","B","B","B","EX","B","EX");
            CharacterDataBase.getInstances(context).insert(7,"曹操(孟德)","saber","男","165","60","沛国谯县","秩序·中庸","    东汉末年，曹操以汉天子的名义征讨四方，统一了中国北方，并实行一系列政策恢复经济生产和社会秩序，使中原社会渐趋稳定、经济出现转机。 \n    精通兵法，重贤爱才，诗歌气魄雄伟，慷慨悲凉；散文亦清峻整洁，开启并繁荣了建安文学。","C","C","D","A","A++","EX");
            CharacterDataBase.getInstances(context).insert(8,"吕布(奉先)","berserker","男","225","153","五原九原","混沌·恶","    原为丁原部将，被唆使杀害丁原归附董卓，与董卓誓为父子，后又被司徒王允唆使诛杀董卓。 兴平元年，吕布趁曹操攻打陶谦时与陈宫等叛乱，先后击败刘备与夏侯惇。曹操亲自出马征讨吕布，水淹下邳，吕布被部下叛变，城破被俘，被处死。\n    历史上吕布以勇武闻名，号称“飞将”，时有“人中吕布，马中赤兔”之说。","A+++","A+","A","C","C","A+");
            CharacterDataBase.getInstances(context).insert(9,"诸葛亮(孔明)","caster","男","182","65","琅琊阳都","中立·善","    早年随叔父诸葛玄到荆州，诸葛玄死后，诸葛亮就在隆中耕种。后刘备三顾茅庐请出，辅佐刘备建立蜀汉。蜀汉建立后，诸葛亮被封为丞相、武乡侯，内抚百姓，对外联吴抗魏，为实现兴复汉室的政治理想，数次北伐，但最终失败，最后病逝于五丈原。","D","D","C","A+++","B","EX");
            CharacterDataBase.getInstances(context).insert(10,"周瑜(公瑾)","rider","男","185","75","庐江舒","中立·中庸","    长壮有姿貌、精音律，江东有“曲有误，周郎顾”之语。\n     少与孙策交好，21岁起随孙策奔赴战场平定江东，后孙策遇刺身亡，孙权继任，周瑜将兵赴丧，以中护军的身份与长史张昭共掌众事。建安十三年，率军与刘备联合，于赤壁之战中大败曹军，由此奠定了“三分天下”的基础。","B","C","B","A++","B","EX");
            CharacterDataBase.getInstances(context).insert(11,"阿尔托莉雅·潘德拉贡","saber","女","154","42","英格兰","秩序・善","    不列颠传说中的王，被称为骑士王。阿尔托莉雅是幼名，从成为王的那一天起就被称为亚瑟王。在那个骑士道如花般凋零的时代，用手中的圣剑为不列颠带来了短暂的和平与最后的繁荣。虽然史实上是男性，但在这个世界似乎是男装的丽人。","A","A","A","A+","A++","EX");
            CharacterDataBase.getInstances(context).insert(12,"阿尔托莉雅·潘德拉贡(Alter)","saber","女","154","42","英格兰","秩序・恶","    被圣杯的诅咒侵蚀，骑士王那冷酷无情的另一面。也许，有的只是作为亚瑟王追求的“理想的王”这一样事物。平常的阿尔托莉雅在约束、控制自己的力量，而这个状态的她却毫不犹豫地展现自己强大的魔力。","A","A","C","A++","C","EX");
            CharacterDataBase.getInstances(context).insert(13,"尼禄·克劳狄乌斯","saber","女","150","42","罗马","混沌・善","    自称是男装的丽人。既自我至上主义又自私任性，明朗豁达，像小孩子一样天真无邪、被万人爱戴的无所不能恣意妄为的皇帝。本名，尼禄・克劳狄乌斯・凯撒・奥古斯都・日耳曼尼库斯。罗马帝国的第5代皇帝。生涯被涂上谋略与毒之色彩的恶名昭彰的暴君。","B","C","A","B","A","B");
            CharacterDataBase.getInstances(context).insert(14,"阿尔提拉","saber","女","160","48","中亚～欧洲","混沌・善","    成就了大帝国的伟大王者，阿提拉。匈奴的末裔，被拥为王的匈族战士。制霸了从西亚、俄罗斯、东欧到高卢的广大版图的五世纪的大英雄。据说是她招来了东西罗马帝国的灭亡。\n   有着卓越的第六感，碰上什么事情都能保持冷静加以应对。虽然是个骄傲而理智的战士，但某处却也有着“空虚”的部分。战斗的时候之时既能冷静地正确把握状况，也能同时化身战斗机器进行惨无人道的杀戮。\n    其人有着卓越的第六感，碰上什么事情都能保持冷静加以应对。虽然是个骄傲而理智的战士，但某处却也有着“空虚”的部分。战斗的时候之时既能冷静地正确把握状况，也能同时化身战斗机器进行惨无人道的杀戮。正可谓是纯粹的“战斗王”。与战场建立的武勋相反，他的统治却没能维持，在死后急速陷入了瓦解并最终消失。然而直到现在，人们都还没能完全摆脱“阿提拉”这一名号宣示的畏怖与恐惧。    \n对圣杯的愿望是——“希望能过一次不做战士的人生”。这决非对身为战士的自己有所厌恶。只不过是，对若非以战士而生下的自己会过着怎样的人生，有所好奇而已。","B","A","A","B","A","A++");
            CharacterDataBase.getInstances(context).insert(15,"阿塔兰忒","archer","女","166","57","希腊","中立・恶","    希腊神话登场的著名女猎人。因在狩猎卡吕冬野猪的过程中最先射中野猪而扬名。此外，她也是希腊豪杰云集的阿尔戈众英雄中的一员。","C","D","A","B","C","C");
            CharacterDataBase.getInstances(context).insert(16,"美杜莎","rider","女","172","57","希腊、无形之岛","混沌・善","    希腊神话登场的戈耳工三姐妹的幺妹。本来是本土的地母神，因为奥林匹斯众神的策略和人们的狂信而逃到无形的岛屿上生存。被描述为能把看到的东西变为石头的蛇妖。虽是美人却能感觉到带刺的气质，只能从冰冷的言行中感觉到她冷酷无情的性格，但她只是单纯觉得麻烦，是个可以的话能什么都不做就这样下去的美女。喜欢喝酒看书。","A++","A++","A","B","D","A+");
            CharacterDataBase.getInstances(context).insert(17,"尤瑞艾莉","archer","女","134","30","希腊、无形之岛","混沌・善","    希腊神话中的戈耳工三姐妹的次女。男性憧憬的具现化，完成的作为“偶像”“理想的女性”生成的堕落的女神。集无垢与纯粹为一身的美丽少女。\n    对美丽、可爱的东西就不计一切地献上油然的爱意。对丑陋之物则是无条件地心生嫌恶。说到底她就是令男性如此倾心的“可爱少女”。至少，是装作如此的。","E","E","C","EX","EX","C");
            CharacterDataBase.getInstances(context).insert(18,"斯忒诺","assassin","女","134","30","希腊、无形之岛","混沌・善","    希腊神话中的戈尔工三姐妹的长女。男性憧憬的具现化，完成的作为“偶像”“理想的女性”生成的堕落的女神。有尤瑞艾莉、美杜莎两个妹妹。\n    不管是怎样的男人都对她奉承并充满赞美。兼备优雅与高尚，更加深入地说也有极度懒惰的性质。对于非常好的对手极其冷酷。到了能使冥府的看门狗发抖的地步。","E","E","B","EX","EX","B");
            CharacterDataBase.getInstances(context).insert(19,"伊丽莎白·巴托里","lancer","女","154","44","匈牙利","混沌・恶","    吸血鬼卡米拉的原型的血之伯爵夫人。……但是，作为从者被召唤的是她尚未犯下罪行之前十四岁的姿态。自称偶像的甜食系从者。高贵、霸道、残忍、无情，但其实并不像传说里一样惨无人道。\n    虽然是邪恶的反英灵，却同时也是个向往恋爱的少女。性子上胆小的部分简直是灾难，结果上要么是帮了自己人，要么就是放跑了敌人，会在关键时刻“哎，怎么说也是个英灵嘛”地发起善心来。但她很讨厌被人说“其实是个好人来的吧？”之类的话。","A+","A+","A+","A","A+","C");
            CharacterDataBase.getInstances(context).insert(20,"布狄卡","rider","女","174","62","英格兰","中立·善","    一世纪时，古代不列颠年轻的战斗女王。罗马帝国无情的侵略甚至令她的女儿们都被凌辱，无法忍受的她最终率领诸王发动了叛乱，但在皇帝尼禄的军势之下失败而丧命。后来，不列颠就流传起了“胜利女王”的传说。","B","A","B","D","C","B+");
            CharacterDataBase.getInstances(context).insert(21,"源义经","rider","女","168","55","日本","混沌·中庸","    日本可谓无人不知无人不晓的悲运武将。与天赋异禀、受人拥戴的哥哥赖朝疏远，最后与从者弁庆一同被打倒。牛若丸是源义经的幼名。","D","C","A+","B","A","A+");
            CharacterDataBase.getInstances(context).insert(22,"玛丽·安托瓦内特","rider","女","160","48","法兰西","秩序・善","    身负哈布斯堡家的系谱的法国王妃。十八世纪路易十六的妃子，梦幻般的贵妇人。是欧洲世界的“以高贵进行支配”的象征般的存在。在王权的绝对性逐渐丧失的时代的奔流中，在世界发生变化之前殒命。\n    天生的偶像,只是微笑就能治愈众生，一个眼神就能使人心醉。因为能受人爱戴而对作为天生的偶像之事感到喜悦，决定继续为了回应人们的期望而行动。那份精神的特性，某种程度上已经接近女神了。","D","D","B","A","B","A+");
            CharacterDataBase.getInstances(context).insert(23,"玛尔达","rider","女","161","49","欧洲","秩序・善","    镇服了恶龙塔拉斯克的一世纪的圣女。与妹妹和弟弟一起被传颂，成为人们信仰的救世主。拥有美丽的容貌，热情洋溢，完美无缺的人。——连恐怖的怪兽都为之倾倒的神圣的少女。","B","B","B","A","A+","A+");
            CharacterDataBase.getInstances(context).insert(24,"美狄亚","caster","女","163","51","希腊、科任托斯","中立・恶","    拥有金羊毛皮的埃厄忒斯王的女儿，被月之女神赫卡忒教授魔术，因为英雄伊阿宋从国家离开，由于长期流浪的结果被刻上背叛的魔女的烙印而离世。\n    将面容隐藏在斗篷下的女魔术师。冷酷、残忍、为了目的不择手段，擅长各种奸计的名副其实的恶女。但是，这个性格是她为了反抗自己背负的命运所形成的。由于连续遭到背叛的结果，如今自己也堕入了自己背叛别人的立场的悲剧的女性。","E","D","C","A+","A","C");
            CharacterDataBase.getInstances(context).insert(25,"紫幽","saber","女","162","49","中国","秩序・中庸","    盘古三清之一的上清通天，三清中的老幺，六大混元圣人之一，无论法宝还是法力都是六者中最强的。“紫幽”是本名，然而就连两位兄长也不得而知。创立截教，教系是三教中势力最大的派别，故而门下仙人数量最多，享有“万仙来朝”之誉。门人弟子多为兽禽异物修炼得道而化形，故此常被阐教、人道称为不够正宗：“不分披毛带角之人，湿生卵化之辈，皆可同群共处。”\n    紫幽外表高冷，实则性格坚毅且，豪爽，比较护短，封神一战中受不了其余的圣人亲自下场打杀她的门人，竟然摆下“诛仙阵”、“万仙阵”与他们正面对抗，最终以一敌四惜败。\n    紫幽的对剑的领悟作为saber来说无人能及，然而应为对于道的造诣更高所以没有成为冠位。本人觉得女性作为一教之主没什么威严所以从来都以男装出镜，然而实在是张不出胡子，所以才有老子、元始天尊都是中老年形象而通天教主确实年轻人的言论。\n    作为混元圣人的紫幽其实不可能作为servent现界，然而因为一个人寂寞了太久突发奇想想要谈恋爱所以任性的响应了召唤。事实上就是一个闭关了太久的宅女天然呆。" ,"A+++","EX","EX","EX","EX","EX");
            CharacterDataBase.getInstances(context).insert(25,"嬴政","saber","男","185","71","中国","中立・中庸","    秦始皇，又名赵政、秦政，或称祖龙，中国历史上著名的政治家、战略家、改革家，首位完成华夏大一统的铁腕政治人物，“千古一帝”是中国历史上一位叱咤风云富有传奇色彩的划时代人物，是中国历史上第一个大一统王朝——秦王朝的开国皇帝，对中国和世界历史产生深远影响，把中国推向大一统时代。\n    嬴政本人天纵奇才，不光是绝无仅有的政治家、战略家、改革家，还在神秘学、武学和科学技术方面卓有成效，几乎是以一己之力改变了整个人类历史的进程，结束了诸神行走世间的神代，开启了只属于人类的时代，以科学替代神秘推动了人类文明的发展，并且建立了万古未有的盛世帝国。\n    十三岁便继承了王位，然后一口气击败了诸多政敌掌握大权，然后厉兵秣马，辅以超越时代的技术，只耗时五年便横扫六国，建立起大一统的中央帝国，以人道气运放逐无尽的真以太，驱灭神灵，自封为皇帝，凌驾于诸神之上。紧接着废分封、设郡县、书同文、车同轨、收天下兵锋典籍、立科举、东渡扶桑、西逐匈奴、南平百越、北定罗刹......一系列改革打破了几乎所有的传统格局，奠定了人理之基。\n    然而嬴政本人却仿佛被迷雾环绕一般十分神秘，没有人知道他为何能够完成这样的伟业，也没有人知道他一身学识来源于何处。\n    唯有在他体内的超越时空的寂寞灵魂才知道，一切早就在不知不觉中面目全非了。" ,"A+++","A","A++","EX","EX","EX");

        }
    }
    
    static void insertSkill(Context context){
        if (SkillDataBase.getInstances(context).query().getCount() == 0){
            SkillDataBase.getInstances(context).insert("赵云(子龙)","职阶技能", "对魔力", "B", " 较高的对魔力，可以毫不困难地无效化三节以下的魔术，即使是大魔术、仪礼咒法也难以给予其伤害。");
            SkillDataBase.getInstances(context).insert("赵云(子龙)","职阶技能", "骑乘", "B", "  由于“骑士”本来就是擅长马上战斗的军人，所以骑乘等级非常高。");
            SkillDataBase.getInstances(context).insert("赵云(子龙)","固有技能", "千里护主之骑", "A+", " 当自身存在于Master远处，Master遇到危险时，可以不消耗令咒的力量将其呼唤到其主身边。同时，在通过这个技能召唤出现之时，赵云的全属性在一定时间内会上升一个等级。");
            SkillDataBase.getInstances(context).insert("赵云(子龙)","固有技能", "千军之将七进七出", "EX", "   此技能为赵云最有名的事迹‘长坂坡之战’的具现。赵云的运气属性会根据敌人的数量成正比例提升。若对拥有此技能的赵云，使用人海战术，无疑是找死般的行为。");
            SkillDataBase.getInstances(context).insert("赵云(子龙)","固有技能", "心眼（真）", "A", "   在修行与锻炼中得到的洞察力和战斗理论。纵然是绝境，都可以冷静走出扭转形势的一步。");
            SkillDataBase.getInstances(context).insert("赵云(子龙)","固有技能", "龙胆", "A", "  无效化精神干涉的能力。并且有使格斗伤害上升的效果。");
            SkillDataBase.getInstances(context).insert("赵云(子龙)","固有技能", "无穷之武练", "A+++", "    在过去某个时代的盖世无双的武艺.由于将心、技、体完全融合为一,不管在何种精神制约下都能将自身的战斗能力完美发挥。");
            SkillDataBase.getInstances(context).insert("赵云(子龙)","宝具", "涯角枪", "A+", "  枪身乃混铁精钢打造而成，带盘龙雕文，坚固而带韧性，枪头乃白金铸就，寒光凛凛，锋锐无比，上书“天涯海角无对”。为常胜将军赵云的佩枪，只有其本人才能发挥出此枪的潜在威力。\n    藉由将所有者的灵气变换成焰，再从往下挥的枪的前端如大爆炸一般地放出来破坏万物。");
            SkillDataBase.getInstances(context).insert("赵云(子龙)","宝具", "青釭剑", "A", "   三国时代的霸主之一曹操所铸造的神兵，故有“云乃拔青虹剑乱砍，手起处，衣甲平过，血如涌泉”的描述，被赵云所得，助其在战场上大放异彩。\n    拥有“破甲”的效果，能够对防具，结界等造成大幅度的损伤。");
            SkillDataBase.getInstances(context).insert("赵云(子龙)","宝具", "枪技·百鸟朝凤", "A+++", "    是赵云的老师——枪法宗师童渊所创的一种枪法，幻化出百鸟之影，最终身化凤凰，百虚而一实的致命一击。无法被格挡或者闪避。");
            SkillDataBase.getInstances(context).insert("孙尚香","职阶技能", "对魔力", "C", "    能将咏唱少于两节的魔术无效化，但无法防御大魔术、仪式咒法等大规模魔术。");
            SkillDataBase.getInstances(context).insert("孙尚香","职阶技能", "单独行动", "B", "   失去master后，可以2日间持续一直现界。不过这是避免战斗和使用宝具等所带来的消耗、尽可能保存魔力的情况下的理想值。");
            SkillDataBase.getInstances(context).insert("孙尚香","固有技能", "枭姬", "B", " 孙尚香有着与传统女性截然不同的桀骜不驯的个性，刚强勇猛，技艺过人，在战斗时能够激发出更进一步的力量和技巧，同时能大幅强化孙尚香的视力和命中力。");
            SkillDataBase.getInstances(context).insert("孙尚香","固有技能", "美的显现", "A", "  名传世间的绝世美人，拥有无匹的魅力，能轻易获得异性乃至同性的好感。");
            SkillDataBase.getInstances(context).insert("孙尚香","固有技能", "猛虎", "C", " 孙尚香流淌着江东孙氏的猛虎之血，在战斗中容易进入狂战状态，以失去理智为代价获得更高的出力，同时能够放出火焰属性的魔力。");
            SkillDataBase.getInstances(context).insert("孙尚香","固有技能", "兵圣传人", "D", " 孙尚香来自江东孙氏，乃是兵圣孙武之后，虽然本身不太擅长指挥,但是天赋的血脉还是赋予了他一定的统御力。");
            SkillDataBase.getInstances(context).insert("孙尚香","宝具", "红莲弓", "B", "  缠绕着火焰的弓，能释放出火属性的箭矢，当真名解放后便如同炮台一般，能够射出如同导弹一般威力的攻击。");
            SkillDataBase.getInstances(context).insert("孙尚香","宝具", "天命的结合", "A++", "  作为两国友好合作的象征，孙尚香作为联姻的对象远嫁蜀汉。\n   该宝具发动后能够大幅的强化目标和我方的各能力值，并且完全恢复损伤。不过孙尚香本人似乎非常不满这样的命运。");
            SkillDataBase.getInstances(context).insert("黄月英","职阶技能", "阵地作成", "B", "   作为魔术师，造出对自己有利的阵地。B等级只能够作出“工房”而不是“神殿”");
            SkillDataBase.getInstances(context).insert("黄月英","职阶技能", "道具作成", "EX", "  制作带有魔力的器具。被称为“工神”的她能够制作出超越时代的魔术造物和机关傀儡");
            SkillDataBase.getInstances(context).insert("黄月英","固有技能", "天赋的奇才", "EX", " 黄月英是绝世奇才，任何知识、技巧和魔术都能轻易的习得，即使是现代科学的技术也轻易完全掌握了的程度，英雄个人技能以及肉体上的负荷以外的技能都能发挥出A级甚至以上的熟练度。");
            SkillDataBase.getInstances(context).insert("黄月英","固有技能", "奇门遁甲", "A", "   熟读兵书，上知天文，下知地理，文韬武略，足智多谋，尤其擅长玄门数算，奇门遁甲之术，能够有限的计算未来，同时在风水构建，阵地作成方面也无可匹及。");
            SkillDataBase.getInstances(context).insert("黄月英","宝具", "工神的无限机巧秘库", "EX", "   储藏着黄月英无数作品的宝库，拥有包括“连弩”、“木牛流马”、“机巧傀儡”等各种各样超越时代的黑科技发明——然而在黄月英眼里这些大概都是失败品吧。\n  为了追求超越人类的造物黄月英仍然在努力中，正因如此，这座名为宝库实为垃圾堆的仓库库存依旧在不断的增加。");
            SkillDataBase.getInstances(context).insert("黄月英","宝具", "石兵八阵", "B", " 侵入这巨石构成的大阵之人会被就此迷惑，并被迫入死亡。原本是某位军师的宝具，实际上是由黄月英的父亲所教——作为女儿的黄月英实际上也掌握着这样的技巧，但是看起来这大概只是她无聊时候的顺手之作吧。");
            SkillDataBase.getInstances(context).insert("黄月英","宝具", "生命创造·神性机巧", "EX", "   名为“夜夜”的神性机巧傀儡，黄月英所追求的最终造物，拥有超越人类达到物质化的完美灵魂和强大的机巧躯体，虽然只是个半成品，但二者合一还是产生了神明般的力量。\n   她是黄月英以人类之身超越神明而抵达根源的奇迹——从无到有而的创造的机巧生命体。\n    这是与人类别无二致的机巧傀儡，诞生于一次实验意外，虽然事后黄月英多次重复同样的实验，但是仍然无法再次创造生命了。");
            SkillDataBase.getInstances(context).insert("蔡琰(文姬)","职阶技能", "阵地作成", "B", "    作为魔术师，造出对自己有利的阵地。B等级只能够作出“工房”而不是“神殿”");
            SkillDataBase.getInstances(context).insert("蔡琰(文姬)","职阶技能", "道具作成", "B", "    以魔术来创造出各种道具的能力。虽然不懂魔术，但无比的才气应用宝具而写成的诗词文章，也能够进行制作。");
            SkillDataBase.getInstances(context).insert("蔡琰(文姬)","固有技能", "艺术审美", "A", "    蔡琰博览群书，对艺术作品、文学作品拥有无比的执着心。目睹在艺术界与文学界有着相关传说的宝具时，可以看破其真名。");
            SkillDataBase.getInstances(context).insert("蔡琰(文姬)","固有技能", "过目不忘", "A", "    “博闻强识，不辱才女之名。”，蔡琰拥有过目不忘的才能，只要看过一遍的东西就能完全的记忆并且复刻下来——无论是怎样的魔术，或者A级以下的技能，只要目睹，即使不知道原理也可以完美的复制并且使用。");
            SkillDataBase.getInstances(context).insert("蔡琰(文姬)","固有技能", "音乐神的加护", "EX", "能听到并理解所有的声音，使天才般的演奏成为可能，更甚的是，可以将音乐魔术的行使加强补正，这些效果可以作为“自身之力”被发挥出来。");
            SkillDataBase.getInstances(context).insert("蔡琰(文姬)","宝具", "一曲悲歌愁断肠", "A+", "  感念自身以及天下万民悲惨的命运所作的一曲，名为《胡笳十八拍》的旷世杰作——使得听闻之人感受到命运的残酷与无情，永远的徘徊在苦难之中直至死亡,是能够撬动命运因果之弦的乐曲。");
            SkillDataBase.getInstances(context).insert("蔡琰(文姬)","宝具", "焦尾琴", "C", "   父亲留给蔡琰的名琴，能够奏出超出演奏者水平的声音，用于行使音乐魔术时使魔术等级增加一级。");
            SkillDataBase.getInstances(context).insert("貂蝉","职阶技能", "屏蔽气息", "B", "    断绝作为Servant的气息。适合于隐密行动。当自己转移至攻击姿态时，屏蔽气息的等级会大幅下降。");
            SkillDataBase.getInstances(context).insert("貂蝉","固有技能", "连环之谋", "B", "    如何将对象暗杀的战术思考。与军略不同，只能应用在少数的暗杀计。使用该技能能够推演未来的方式布置计划，只有足够高等级的幸运才能对抗该技能。");
            SkillDataBase.getInstances(context).insert("貂蝉","固有技能", "魅惑的容颜", "EX", "  拥有足以闭月的美貌，这份美貌在“美人计”的传说中被升华为超越神魔的魅惑力——只要是异性，无论怎样的请求都能够答应这样的等级，但对于貂蝉本人来说同样是一份枷锁吧，拥有如此美貌的她要怎样才能找到真正爱着她的人呢？");
            SkillDataBase.getInstances(context).insert("貂蝉","固有技能", "离间", "C", "  实际上是超出常规的精神暗示与干扰的技巧，不知不觉间干扰对方的思维使其互相之间产生强烈的敌意，配合貂蝉倾世的舞技甚至能让整个军队自相残杀。");
            SkillDataBase.getInstances(context).insert("貂蝉","固有技能", "舞之真意", "A", "    虽然也擅长音乐，但是舞蹈才是貂蝉真正的传世之技。华丽的舞姿甚至能够沟通天地，相当于仪式一般的产生大型魔术的效果。");
            SkillDataBase.getInstances(context).insert("貂蝉","宝具", "一舞倾城·再舞倾国", "A++", "   终极的舞技与魅力的结合，貂蝉舞的最终奥义。动人的舞姿之下整个城市的人都会头脑麻痹，成为被貂蝉的傀儡，就连精神耐受不足的从者也无法抵御。实际上，这段舞蹈的第二段从未被展现过。");
            SkillDataBase.getInstances(context).insert("甄宓","职阶技能", "阵地作成", "EX", "   本身并不能制作阵地，但是只要有水的地方就是她的主场，拥有相当于“神殿”的效果，而处于洛水之中时的她几乎无所不能。");
            SkillDataBase.getInstances(context).insert("甄宓","职阶技能", "道具作成", "B", "    以魔术来创造出各种道具的能力。虽然魔术能力不足，但是借由水可以完成各种不可思议的魔术造物");
            SkillDataBase.getInstances(context).insert("甄宓","固有技能", "美的显现", "A++", "  “翩若惊鸿，婉若游龙。荣曜秋菊，华茂春松。”曹植是这么描述她的美丽的。拥有卓绝的魅力，吸引他人的能力。虽然足以与貂蝉媲美，但是由于并没有美色祸乱世间的传说，所以并没有超越人与神的范畴。");
            SkillDataBase.getInstances(context).insert("甄宓","固有技能", "女神的神核", "EX", "  作为与生俱来就是完成型的女神代表性的技能。是包含了神性的复合技能。维持着肉体和精神的绝对性。不会受到精神干涉，肉体也不会成长变化。");
            SkillDataBase.getInstances(context).insert("甄宓","固有技能", "洛水之神", "EX", "   是掌控水与冰的绝对力量，只要是液体就能够随意操控的魔法级别的权能。");
            SkillDataBase.getInstances(context).insert("甄宓","宝具", "河图洛书", "EX", " 是五行八卦数术的起源，也是能够操控风水，预知未来的终极宝具，因为产生于洛水的传说而成为了甄宓的宝具。");
            SkillDataBase.getInstances(context).insert("甄宓","宝具", "洛神赋", "A", "   相传是曹植为赞颂宓妃而写下的千古奇文，实际上是洛神的魔术原典：\n  翩若惊鸿，婉若游龙：洛神的神之武艺，惊鸿游龙般的剑法。\n   荣耀秋菊，华茂春松：御使生之力的技巧，操纵植物的魔术。\n   轻云蔽月，流风回雪：操纵大气的魔术，不同于奇门遁甲依靠改变风水来操纵大气，而是靠着操纵水的能力影响大气。\n  芳泽无加，铅华弗御：常驻的加护魔术，C级以下的攻击和诅咒无法对甄宓产生效果。\n    凌波微步，罗袜生尘：内按九宫八卦，十分飘逸的步法，使用后敏捷力大幅提升，同时难以被命中。\n   ......");
            SkillDataBase.getInstances(context).insert("甄宓","宝具", "洛水清波，沐浴人心", "EX", "    固有结界，借由洛神的权能召唤而来的洛河的具象化。由于哺育了中华文明的缘故，洛河拥有远超一般河流的幻想的力量，立于洛水之上的洛神无可匹敌。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","职阶技能", "对魔力", "C", " 无效化以二工程以下咏唱引起的魔术。不能防御大魔术、礼仪咒法等，大规模的魔术。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","职阶技能", "骑乘", "B", "  能够灵活驾驭较为优秀的坐骑和交通工具，但不能驾驭神兽、圣兽及龙。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","固有技能", "领导力", "A", " 指挥军团的天生才能，A级的领导力足以建立世界级的大帝国，但是由于多为英杰的阻拦，曹操的这个野望最终还是未能成功。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","固有技能", "军略", "A", "  多数人参加的战斗中的战术上的直感力。使用对军宝具，应对对手的对军宝具时获得正，曹操高超军事才能的体现。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","固有技能", "皇帝特权", "A", "    本来不能持有的技能，也可以因为本人的主张而能在短时间内获得。符合的技能是骑乘、剑术、艺术、统率力、谋略等。等级是A以上的情况下，连肉体层面的负荷（神性等）也能获得。虽然生前并没有称帝，但是千古威名和魏武帝的称呼还是令他拥有了这个技能。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","固有技能", "鉴识眼", "A", " 对于观察对象的人类将来会获得何种形式的可用性这一点，有着十分卓 越的眼力，曹操唯才是举政策的保证。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","宝具", "短歌行", "B", "   曹操在文学方面也有着无上的才能，《短歌行》就是他才华的终极体现。能够增加我方的士气与能力数值。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","宝具", "倚天剑", "A", "   三国时代的霸主之一曹操所铸造的两把神兵之一，拥有“破甲”的效果，能够对防具，结界等造成大幅度的损伤。另一把交付给了夏侯恩，最后被赵云所夺取。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","宝具", "绝影", "B", "    曹操生前所乘坐的名马，曾多次带着曹操逃离险情，影子都跟不上的绝世好马。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","宝具", "孟德新书", "C", "  曹操所作的兵书，能够使使军略一类的技能增加一个等级。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","宝具", "铜雀台", "EX", "  固有结界，是曹操与麾下文武共同构筑的时代神话。能够暂时召唤出曹操麾下的奇谋良将，其中不乏“郭嘉”、“典韦”等强大的从者存在。");
            SkillDataBase.getInstances(context).insert("吕布(奉先)","职阶技能", "狂化", "A", "  让参数等级提升，但夺去大部份理性。由于被强行与Master的战斗意识进行连结，所以变成了较机械性的Servant。");
            SkillDataBase.getInstances(context).insert("吕布(奉先)","固有技能", "无穷之武练", "A+++", "    在过去某个时代的盖世无双的武艺.由于将心、技、体完全融合为一,不管在何种精神制约下都能将自身的战斗能力完美发挥。");
            SkillDataBase.getInstances(context).insert("吕布(奉先)","固有技能", "反骨之相", "B", "    不会逗留在同一个地方，也不会拥戴同一个君主的天性。不适合亲自当君主，亦无法找到自己君主的流浪之星。将相同等级的「领导力」无效化。");
            SkillDataBase.getInstances(context).insert("吕布(奉先)","固有技能", "鬼神", "A++", "    鬼神般的怪力，使自身的筋力提高。效力几近顶级，其力量和巨人已是别无二致。");
            SkillDataBase.getInstances(context).insert("吕布(奉先)","宝具", "赤兔", "B", "    “人中吕布，马中赤兔”，赤兔乃是马中之王，拥有无匹的速度和力量，与吕布心意相通，二者加在一起时战力倍增。");
            SkillDataBase.getInstances(context).insert("吕布(奉先)","宝具", "军神五兵", "A", "  作为吕布奉先的主武器而广为人知的双手武器方天画戟的真名。能够变形成六个形态的多重兵器。就像是吕布一个人持有六名Servant的宝具一样。\n  “斩切”将所有物理防御无效化或者切断破坏的大伤害攻击。\n   “突刺”藉由枪的贯穿来封锁行动，并将纵列的敌人贯通的大伤害攻击。\n “打击”化为巨大的护臂提升防御力，或是承受住对手的攻击并且返还的特殊防御。\n    “刈割”横扫一横排敌人的大伤害攻击。\n   “挥扫”弹开物理系攻击的同时给予伤害的特殊反击。\n “射击”大口径波动炮一样的光束。");
            SkillDataBase.getInstances(context).insert("诸葛亮(孔明)","职阶技能", "阵地作成", "A", "   以魔术师的身份，创造出对自己有利的阵地。能做成远在「工房」之上的「石兵八阵」。");
            SkillDataBase.getInstances(context).insert("诸葛亮(孔明)","职阶技能", "道具作成", "B", "   能制作诸葛孔明生前所有的、如连弩等众多效果多样的武具和道具。然而实际上多是黄月英所发明的造物。");
            SkillDataBase.getInstances(context).insert("诸葛亮(孔明)","固有技能", "军师的忠言", "A+", " 军师系Servant的技能。能对战况进行分析，并给予对我方形势有用的建议。等级越高准确性越高。等级A+的情况下可以把意外事态在内、进行100%预测。若要对抗此技能，需要拥有非常强大的幸运。");
            SkillDataBase.getInstances(context).insert("诸葛亮(孔明)","固有技能", "军师的指挥", "A+", " 军师系Servant的技能，把包括自己在内的兵士最大力量发挥出来。等级A+的情况，能让士兵使出逼近“做好了死的觉悟”程度的实力。");
            SkillDataBase.getInstances(context).insert("诸葛亮(孔明)","固有技能", "空城绝技", "C", " 空城计传说的具现，诸葛亮本身力量极度虚弱时幸运会有额外的加成。");
            SkillDataBase.getInstances(context).insert("诸葛亮(孔明)","固有技能", "奇门遁甲", "B", "   黄承彦所教授的玄门数算，奇门遁甲之术，能够有限的推演未来，改变风水，甚至能够逆天改命。");
            SkillDataBase.getInstances(context).insert("诸葛亮(孔明)","宝具", "续命七星灯", "B", "    命不久矣时布下的续命法门，成功后便能逆转死亡的逆天数术，但是对于幸运属性有着苛刻的要求，A级以下就几乎不可能成功，即使是A级的幸运也有着一半的可能失败");
            SkillDataBase.getInstances(context).insert("诸葛亮(孔明)","宝具", "石兵八阵", "B", " 本军的败退不可避免之际布下的阵势。侵入这巨石构成的大阵之人会被就此迷惑，并被迫入死亡。\n    作为宝具则是将对方位处的场所强制改换为石兵八阵的大魔术。只要没有脱离石兵八阵，作为目标的众人每回合受到的追加伤害就会一直累积下去。");
            SkillDataBase.getInstances(context).insert("诸葛亮(孔明)","宝具", "出师表", "EX", " 诸葛孔明在编制讨伐敌国的军队时，为时年尚幼的皇帝留下的奏表。能够大幅度的增加我方的士气与能力数值");
            SkillDataBase.getInstances(context).insert("周瑜(公瑾)","职阶技能", "骑乘", "B", "  能够灵活驾驭较为优秀的坐骑和交通工具，但不能驾驭神兽、圣兽及龙。");
            SkillDataBase.getInstances(context).insert("周瑜(公瑾)","职阶技能", "对魔力", "B", " 较高的对魔力，可以毫不困难地无效化三节以下的魔术，即使是大魔术、仪礼咒法也难以给予其伤害。");
            SkillDataBase.getInstances(context).insert("周瑜(公瑾)","固有技能", "暴风航海者", "A", "   驱使被理解为船的东西的才能。由于也需要作为集团领袖的能力，所以也兼备了军事谋略、统率力效果的特殊技能。");
            SkillDataBase.getInstances(context).insert("周瑜(公瑾)","固有技能", "艺术审美", "C", "    “曲有误，周郎顾”，目睹在艺术界有着相关传说的宝具时，可以看破其真名。");
            SkillDataBase.getInstances(context).insert("周瑜(公瑾)","固有技能", "红颜美少年", "C", "   作为吸引他人的美少年的性质。发动时是对男女都有效果的魅惑魔术，但只要对方有反抗的意思的话效果就会减弱。拥有对魔力技能的话完全回避也是可能的。");
            SkillDataBase.getInstances(context).insert("周瑜(公瑾)","固有技能", "军师的忠言", "A", "   军师系Servant的技能。能对战况进行分析，并给予对我方形势有用的建议。等级越高准确性越高。");
            SkillDataBase.getInstances(context).insert("周瑜(公瑾)","宝具", "楼船之阵", "B", "  周瑜所率领的东吴水师，只要在水上就能够无敌的军队，拥有强大的作战的能力。即使是日常也会召唤出一艘楼船作为座驾。");
            SkillDataBase.getInstances(context).insert("周瑜(公瑾)","宝具", "赤壁之业炎", "EX", "    曾经一口气燃尽七十万大军的红莲业火，是将魏武帝击下神坛的火焰。即使是神明也不敢面对这缭绕着无尽冤魂的大火，面对越多的敌人就越是强大。\n    作为释放的代价，周瑜会进入持续的虚弱状态。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","职阶技能", "对魔力", "A", "    阿尔托利亚拥有能使魔法阵和瞬间契约大魔术无效化的对魔力。即便是当代最高等级的魔术师也不能用魔术直接伤害到Saber。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","职阶技能", "骑乘", "A", "    她是过去常在马上战斗的军人，成为从者后拥有B~A等级的骑驾能力。能娴熟的驾驭各种坐骑，包括了古代的双马战车和现代的陆上交通工具。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","固有技能", "直感", "A", "    “直感”是在战斗中一瞬间判明“对自身最适合行动”的能力。A等级的直感，已进入“预测未来”的领域。能通过风声和直觉预测弹道，回避枪械火器的攻击。对视觉·听觉的妨碍减半。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","固有技能", "魔力放出", "A", "    “魔力放出”是指通过魔力对自己的武器和肉体进行强化。换言之，就是用魔力来Jet喷射，A等级的话，能让原来贫弱无力的少女骑士拥有轻松压过多个强壮男性的力量。Saber战斗时所穿的银色铠甲也是用魔力编织成的。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","固有技能", "领袖气质", "B", "    足以治理一个国家的能力。依靠这个能力，阿尔托利亚可以使自己所率领的军队士气变得高昂。虽然能管理一个王国，但只有B等级的话无法建立世界级的大帝国。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","固有技能", "狩猎巨兽", "B", "    亚瑟王与蹂躏不列颠的诸巨兽作战，并将其悉数击倒。是表示具有丰富的「与巨大敌性生物作战的经验」的技能。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","宝具", "风王结界", "C", "    借着缠绕数层的风，而使光的折射率变化以遮盖剑身的结界。相比于宝具更接近于魔术。透过此结界，可让对方认不清剑招的距离与轨道而进行攻击。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","宝具", "必胜黄金之剑", "B", "    本来是为了选出王者的剑。对人宝具的『对人』所指的不是敌人，而是针对于接下来会持有它的人。当该名持有主是一名正确的王者，或是他完全成长的时候，其威力将会与圣剑之名相乎。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","宝具", "誓约胜利之剑", "EX", "    被当成亚瑟王的象征、最为强大、最为尊贵的圣剑。是在圣剑这一范畴中立于顶点的剑，锻造出它的并不是人类。以人们的想念为原料，在星球内部结晶化，作为“最强之幻想”的究极神造兵装之一。原来是由星之精灵管理着的，经过湖之少女的管理，以魔术师梅林为中介人，交付到了亚瑟王的手中。星之内海所生（炼成）的这把剑，据说在威胁这颗行星的外敌出现时，方可发挥真正的力量。\n将持有者的魔力变换成光，通过收束·加速来增加动量，再如同激光束一般从往下挥的剑的前端发放出来，藉以破坏万物，使得行使神灵等级的魔术成为可能的圣剑。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","宝具", "遥远的理想乡", "EX", "    誓约胜利之剑（Excalibur）的鞘，源于亚瑟王安息的妖精乡阿瓦隆的宝具。持有者会从任何伤势当中痊愈，就连老化的进行也会停止。另外透过解放它的真名，带来最强守护的结界将会展开。连基于魔法的干涉也无效化的这件宝具，其存在本身就等同于“魔法”。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","宝具", "闪耀于终焉之枪", "A++", "    圣枪。系住星辰的岚之锚。其真实姿态据说是系住世界表皮的塔。在真名解放时等级和种类会发生变化。纵使被十三拘束限制了其本来的力量，也将歌颂星辰之光而闪烁的至远之枪———圣枪伦戈米尼亚德将维系世界表层的「光之柱」为本体。由于和「拯救世界的星之圣剑」具有同等程序的十三拘束存在，处于勉强维持作为宝具身形的状态。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡(Alter)","职阶技能", "对魔力", "B", "    因染上了黑暗而比原来有所降低了。但级数依然高，会无效化B等级以下的魔术.");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡(Alter)","职阶技能", "骑乘", "E", "    在黑化引起的暴走状态里，不可能精妙地操纵缰绳，变得无法先考虑骑行兽或乘坐物的界限再运用。事实上骑乘技能被看作是丧失了。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡(Alter)","固有技能", "直感", "B", "    直感是在战斗中瞬间认清“对自己而言最适合的行动”的能力。在黑化状态下保持理性，需要不断的自我抑制。因为集中于抑制凶暴性，对外界的注意变得疏忽，直感力变迟钝。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡(Alter)","固有技能", "魔力放出", "A", "    让自己的武器和肉体带有魔力来进行强化的能力。体格上贫弱的阿尔托利亚能跟Berserker那般的怪物正面交锋，也是用魔力大幅度强化了身体能力的缘故。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡(Alter)","固有技能", "领袖气质", "E", "    过去作为崇高的王吸引与鼓舞士兵的魅力已经没有。由于以恐怖来率领，统率力上升但士兵的士气极为低。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡(Alter)","固有技能", "狩猎巨兽", "B", "    亚瑟王与蹂躏不列颠的诸巨兽作战，并将其悉数击倒。是表示具有丰富的「与巨大敌性生物作战的经验」的技能。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡(Alter)","宝具", "风王结界", "C", "    借着缠绕数层的风，而使光的折射率变化以遮盖剑身的结界。相比于宝具更接近于魔术。透过此结界，可让对方认不清剑招的距离与轨道而进行攻击。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡(Alter)","宝具", "誓约胜利之剑", "A++", "    阿尔托利亚最大的力量“誓约胜利之剑”即使黑化也健在。可是，其剑身染上了不吉的黑色。就像湖之精灵存在善恶（薇薇安和摩根勒菲）两面，圣剑也有反面。话虽如此，作为圣剑的“格”依然是最高。通过剑身将所有者的魔力变换成光、击出这一性能也没有变化，但其光改变成和刀身同样的漆黑的暗色。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡(Alter)","宝具", "闪耀于终焉之枪", "A++", "    圣枪。系住星辰的岚之锚。其真实姿态据说是系住世界表皮的塔。在真名解放时等级和种类会发生变化。纵使被十三拘束限制了其本来的力量，也将歌颂星辰之光而闪烁的至远之枪———圣枪伦戈米尼亚德将维系世界表层的「光之柱」为本体。由于和「拯救世界的星之圣剑」具有同等程序的十三拘束存在，处于勉强维持作为宝具身形的状态。");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","职阶技能", "对魔力", "C", "    无效化以二工程以下咏唱引起的魔术。不能防御大魔术、礼仪咒法等，大规模的魔术。由于她本身毫无对魔力，所以对魔力低到可以说是Saber职阶不应有。");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","职阶技能", "骑乘", "B", "    能够灵活驾驭较为优秀的坐骑和交通工具，但不能驾驭神兽、圣兽及龙。");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","固有技能", "皇帝特权", "EX", "    本来不能持有的技能，也可以因为本人的主张而能在短时间内获得。符合的技能是骑乘、剑术、艺术、统率力、谋略等。等级是A以上的情况下，连肉体层面的负荷（神性等）也能获得。");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","固有技能", "头痛", "B", "    从生前出生开始就继承的诅咒。由于有着慢性头痛，使用精神系技能的成功率会显著地降低。难得的艺术才能，也因为有这个技能而难以充分发挥。");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","固有技能", "即使迎来落日三度", "A", "    由她临死前经历三次落日一事演变而来的技能。");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","固有技能", "予天繁星,予地百花,予人爱恋", "A+++", "    「不论疾病 余来照料\n    不论健康 余来扶持   \n不论幸福 余来同享     \n在此起誓永远与余相伴！」");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","宝具", "陨铁之鞴[原初之火]", "B", "    Saber所持的深红色大剑。她被召唤成Saber职阶时所带过来的，她为自己亲手打造的武器。在Saber情绪高涨时会带有火焰。剑上刻着regnum caelorum et gehenna（拉丁语：天堂与地狱）的铭文。");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","宝具", "邀至心荡神驰的黄金剧场", "B", "    使用魔力来形成、重现出她生前于罗马兴建的剧场。她将亲自设计的剧场起名为Domus Aurea。据说这个剧场开张后，许多观众在第一次公演途中离去了。为此愤慨的她，在第二次公演时将出入口全部封锁了，直到演出落幕为止，哪怕是一个人都没有出到外面去。\n   她在作为一个皇帝之前，就深信不疑自己是个“匹敌乐神阿波罗的艺术家”与“匹敌太阳神的战车取手”。这是唯有抱持着这种想法的她才能够完成的，与固有结界相似而不相同的大魔术。达成自己愿望的绝对皇帝圈。");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","宝具", "童女讴歌的荣华帝政", "B", "    仅在“邀至心荡神驰的黄金剧场”展开中能够使用的剑技的名字");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","宝具", "星辰驰骋的终幕蔷薇", "B", "    原本只是单纯的剑技、但是本人强烈主张，如此大手笔、如此华丽、从新娘衣装中散发出的那压倒性的纯洁之力，就算称之为宝具也不过分吧？嗯？");
            SkillDataBase.getInstances(context).insert("阿尔提拉","职阶技能", "对魔力", "B", "    能够将咏唱少于三节的魔术无效化。即使使用大魔术、仪式咒法等方法难以将对其造成伤害。");
            SkillDataBase.getInstances(context).insert("阿尔提拉","职阶技能", "骑乘", "A", "    能自由驾驭除幻兽、神兽级别以上的所有野兽和交通工具。");
            SkillDataBase.getInstances(context).insert("阿尔提拉","职阶技能", "神性", "B", "    神灵适性的有无。阿蒂拉自身并没有与神灵的血缘关系，因蹂躏欧洲世界这个事实而被视作神威，成为了受人畏惧的对象，甚至得来『神之惩罚』、『神之鞭』两个名号。因为这个缘由，作为地上的英灵阿蒂拉持有高等级的神灵适性。");
            SkillDataBase.getInstances(context).insert("阿尔提拉","固有技能", "军略", "B", "    多数人参加的战斗中的战术上的直感力。使用对军宝具，应对对手的对军宝具时获得正。");
            SkillDataBase.getInstances(context).insert("阿尔提拉","固有技能", "天性的肉体", "EX", "    与生俱来，持有作为生物而言完全的肉体。可以暂时使筋力参数等级上升。加之，不论摄取多少卡路里，基本设计（体型）也不会变化");
            SkillDataBase.getInstances(context).insert("阿尔提拉","固有技能", "星之纹章", "EX", "    身体上刻画游星的纹章,某种高等术式所产生的纹——并不是匈人族特有的纹饰，而是阿蒂拉个人所有的不可思议的纹饰。等级越高威力越会增加。借著通过纹饰来消耗魔力，可以使任意的身体部位的能力提升。虽非魔力放出技能般爆发性的增幅，但是魔力消费少性价比高。而且，还是兼备直感技能效果的特殊技能。");
            SkillDataBase.getInstances(context).insert("阿尔提拉","固有技能", "文明侵蚀", "EX", "    英灵阿蒂拉本人无自觉地发动着的技能，手中的东西会向对于现在的自己最好的属性变化，「最好」不是说「优异」的意思、而是指阿蒂拉本人着迷的事物。");
            SkillDataBase.getInstances(context).insert("阿尔提拉","宝具", "军神之剑", "A", "    被欧洲全境所畏惧的“神之惩罚”、“上帝之鞭”所具有的武勇与恐怖，与“得到军神马尔斯之剑”这一逸话结合而成的宝具。宝具“军神之剑”虽然具有长剑的形状，但却不知为何是会让人觉得十分超前的设计。由三色光芒构成的“刀身”，据说能破坏存在于大地之上的“一切存在”。\n    透过施展真名解放，“刀身”会释放出如彩虹般的魔力光，阿蒂拉则如流星般以突进方式对敌方阵营进行广范围的歼灭。");
            SkillDataBase.getInstances(context).insert("阿尔提拉","宝具", "泪之星，军神之剑", "A++", "    这把光剑的真身，其实不过是用来指定攻击位置的某种指针罢了。解放真名的同时会针对阿蒂拉指定的地点从遥远的高空降下巨大的光柱进行广范围歼灭。说穿了就是来自卫星轨道上的镭射攻击。");
            SkillDataBase.getInstances(context).insert("阿塔兰忒","职阶技能", "对魔力", "D", "    将一工程的魔术行使无效化。驱除魔力的护身符程度的对魔力。");
            SkillDataBase.getInstances(context).insert("阿塔兰忒","职阶技能", "单独行动", "A", "   没有Master也能行动。不过使用宝具等需要庞大魔力的场合必须有Master的支援。");
            SkillDataBase.getInstances(context).insert("阿塔兰忒","固有技能", "跨越阿卡迪亚", "B", " 「吾遥远的故乡阿卡迪亚，险峻山岭连绵，吾跳跃于岩间游玩」\n   能够跨越场地上包括敌人在内的所有障碍进行移动。");
            SkillDataBase.getInstances(context).insert("阿塔兰忒","固有技能", "追逐的美学", "C", "  让敌人取得先手，然后自己能在确认敌人的行动后再抢先行动。纵然是在赛跑，她都一定会让对手先跑。");
            SkillDataBase.getInstances(context).insert("阿塔兰忒","固有技能", "金苹果", "C", " 「看吧，此乃命运之果实。此宝物只要轻轻一投，足以烧光那极尽繁华的特洛伊。尽情靠前观看吧」\n    炫耀宝物，吸引敌人靠近。");
            SkillDataBase.getInstances(context).insert("阿塔兰忒","固有技能", "狩猎卡莱敦的野猪", "A", "    阿塔兰特在狩猎卡莱敦的野猪时所展现的高超猎人技巧，等同于“直感”，是在战斗中一瞬间判明“对自身最适合行动”的能力。能通过风声和直觉预测弹道，回避枪械火器的攻击。对视觉·听觉的妨碍减半。");
            SkillDataBase.getInstances(context).insert("阿塔兰忒","宝具", "天穹之弓", "B", "  守护神阿耳忒弥斯所赐予的「天穹之弓」,领受过女神阿尔忒弥斯的祝福。藉向阿尔忒弥斯和她的弟弟阿波罗献上的祈祷，能以此发动强力的对军宝具“诉状的箭书”。");
            SkillDataBase.getInstances(context).insert("阿塔兰忒","宝具", "诉求的箭书", "B", "  「引弓放箭」这一概念具现化而成的宝具。射出祈求太阳神阿波罗与月女神阿尔忒弥斯加护的箭书。以给与敌方灾厄的形式授予Archer加护，天上降落豪雨一般的光箭，进行广泛围全体攻击。箭书会随机由阿耳忒弥斯和阿波罗的其中一方收到。由阿耳忒弥斯收到的话，在场的所有女性会变成目标，由阿波罗收到的话便是男性被瞄准。");
            SkillDataBase.getInstances(context).insert("阿塔兰忒","宝具", "神罚之野猪", "B", "  据说是被阿塔兰忒射杀的卡吕冬魔兽，藉将其外皮包裹身躯而获得魔兽之力的诅咒宝具。乍看之下像猪，但那只是偶然以猪作为依附生物罢了。\n    披在身上时封印天穹之弓，幸运外的全能力上升，并得到A级「狂化」和「变化」，给予敌人伤害能够恢复自己等量的生命力。但精神会被野猪控制，无法认知Master。由于已不再是Servant，也无法被观测情报。此状态下的弓名字改为「闇天之弓」，以魔力生成的箭不但可以迅速连发还全都具备宝具级威力。");
            SkillDataBase.getInstances(context).insert("美杜莎","职阶技能", "骑乘", "A+", "  美杜莎有着高等级的骑乘能力。而且该能力并非只能对特定的兽或乘坐物发挥，而是万能到几乎全部的兽，以至幻兽、神兽类都自由地驾御的程度。不过，连拥有极为优秀的骑乘能力的美杜莎，也被认为唯有龙种不能驾御。");
            SkillDataBase.getInstances(context).insert("美杜莎","职阶技能", "对魔力", "B", " 等级B的对魔力可以毫不困难地无效化三节以下的魔术。若更进一步地说，即使是大魔术、仪礼咒法，也难以给予美杜莎伤害。");
            SkillDataBase.getInstances(context).insert("美杜莎","固有技能", "魔眼", "A++", "   拥有最高级别的魔眼「库柏勒」。但是，平常处于封印状态中。被美杜莎的魔眼捕捉到者，对魔力（游戏为“魔力”）在C级以下时就会无条件石化。B级者则须受到豁免检定来判定是否被石化。虽然无法石化A级者，但会带给对方“重压”的效果，使全能力下降一个等级。");
            SkillDataBase.getInstances(context).insert("美杜莎","固有技能", "单独行动", "C", "    即使主人的魔力供给中断，也有暂时自力行动的能力。等级C，在失去Master(或是契约被废除)的状态下，美杜莎可以没有魔力供给持续现界1天左右。另外，因为美杜莎可以通过吸血来得到魔力，因此也可以视状况袭击人类，持续现界更加久。");
            SkillDataBase.getInstances(context).insert("美杜莎","固有技能", "怪力", "A+", "   虽为英灵却兼具怪物的特性，只有美杜莎才拥有的技能。使用的话能够短暂地提高筋力。对并不拥有适合接近战的宝具的美杜莎来说是不可或缺的能力，例如在拉起刺进了带锁链的短剑的对手时使用，其应用范围很广。接近战中发挥很高的战斗能力。");
            SkillDataBase.getInstances(context).insert("美杜莎","固有技能", "神性", "E", "   就像希腊神话所说的那样，美杜莎原本是美丽的女神。为此本来拥有非常高的神性。然而，因为她后来转变为怪物，所以也是个拥有通常英灵不能拥有的相反特性“怪物”的珍稀存在。");
            SkillDataBase.getInstances(context).insert("美杜莎","固有技能", "魅惑的美声", "B", "   与姐姐们所持的固有技能一样。对男性会有魅惑的魔术效果、但对魔力技能会使其回避可能。即使没有对魔力、只要有抵抗的意思也可以减轻效果。");
            SkillDataBase.getInstances(context).insert("美杜莎","固有技能", "变转之魔", "B", "   代表着英雄或者神灵在生前曾转变为魔物。通过强调过去曾存在的事实而大幅强化身为从者的能力的技能。戈耳工有着以人类之身绝对不可能拥有的筋力和耐久力等级。");
            SkillDataBase.getInstances(context).insert("美杜莎","固有技能", "恐怖的咆哮", "A++", "   能使生物本能地感受到恐惧的咆哮。使敌方全体恐惧、持续降低防御力、短时间内防御力大幅下降、并给予诅咒等状态。");
            SkillDataBase.getInstances(context).insert("美杜莎","宝具", "骑英之缰绳", "A+", "  美杜莎拥有的最大的攻击方法，攻防都具有超常的能力的强力宝具。没有单体效果，并非用于1对1的战斗的宝具，而是能扫灭广大范围的“对军宝具”。是缰绳与鞭子成对的珍稀类型的宝具，可以飞跃性地提高召唤出的幻想种的能力。实际攻击的时候，美杜莎会骑上被强化的幻想种，进行人马一体的突击攻击。");
            SkillDataBase.getInstances(context).insert("美杜莎","宝具", "自我封印·暗黑神殿", "C", "    美杜莎眼罩，作用于自身的“魔眼杀”。封印解除后便会一直使用“魔眼·Cybele”。美杜莎拥有的对人宝具之一，以一个结界(世界)封印住强力的魔眼。");
            SkillDataBase.getInstances(context).insert("美杜莎","宝具", "他者封印·鲜血神殿", "B", "    事先设置数个成为起点的魔法阵，从而形成。魔法阵设置后不久，只有略微夺取区域内人类体力的程度的效果；但是正式发动的话，结界内部的人类将会被急速溶解。但对于有魔术知识的人则稍为难以起效。之所以这样，是因为这并不是用来战斗的宝具，而是用吸血来获 得魔力的美杜莎，为了更有效率地聚集血液而制造出的结界。");
            SkillDataBase.getInstances(context).insert("美杜莎","宝具", "强制封印·万魔神殿", "A", "    放弃了作为女神最后的矜持，使曾经最终堕落后的姿态『戈耳工的怪物』暂时实体化，将指定领域内所有生命全部溶解。人类将会即刻毙命、对从者也能够造成强烈的伤害。");
            SkillDataBase.getInstances(context).insert("美杜莎","宝具", "不死杀之刃", "B", "    登场于希腊神话的神剑，形状特殊如镰刀一般，内侧带刃。虽然本身并不优秀，但被不死杀之刃伤到后伤口是绝对无法复原的。据说此剑有让不死属性无效的力量，英雄珀尔修斯以不死杀之刃砍掉了睡着的美杜莎的头。");
            SkillDataBase.getInstances(context).insert("尤瑞艾莉","职阶技能", "对魔力", "A", "    拥有能使魔法阵和瞬间契约大魔术无效化的对魔力。即便是当代最高等级的魔术师也不能用魔术直接伤害到她。");
            SkillDataBase.getInstances(context).insert("尤瑞艾莉","职阶技能", "单独行动", "A+", "   没有Master也能行动。不过使用宝具等需要庞大魔力的场合必须有Master的支援。");
            SkillDataBase.getInstances(context).insert("尤瑞艾莉","职阶技能", "女神的神核", "EX", "  作为与生俱来就是完成型的女神代表性的技能。是包含了神性的复合技能。维持着肉体和精神的绝对性。不会受到精神干涉，肉体也不会成长变化。");
            SkillDataBase.getInstances(context).insert("尤瑞艾莉","固有技能", "吸血", "C", " 可以通过吸血来得到魔力，因此也可以视状况袭击人类。");
            SkillDataBase.getInstances(context).insert("尤瑞艾莉","固有技能", "魅惑的美声", "A+", "   对男性会有魅惑的魔术效果、但对魔力技能会使其回避可能。只有坚定的意志才可以减轻效果。");
            SkillDataBase.getInstances(context).insert("尤瑞艾莉","固有技能", "女神的变化无常", "A", "    尤瑞艾莉的确是无垢与纯粹兼备。可喜怒无常、蛮不讲理的程度却也是无以复加。这种特性作用在魔术上也一样。");
            SkillDataBase.getInstances(context).insert("尤瑞艾莉","宝具", "女神的视线", "B", "    掳获勇士之心的女神魅力升华而成之物。愁闷悲苦的视线正是刀刃，摄魂夺魄的耳语正是剧毒。");
            SkillDataBase.getInstances(context).insert("斯忒诺","职阶技能", "气息遮断", "A+", "    完全隐藏自己的气息，几乎不可能被发现。但是在转入攻击状态之时，气息遮断的等级会大幅下降。");
            SkillDataBase.getInstances(context).insert("斯忒诺","职阶技能", "对魔力", "A", "    拥有能使魔法阵和瞬间契约大魔术无效化的对魔力。即便是当代最高等级的魔术师也不能用魔术直接伤害到她。");
            SkillDataBase.getInstances(context).insert("斯忒诺","职阶技能", "女神的神核", "EX", "  作为与生俱来就是完成型的女神代表性的技能。是包含了神性的复合技能。维持着肉体和精神的绝对性。不会受到精神干涉，肉体也不会成长变化。");
            SkillDataBase.getInstances(context).insert("斯忒诺","固有技能", "吸血", "C", " 可以通过吸血来得到魔力，因此也可以视状况袭击人类。");
            SkillDataBase.getInstances(context).insert("斯忒诺","固有技能", "魅惑的美声", "A", "   对男性会有魅惑的魔术效果、但对魔力技能会使其回避可能。只有坚定的意志才可以减轻效果。");
            SkillDataBase.getInstances(context).insert("斯忒诺","固有技能", "女神的一时兴起", "A", "    斯忒诺想的只有一件事。——这是否有趣。仅此而已，当兴致来时，任性的女神能够完成许多不可思议的事。这种特性作用在魔术上也一样。");
            SkillDataBase.getInstances(context).insert("斯忒诺","宝具", "女神的微笑", "B", "    掳获勇士之心的女神魅力升华而成之物。愁闷悲苦的视线正是刀刃，摄魂夺魄的耳语正是剧毒。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","职阶技能", "对魔力", "A", "    拥有能使魔法阵和瞬间契约大魔术无效化的对魔力。即便是当代最高等级的魔术师也不能用魔术直接伤害到她。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","职阶技能", "阵地作成", "B", "  建造出监狱城，将少女们监禁起来，榨取血液。本来是Caster职阶的能力，但由于生前的经历所以例外获得了。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","职阶技能", "战斗续行", "B", "  处于困境中的顽强生命力。受到濒死的重伤也能继续战斗。没有受到决定性的致命伤就能存活……虽然是这样的技能，不过对于这个Servant来说，会变成“不论被打倒多少次都会不知悔改的再次出现”的能力。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","固有技能", "拷问技术", "A", "    卓越的拷问技术。为拷问器具所造成的伤害施以正面补正。就这名Servant来说，将捉到的人类关进铁处女榨取血液，用屈指器或者拘束器具进行折磨使其发狂，有时还会像忽然想起来般地咬住手指、手臂、后颈或乳房并将其撕掉一块等等，她的残虐行为涉及到许多方面。配合上阵地作成的技能，简直是在杀人方面特化的Servant。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","固有技能", "嗜虐的领导力", "C", "    表示出作为支配阶级的威压。由于特殊的传承辅助，对于女性会上升一等级。面对男性的话奇妙地有些洁癖，虽然很喜欢隔着器具来触摸，但是直接触摸的情况很少。\n    指挥军队的才能。在复数对复数的战斗中提高己军的能力。拥有者稀少。B级的领袖气质就足以治理一国了。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","固有技能", "精神异常", "A", "    精神已然患病。并不是普通的Berserker身上被附加的狂化。变得感觉不到他人的痛苦，理解不了周围的气氛。精神上的霸体能力。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","固有技能", "无辜的怪物", "EX", "    这名Servant因为技能『无辜的怪物』而魔人化了。虽然看起来像恶魔一般，但是她的角和尾巴是龙的东西。虎牙似乎不是吸血鬼的牙齿而是龙的牙齿。\n    “无辜的怪物”是，由于从生前的行为中产生的印象使得过去和存在方式被扭曲，能力、姿态也会发生改变的技能。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","固有技能", "龙之息吹", "E", "    作为最强的幻想种，拥有仅仅是呼吸就能生成魔力的强大力量。身为最强幻想种的龙所放出的Mana湍流。虽然因为技能“无辜的怪物”而龙化了，不过有点像是在勉强自己，威力低微。\n   伊丽莎白的龙息属于超音波。她因为魔人化而使得肺部本身异界化，得到了惊人的肺活量。通过宝具增幅过的伊丽莎白的声音，甚至被认为是能响彻一个东京巨蛋并且让其倒塌的噪音。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","宝具", "龙鸣雷声", "D", "    将匈牙利自古流传的气候精灵，雷鸣之龙的威风变换成了宝具。Sarkany就是这条龙的名字。被认为是将声音和振动增幅，通过其共鸣来呼唤风雨。\n    本来的机能是将持有者的声音里的威严和领袖气质、治愈的波动、光是聆听就会摧毁心灵的恶意，又或者单纯是将声量增幅到9的9倍。不光是聆听者的身体，就连心灵也会被破坏和蹂躏的魔之歌声。据拉妮所说，龙鸣雷声的威力可以将一万头非洲象一击必杀。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","宝具", "鲜血魔娘", "E", "    召唤出伊丽莎白终生在其中君临天下的居城・监狱城赛伊特,把其当成衬托自己的舞台。唱着达到了毁灭级的音程以外的歌，展开等同于地狱般的舞台。");
            SkillDataBase.getInstances(context).insert("布狄卡","职阶技能", "对魔力", "D", "    将一工程的魔术行使无效化。驱除魔力的护身符程度的对魔力。");
            SkillDataBase.getInstances(context).insert("布狄卡","职阶技能", "骑乘", "A", "    能自由驾驭除幻兽、神兽级别以上的所有野兽和交通工具。");
            SkillDataBase.getInstances(context).insert("布狄卡","固有技能", "对女神的誓约", "B", "    布狄卡女王所许下对抗罗马，拯救不列颠的誓言，在面对视为“罗马”一方的敌人时能够强化自己的战斗力。");
            SkillDataBase.getInstances(context).insert("布狄卡","固有技能", "战斗续行", "A", "    让人在负了濒死重伤的状态下仍能够战斗的技能。并且伤患死亡率亦会下降。");
            SkillDataBase.getInstances(context).insert("布狄卡","固有技能", "安德拉斯塔的加护", "A", "    凯尔特胜利女神“安卓斯特”对于布狄卡女王的祝福，预示着胜利的祝福让女王在战场上一往无前。");
            SkillDataBase.getInstances(context).insert("布狄卡","宝具", "无以约定胜利之剑", "B", "    跟自己一样冠以“胜利”之名的单手剑。但是，绝对不是星之圣剑，也没办法约定什么胜利。只是一把心愿未竟之剑。真名解放之际，可以一次性地发射多重的魔力块。");
            SkillDataBase.getInstances(context).insert("布狄卡","宝具", "无以约定守护的车轮", "B", "    原本的模样是两匹名马拉动的战车。其为不列颠尼亚守护的象征，以高强的耐久力而著称。真名解放之际战车便会出现，守护布狄卡及其友军。虽然凯尔特众神的护佑使其得到了飞行能力，但突进的攻击力却并不如何强大。将其作为守护盟友的「盾」才是正确的运用方法。而她驱驰着战车的英姿，即便是在现代，也仍能从位于伦敦西敏区泰晤士河沿岸的铜像中得以领略。");
            SkillDataBase.getInstances(context).insert("源义经","职阶技能", "对魔力", "C", "    无效化以二工程以下咏唱引起的魔术。不能防御大魔术、礼仪咒法等，大规模的魔术。");
            SkillDataBase.getInstances(context).insert("源义经","职阶技能", "骑乘", "A+", "    能自由驾驭除幻兽、神兽级别以上的所有野兽和交通工具。");
            SkillDataBase.getInstances(context).insert("源义经","固有技能", "天狗的兵法", "A", "    源于她从身为非人存在的天狗学习过兵法的逸闻。对剑术、弓术、枪术等近接战斗力以及军略和对魔力等给予加成。");
            SkillDataBase.getInstances(context).insert("源义经","固有技能", "领导力", "C", "    指挥军队的才能。在复数对复数的战斗中提高己军的能力。拥有者稀少。C级的领导力还不足以治理一国。");
            SkillDataBase.getInstances(context).insert("源义经","固有技能", "燕之神技", "B", "    源义经如燕子般轻盈的飞跃，是能够增强敏捷的强大技巧。");
            SkillDataBase.getInstances(context).insert("源义经","宝具", "遮那王流离谭", "A++", "    牛若丸成长为源义经、直至身死奥州的一生中缔造的各式传说之具现。\n    自在天眼·六韬看破    对区域内的全员进行强制移动，改变为对本军压倒性地有利、而对敌军压倒性不利的状态。\n    薄绿·天刃缩步    藉薄绿施以炫光斩击。这以天狗步法缩地而出的一击，极其地难以躲避。\n    弁庆·不动立地    将且仅将武藏坊弁庆的肉体进行模拟再现。对弁庆的信赖越强，弁庆充作的盾就越坚固。至多能防御至B等级的对军宝具。\n    坛之浦·八艘跳    据传于坛之浦所展现出的八艘跳一举的具现化。不论立足点如何不利，只要有能够勉强落脚的地点便能藉跳跃进行移动。此外，也可以仅针对跳跃力进行强化。\n    吼丸·蜘蛛杀　　将薄绿原本的「力量」发挥出来，驱退周遭的「魔」，藉由声音附加伤害。");
            SkillDataBase.getInstances(context).insert("玛丽·安托瓦内特","职阶技能", "对魔力", "C", "    无效化以二工程以下咏唱引起的魔术。不能防御大魔术、礼仪咒法等，大规模的魔术。");
            SkillDataBase.getInstances(context).insert("玛丽·安托瓦内特","职阶技能", "骑乘", "A+", "    能自由驾驭除幻兽、神兽级别以上的所有野兽和交通工具。");
            SkillDataBase.getInstances(context).insert("玛丽·安托瓦内特","固有技能", "魅惑的美声", "C", "    既是能吸引人的魅惑系技能的同时，也是行使王权的力量的宣言。作为象征性的存在现界的玛丽，其歌声能对王权的敌对者造成魔力伤害。");
            SkillDataBase.getInstances(context).insert("玛丽·安托瓦内特","固有技能", "美丽的公主", "A", "    吸引周围的人的领导力性质。仅仅只是存在就能够吸引想成为守护自己的骑士的人。");
            SkillDataBase.getInstances(context).insert("玛丽·安托瓦内特","固有技能", "神之恩宠", "B", "    最高级别的美貌与肉体，展示“王权之美”的技能。");
            SkillDataBase.getInstances(context).insert("玛丽·安托瓦内特","宝具", "愿荣光存于百合的王冠", "A", "    象征法兰西光荣王权的宝具。其外观为，纳有法兰西皇家纹章（百合花纹章）的玻璃所构成的美丽马匹。藉由真名解放，玛丽便会唤来这匹宝马，在驱驰中将灿烂的光粒轻盈地撒满战场，对王权的敌对者施予伤害。同时也会解除友方的Bad Status，并回复体力和魔力。");
            SkillDataBase.getInstances(context).insert("玛丽·安托瓦内特","宝具", "万人爱戴的光辉将永垂不朽", "B", "    示出历代法兰西皇家权势的展现、以其巨大和优美著称的宫殿。玛丽及其友方的Status会暂时性地提高等级。即便王权业已失却，挚爱的重任和法兰西仍会永远地留存——将玛丽的这一信念作为新时代及发展的象征而苏醒的，即是这座Crystal Palace。至于和邻国英国在位于伦敦的世界博览会中建成的「水晶宫」同名一事，则断然不是什么嘲讽奚笑，而是将玛丽的爱所遍及的范围广大的展现才对。");
            SkillDataBase.getInstances(context).insert("玛尔达","职阶技能", "对魔力", "A", "    拥有能使魔法阵和瞬间契约大魔术无效化的对魔力。即便是当代最高等级的魔术师也不能用魔术直接伤害到她。");
            SkillDataBase.getInstances(context).insert("玛尔达","职阶技能", "骑乘", "A++", "    能自由驾驭除幻兽、神兽级别以上的所有野兽和交通工具。原本的骑乘技能无法乘坐的龙种，也例外地可以骑乘，连龙种都能驾驭的力量。");
            SkillDataBase.getInstances(context).insert("玛尔达","职阶技能", "神性", "C", "    作为救世主的旅途上的同行者，在水边之街将利维坦之子、邪龙塔拉斯克降服的圣人，玛尔达成为了被崇敬，崇拜的对象。");
            SkillDataBase.getInstances(context).insert("玛尔达","固有技能", "信仰的加护", "A", "    由信仰而生的，肉体与精神的绝对性。");
            SkillDataBase.getInstances(context).insert("玛尔达","固有技能", "奇迹", "D", "    时而将不可能化为可能的奇迹。与星之开拓者技能有着相似的部分，但本质上是不同的东西。能够适用的事物也不同。");
            SkillDataBase.getInstances(context).insert("玛尔达","固有技能", "天性的肉体", "A", "    玛尔达脱下圣衣后其肉体作为生物是完美的。一脱发现很厉害。虽然是显示肉体绝对性的技能，但也有作为对他人的魅惑技能的效果。");
            SkillDataBase.getInstances(context).insert("玛尔达","固有技能", "水边的圣女", "C", "    在船上进行了漂流，在罗纳河之滨制服了塔拉斯克的马大和水非常有缘。所处位置被认知为水边的时候，其攻击力会上升，变得亢奋起来。");
            SkillDataBase.getInstances(context).insert("玛尔达","固有技能", "雅各的手足", "B", "    雅各、摩西，然后到玛尔达，这样代代相传来的古老格斗技巧。如果能练到炉火纯青，连大天使都能打败。据传说，或曾习得这个技巧的圣者，打死了率领一万二千天使的『破坏天使』。宝具真名解放时玛尔达能够做出「那样的举动」，也都是因为这个技能。");
            SkillDataBase.getInstances(context).insert("玛尔达","宝具", "圣护手", "C", "    被圣子祝福过的圣护手，玛尔达引以为傲的武具，带上这对手套，即使是怎样的邪魔外道也能送他们上天堂(物理)。");
            SkillDataBase.getInstances(context).insert("玛尔达","宝具", "刀枪不入的龙之盾啊", "C", "    召唤塔拉斯克的甲壳为盾，保护自己或一位同伴。提升对象物理防御力并短时间免疫物理攻击。");
            SkillDataBase.getInstances(context).insert("玛尔达","宝具", "不懂爱的悲哀之龙啊", "A+", "    召唤怪兽塔拉斯克，真名读法和「刀枪不入的龙之盾啊」一致。\n    巨大的头部、遍布锐刺的甲壳、六肢脚、长有毒刺的长尾巴，持有这些特征的怪物，这正是塔拉斯克，旧约圣经中记载的海怪利维坦之子。无论水陆都能自在移动的龙种塔拉斯克潜伏在隆河底，使来往的船只沉到水里并大肆吃人，为了讨伐它而来访的战士们无论使用刃矢都会被那副大铁甲弹开，最后被它吐出的火焰烧成灰。\n    能个降伏这头无敌怪物的，只有圣女玛尔达。作为玛尔达的宝具被召唤出来的塔拉斯克，会以大铁甲龙·灼热大回转击将敌阵体无完肤的燃烧殆尽，彻底击溃。");
            SkillDataBase.getInstances(context).insert("美狄亚","职阶技能", "阵地作成", "A", "    作为魔术师得以制作对自己有利的名为「工房」的阵地。A级的话，甚至可以构筑比「工房」更加高级的「神殿」。");
            SkillDataBase.getInstances(context).insert("美狄亚","职阶技能", "道具作成", "A", "    可以制作带有魔力的器具，从用于战斗的道具到日用品，能自由自在地造出林林总总的物品。就连近似不死之药的药品也可调配出。龙牙兵也是用这个能力造出来的东西。此外，还能造出被称为“魔术礼装”的魔术道具,不过，以道具作成等级A自豪的美狄亚所制作的魔术礼装，和其他魔术师制作出来的东西相比有着天壤之别。");
            SkillDataBase.getInstances(context).insert("美狄亚","固有技能", "高速神言", "A", "    不连接魔术回路而能够发动魔术的咒文。瞬间契约，能以一工程的时间启动大魔术。辅佐魔术咏唱的技能。“神言”是各个神话时代所使用，也就是上级咒文言语 。人类的发声器官无法再现 。");
            SkillDataBase.getInstances(context).insert("美狄亚","固有技能", "金羊毛皮", "EX", "    传承于科尔基斯的金色的羊的皮。拥有“投向地上的话龙就会出现”的传说。");
            SkillDataBase.getInstances(context).insert("美狄亚","固有技能", "耐毒", "A", "    美狄亚对于毒素拥有强大的抗性，掌握着各种治疗咒法的她无论是怎样的毒素都可以解除。");
            SkillDataBase.getInstances(context).insert("美狄亚","宝具", "万符必将破戒", "C", "    魔女美狄亚的生涯所化成的概念法具。能够破戒一切魔术的短刀，能使被魔力强化的物体，由契约形成的紧密关系，由魔力赋予生出的生命回归初始的对魔术宝具。");
            SkillDataBase.getInstances(context).insert("美狄亚","宝具", "万疵必行修补", "C", "    “万符必将破戒”对应的治疗宝具。不论什么样的诅咒，魔法造成的损伤都回复成零。\n    “万疵必行修补”不是时间操作，是计算本来应该有的样子而进行自动修复。不知道的人只会认为是时光倒流吧，“死”之外所有的不讲理现象都可以打破，但是只有死者无法救回。");
            SkillDataBase.getInstances(context).insert("紫幽","职阶技能", "对魔力", "EX", "    紫幽作为混元圣人万法不侵，无论是怎样的魔术甚至是魔法都无法对她造成影响。");
            SkillDataBase.getInstances(context).insert("紫幽","职阶技能", "骑乘", "EX", "    即使是神龙、凤凰和麒麟这样的神兽都无法违抗她的命令，然而沉迷有教无类的她见到异兽也只是会把他们收作门徒，再加上本人遁术惊人，所以“骑乘”的技能相当于不存在");
            SkillDataBase.getInstances(context).insert("紫幽","固有技能", "玄门数术", "EX", "    最顶级的测算之术，只要不是同等级的圣人遮掩天机，无论过去、现在还是未来都能够掐指一算立刻知晓。");
            SkillDataBase.getInstances(context).insert("紫幽","固有技能", "上玄清气", "EX", "    紫幽所修炼的法诀，混沌初开的玄清气之一，威力到了可以重练地水风火，再造世界的地步。");
            SkillDataBase.getInstances(context).insert("紫幽","固有技能", "截教教主", "EX", "    紫幽作为截教之主的能力，包括统御力和传道受业的能力等等，是能够统治一个终极神系的能力。");
            SkillDataBase.getInstances(context).insert("紫幽","固有技能", "圣人之体", "EX", "    紫幽修成五气朝元，三花聚顶，也是万劫不坏的身体。不光威力惊人，也代表了作为女性的超越界限的魅力。");
            SkillDataBase.getInstances(context).insert("紫幽","固有技能", "神性", "EX", "    作为截教通天教主，拥有超越任何神明，仅次于鸿钧老祖的神性。");
            SkillDataBase.getInstances(context).insert("紫幽","宝具", "青萍剑", "EX", "    剑长三尺六寸五分。剑身与剑鞘通体皂黑，有青色莲花覆绕其上。三十六品净世青莲之莲叶所化，三大先天功德灵宝之一，由三清的师尊鸿钧老祖赐予。");
            SkillDataBase.getInstances(context).insert("紫幽","宝具", "诛仙四剑", "EX", "    天道第一凶器。一旦祭出顿时无穷毁灭之气笼罩混沌，无尽杀戮之色覆盖鸿蒙。有诗为证：\n      非铜非铁亦非钢，曾在须弥山下藏。\n      不用阴阳颠倒炼，岂无水火淬锋芒？\n      诛仙利、戮仙亡，陷仙四处起红光。\n      绝仙变化无穷妙，大罗神仙血染裳。");
            SkillDataBase.getInstances(context).insert("紫幽","宝具", "诛仙剑阵图", "EX", "    三千大道天魔尸身所化，结合诛仙四剑可以布下天道第一杀阵——诛仙剑阵，有炼化地水风火，再开洪荒世界的能力。");
            SkillDataBase.getInstances(context).insert("紫幽","宝具", "碧游宫", "EX", "    固有结界，实际上是通天教主的道场，除了作为仙宫召唤之外也能作为珍宝库使用，里面储藏着紫幽多年来的珍藏，其中不乏六魂幡、穿心锁，紫电锤等EX级别的宝物。");
            SkillDataBase.getInstances(context).insert("嬴政","职阶技能", "煌煌天子，神鬼莫侵", "A++", "    “对魔力”技能的升华，嬴政乃是最高位的天子，龙气加身，神鬼莫侵，拥有能使魔法阵和瞬间契约大魔术无效化的对魔力。即便是当代最高等级的魔术师也不能用魔术直接伤害到他。");
            SkillDataBase.getInstances(context).insert("嬴政","职阶技能", "率土之滨，莫非王臣", "EX", "    “骑乘”技能的升华，用来驾驭乘坐物的能力，始皇帝本人凌驾万物之上，就连龙种也无法拒绝他的命令。该技能就连让人类臣服，甚至让英灵效忠也不是做不到。");
            SkillDataBase.getInstances(context).insert("嬴政","职阶技能", "雷霆雨露，皆为君恩", "A", "    “道具作成”技能的升华，始皇帝本身就代表了人道主宰，任何被他使用过甚至触摸过的物品都蕴含了无尽的神秘。");
            SkillDataBase.getInstances(context).insert("嬴政","职阶技能", "普天之下，莫非王土", "EX", "    “阵地作成”的升华，始皇帝本人所在之处自有起运镇压，世间各处对于他来说都是“魔术工坊”等级的阵地。一手设计出咸阳城、长城、阿房宫等建筑的嬴政只要愿意，就能作为国土展开更加高级的阵地，甚至等同于“神国”。");
            SkillDataBase.getInstances(context).insert("嬴政","固有技能", "万皇之始，千古一帝", "EX", "    秦始皇是最初也是最伟大的皇帝，拥有着最高的特权，本来不能持有的技能，也可以因为本人的主张而获得，用心的话甚至有可能就此真正掌握。符合的技能是骑乘、剑术、艺术、统率力、谋略等。等级是A以上的情况下，连肉体层面的负荷也能获得。");
            SkillDataBase.getInstances(context).insert("嬴政","固有技能", "宇内八荒，天下一统", "EX", "    中央集权，给予始皇帝的特殊技能“一统”，体现嬴政做为中华历史上第一位皇帝制度的缔造者的技能。对始皇而言，则是进行了“车同轨，书同文，万事归一”之统一，是将纷繁万物全部归于为皇帝之概念下的统一。根据皇帝的意志，随心所欲地削弱乃至剥夺他人的技能，A以上的等级甚至能让其完全消失。");
            SkillDataBase.getInstances(context).insert("嬴政","固有技能", "天上天下，唯我独尊", "EX", "    嬴政一生毁城灭国无数，废分封立郡县，驱神魔而独尊，无数王族传承、神灵道统断绝与其手中，对持有“王”、“神”的概念或作为王、神灵的对手来说嬴政是致命的天敌。");
            SkillDataBase.getInstances(context).insert("嬴政","固有技能", "星之开拓者", "EX", "    赋予给成为人类历史转折点的英雄的特殊技能。一切困难航程、苦行会“仍旧不可能”地变成“可以实现的事情”，而对于人理来说没有比秦始皇的伟业更加不可能完成的奇迹了。");
            SkillDataBase.getInstances(context).insert("嬴政","固有技能", "超越时空的双重灵魂", "EX", "    说是双重的灵魂实际上是只有一个意识而有双倍的灵魂力量，所以可以同时以“saber”、“caster”的职介现界。由于灵魂间有着超越时空的力量，即使是抑制力也无法干涉。");
            SkillDataBase.getInstances(context).insert("嬴政","宝具", "履至尊而制六合", "EX", "    嬴政接受了封禅，抛弃王的封号，接受皇帝名号，致昆山之玉，有随和之宝，垂明月之珠，服泰阿之剑，乘纤离之马，建翠凤之旗，树灵鼍之鼓，加冕至尊之位，德兼三皇，功盖五帝，统御六合，四海宾服。\n    放弃隐蔽真名而解放这个技能，此时的嬴政才真正的取回了帝王的冠冕和权柄，解封昆山玉、随和宝、明月珠、泰阿剑、纤离马、翠凤旗、灵鼍鼓等一身A级以上的宝具，同时获得各种EX级别的能力：\n    作为千古一帝，受亿万人数千年膜拜而形成的远超任何神灵的“神性”；\n    超越人之极限，攻无不克战无不胜，能够建立跨星球级别帝国的“领导力”；\n    千金散尽复还来，足以短时间内颠覆国际金融的“黄金律”；\n    言出即法随，在领域内发布圣旨御令的绝对“言灵”能力。\n    眼识忠奸，唯才是举的“鉴识眼”。");
            SkillDataBase.getInstances(context).insert("嬴政","宝具", "筑长城而守藩篱", "EX", "    最终的防御宝具，嬴政为守卫国境而修筑的万里长城的具象化，A级以下只要是被判断有敌意，作为敌人的一切都无法突破这份防御。真名解放后转变为即使是EX等级的攻击也无法击破的结界。");
            SkillDataBase.getInstances(context).insert("嬴政","宝具", "削锋镝而铸金人", "EX", "    三千大道天魔尸身所化，结合诛仙四剑可以布下天道第一杀阵——诛仙剑阵，有炼化地水风火，再开洪荒世界的能力。");
            SkillDataBase.getInstances(context).insert("嬴政","宝具", "碧游宫", "EX", "    固有结界，实际上是通天教主的道场，除了作为仙宫召唤之外也能作为珍宝库使用，里面储藏着紫幽多年来的珍藏，其中不乏六魂幡、穿心锁，紫电锤等EX级别的宝物。");

        }
    }

    static void insertImage(Context context){
        Cursor query = CharacterDataBase.getInstances(context).query();
        File nf = new File(Environment.getExternalStorageDirectory()+"/FateDictionary");
        nf.mkdir();

        if (query.moveToFirst()) {
            do {
                int number = query.getInt(query.getColumnIndex("number"));
                String str = "a"+number;
                if (getResId(str)>0){
                    Bitmap imageBig = BitmapFactory.decodeResource(context.getResources(),getResId(str));
                    File f1 = new File(Environment.getExternalStorageDirectory()+"/FateDictionary", str+".png");
                    FileOutputStream out1 = null;
                    try {
                        out1 = new FileOutputStream(f1);
                        imageBig.compress(Bitmap.CompressFormat.PNG, 100, out1);

                        try {
                            out1.flush();
                            out1.close();
                        } catch (IOException e) {
                            e.printStackTrace();
                        }

                    } catch (FileNotFoundException e) {
                        e.printStackTrace();
                    }
                }
                if (getResId(str+"_little")>0){
                    Bitmap imageLittle = BitmapFactory.decodeResource(context.getResources(),getResId(str+"_little"));
                    File f2 = new File(Environment.getExternalStorageDirectory()+"/FateDictionary", str+"_little.png");

                    FileOutputStream out2 = null;
                    try {
                        out2 = new FileOutputStream(f2);
                        imageLittle.compress(Bitmap.CompressFormat.PNG, 100, out2);

                        try {
                            out2.flush();
                            out2.close();
                        } catch (IOException e) {
                            e.printStackTrace();
                        }

                    } catch (FileNotFoundException e) {
                        e.printStackTrace();
                    }
                }


            }while (query.moveToNext());
        }
    }

    private static int getResId(String imageName){
        Class mipmap = R.mipmap.class;
        try {
            Field field = mipmap.getField(imageName);
            return field.getInt(imageName);
        } catch (NoSuchFieldException | IllegalAccessException e) {//如果没有在"mipmap"下找到imageName,将会返回0
            return 0;
        }

    }
}