package com.type_moon.codeflame.fatedictionary;

import android.content.Context;
import android.database.Cursor;
import android.graphics.Bitmap;
import android.graphics.BitmapFactory;
import android.os.Environment;

import java.io.File;
import java.io.FileNotFoundException;
import java.io.FileOutputStream;
import java.io.IOException;
import java.lang.reflect.Field;

public class FirstInsert {

    public FirstInsert(){
    }

    static void insertCharacter(Context context){
        if (CharacterDataBase.getInstances(context).query().getCount() == 0){
            AddNumberDataBase.getInstances(context).insert(38);
            CharacterDataBase.getInstances(context).insert(1,"赵云(子龙)","lancer","男","184","85","常山真定","秩序·善","    身长八尺，姿颜雄伟，蜀汉五虎上将之一。\n    汉末军阀混战，赵云受本郡推举，率领义从加入白马将军公孙瓒。期间结识了汉室皇亲刘备，但不久之后，因为兄长去世而离开。赵云离开公孙瓒大约七年左右的时间，在邺城与刘备相见，从此追随刘备。","A","B","A+","A","EX","EX");
            CharacterDataBase.getInstances(context).insert(2,"孙尚香","archer","女","167","56","吴郡富春","中立·善","    孙夫人，乃孙权之妹，名曰孙仁。刘备向东吴借荆州不还，周瑜上书孙权，教使“美人计”，进妹予刘备为夫人，不料在诸葛亮的锦囊妙计安排下，假婚成真姻；后来夫人更助刘备返蜀，于路上怒斥追袭的吴将。后刘备入益州，孙权闻知刘备西征，遣周善引领舟船以迎孙夫人，而夫人带着后主刘禅回吴，幸得赵云与张飞勒兵截江，方重夺刘禅。\n    彝陵之战，刘备战败，有讹言传入吴中，道刘备已死，孙夫人伤心不已，望西痛哭，投江而死。后人为其立庙，号曰“枭姬祠”。","B","C","A++","B","A++","B");
            CharacterDataBase.getInstances(context).insert(3,"黄月英","caster","女","160","41","沔南白水","混沌·中庸","    黄承彦之女,有传闻说她容貌甚丑却知识广博。也有传闻说其极美，故意令黄承彦提亲时说自己貌丑以试探孔明心意。\n  黄月英十分擅长机关术，曾制木虎、木犬、木人等物，无需人力操控即可自动。诸葛亮发明木牛流马，据说也是从黄月英的传授的技巧上发展出来的。","E","D","C","A+++","A","EX");
            CharacterDataBase.getInstances(context).insert(4,"蔡琰(文姬)","caster","女","165","50","陈留圉县","秩序·善","    东汉大文学家蔡邕的女儿。初嫁于卫仲道，丈夫死去而回到自己家里，后值因匈奴入侵，蔡琰被匈奴左贤王掳走，嫁给匈奴人，并生育了两个孩子。十二年后，曹操统一北方，用重金将蔡琰赎回，并将其嫁给董祀。","E","C","D","A++","D","EX");
            CharacterDataBase.getInstances(context).insert(5,"貂蝉","assassin","女","171","58","未知","中立·善","    中国古代四大美女之一，因遭十常侍之乱，避难出宫，为司徒王允收留为歌女。董卓祸乱朝纲，残忍暴戾，貂蝉挺身而出离间董卓和他的义子吕布，最终铲除了权倾一时的董卓。","D","D","A+","B","A+","EX");
            CharacterDataBase.getInstances(context).insert(6,"甄宓","caster","女","165","44","中山无极","中立·善","    文昭甄皇后，上蔡令甄逸之女。魏文帝曹丕的正室，魏明帝曹叡的生母。初嫁与袁熙，袁氏败亡后，被曹丕纳为己有。\n    甄氏风华绝代，曹植以《洛神赋》赞之。","B","B","B","EX","B","EX");
            CharacterDataBase.getInstances(context).insert(7,"曹操(孟德)","saber","男","165","60","沛国谯县","秩序·中庸","    东汉末年，曹操以汉天子的名义征讨四方，统一了中国北方，并实行一系列政策恢复经济生产和社会秩序，使中原社会渐趋稳定、经济出现转机。 \n    精通兵法，重贤爱才，诗歌气魄雄伟，慷慨悲凉；散文亦清峻整洁，开启并繁荣了建安文学。","C","C","D","A","A++","EX");
            CharacterDataBase.getInstances(context).insert(8,"吕布(奉先)","berserker","男","225","153","五原九原","混沌·恶","    原为丁原部将，被唆使杀害丁原归附董卓，与董卓誓为父子，后又被司徒王允唆使诛杀董卓。 兴平元年，吕布趁曹操攻打陶谦时与陈宫等叛乱，先后击败刘备与夏侯惇。曹操亲自出马征讨吕布，水淹下邳，吕布被部下叛变，城破被俘，被处死。\n    历史上吕布以勇武闻名，号称“飞将”，时有“人中吕布，马中赤兔”之说。","A+++","A+","A","C","C","A+");
            CharacterDataBase.getInstances(context).insert(9,"诸葛亮(孔明)","caster","男","182","65","琅琊阳都","中立·善","    早年随叔父诸葛玄到荆州，诸葛玄死后，诸葛亮就在隆中耕种。后刘备三顾茅庐请出，辅佐刘备建立蜀汉。蜀汉建立后，诸葛亮被封为丞相、武乡侯，内抚百姓，对外联吴抗魏，为实现兴复汉室的政治理想，数次北伐，但最终失败，最后病逝于五丈原。","D","D","C","A+++","B","EX");
            CharacterDataBase.getInstances(context).insert(10,"周瑜(公瑾)","rider","男","185","75","庐江舒","中立·中庸","    长壮有姿貌、精音律，江东有“曲有误，周郎顾”之语。\n     少与孙策交好，21岁起随孙策奔赴战场平定江东，后孙策遇刺身亡，孙权继任，周瑜将兵赴丧，以中护军的身份与长史张昭共掌众事。建安十三年，率军与刘备联合，于赤壁之战中大败曹军，由此奠定了“三分天下”的基础。","B","C","B","A++","B","EX");
            CharacterDataBase.getInstances(context).insert(11,"阿尔托莉雅·潘德拉贡","saber","女","154","42","英格兰","秩序・善","    不列颠传说中的王，被称为骑士王。阿尔托莉雅是幼名，从成为王的那一天起就被称为亚瑟王。在那个骑士道如花般凋零的时代，用手中的圣剑为不列颠带来了短暂的和平与最后的繁荣。虽然史实上是男性，但在这个世界似乎是男装的丽人。\n    是一位秉持“万民都能更好地生活，过上更好的人生”理想的王。锄强扶弱的无可非议之人。沉着冷静，有着做什么都很认真的优秀性格。……但是寡言少语中有着不服输的天性，所以有关胜负之事绝不手软，输了的话会满心悔恨。\n    亚瑟王传说的最后是骑士时代的终结。尽管亚瑟王击退了异民族，不列颠的土地却没能回避破灭。由于圆桌骑士之一的莫德雷德的叛逆，国土一分为二，骑士之城——卡美洛黯然失色。\n    亚瑟王在剑栏之丘讨伐击败了莫德雷德，但自己也身负重伤。一息残留之际，他将圣剑托付给最后的心腹贝狄威尔，之后便与世长辞。\n    传说亚瑟王死后被送到了理想乡——远离尘世的乐园・Avalon，并会在遥远的未来再次拯救不列颠。","A","A","A","A+","A++","EX");
            CharacterDataBase.getInstances(context).insert(12,"阿尔托莉雅·潘德拉贡(Alter)","saber","女","154","42","英格兰","秩序・恶","    被圣杯的诅咒侵蚀，骑士王那冷酷无情的另一面。也许，有的只是作为亚瑟王追求的“理想的王”这一样事物。平常的阿尔托莉雅在约束、控制自己的力量，而这个状态的她却毫不犹豫地展现自己强大的魔力。铠甲被染成漆黑，重量也随之增加的缘故，和通常时相比力量也增加了。\n    相反地，聪敏程度似乎下降了。没有多余的言行，冷静而透彻的性格使阿尔托莉雅看起来像是变成了另一个人，但注意深入接触的话会发现其本质的存在（和原来的阿尔托莉雅）依旧是一样的。\n    即使是生前从未堕入罪恶之道的阿尔托莉雅，她的内心也存在着迷茫与纠葛、对自己的愤怒、对周遭的叹息。这副姿态就是由那些诅咒表面化而来，将她的“方针”彻底反转颠覆的存在。\n    其目的和理想本身并没有发生变化，正常状态的阿尔托莉雅为了理想贯彻自己的纯洁，而这一位阿尔托莉雅会想要为了理想而施行暴政。\n    不知道是不是因为魔力炉心是规格外的缘故，总之是特别能吃的Servant。她那可以说是到了个性般的对吃的嗜好也产生了变化，对有着精细、精巧、玄妙的味道的料理觉得难吃而厌恶，却对大量的垃圾食品情有独钟地寻觅并胡吃海塞。虽是异常不好的恶劣饮食习惯，但是本人对此非常满足所以这就是所谓的幸福吧。\n","A","A","C","A++","C","EX");
            CharacterDataBase.getInstances(context).insert(13,"尼禄·克劳狄乌斯","saber","女","150","42","罗马","混沌・善","    自称是男装的丽人。既自我至上主义又自私任性，明朗豁达，像小孩子一样天真无邪、被万人爱戴的无所不能恣意妄为的皇帝。本名，尼禄・克劳狄乌斯・凯撒・奥古斯都・日耳曼尼库斯。罗马帝国的第5代皇帝。生涯被涂上谋略与毒之色彩的恶名昭彰的暴君。\n    自称是艺术家，有着独特的审美观。美貌的男子不论年纪都很喜欢，对于美丽的少女也十分有兴趣。只要是美丽的东西，什么都喜欢。将自己的一切讴歌为至高的艺术，也把各种各样的人生赞美为美妙之物。……虽然是无需多言的事，这样享受着人生的她的姿态本身也如同一朵盛开的蔷薇。\n    将罗马的人们的幸福与繁荣考虑在第一位的皇帝。自己也是享受人生的达人，特别是在歌剧方面有着无人能出其右的自信。（也仅仅是自信而已）据说听过她的歌声的人，三天三夜都受其影响的折磨，连做梦做的好像都是见到了蔷薇的（恶）梦。\n    在西历50~60年代的罗马，被各种宗教势力与罗马元老院压制着的皇帝。由于罗马时代对元老院的态度、对基督教徒进行镇压的原因而被称为暴君。根据这个逸话，能与记述于旧约圣经中的毁灭都市的666之兽、巴比伦的大淫妇视为同一存在……？","B","C","A","B","A","B");
            CharacterDataBase.getInstances(context).insert(14,"阿尔提拉","saber","女","160","48","中亚～欧洲","混沌・善","    成就了大帝国的伟大王者，阿提拉。匈奴的末裔，被拥为王的匈族战士。制霸了从西亚、俄罗斯、东欧到高卢的广大版图的五世纪的大英雄。据说是她招来了东西罗马帝国的灭亡。\n   有着卓越的第六感，碰上什么事情都能保持冷静加以应对。虽然是个骄傲而理智的战士，但某处却也有着“空虚”的部分。战斗的时候之时既能冷静地正确把握状况，也能同时化身战斗机器进行惨无人道的杀戮。\n    其人有着卓越的第六感，碰上什么事情都能保持冷静加以应对。虽然是个骄傲而理智的战士，但某处却也有着“空虚”的部分。战斗的时候之时既能冷静地正确把握状况，也能同时化身战斗机器进行惨无人道的杀戮。正可谓是纯粹的“战斗王”。与战场建立的武勋相反，他的统治却没能维持，在死后急速陷入了瓦解并最终消失。然而直到现在，人们都还没能完全摆脱“阿提拉”这一名号宣示的畏怖与恐惧。    \n对圣杯的愿望是——“希望能过一次不做战士的人生”。这决非对身为战士的自己有所厌恶。只不过是，对若非以战士而生下的自己会过着怎样的人生，有所好奇而已。","B","A","A","B","A","A++");
            CharacterDataBase.getInstances(context).insert(15,"阿塔兰忒","archer","女","166","57","希腊","中立・恶","    希腊神话登场的著名女猎人。因在狩猎卡吕冬野猪的过程中最先射中野猪而扬名。此外，她也是希腊豪杰云集的阿尔戈众英雄中的一员。\n    阿塔兰忒是某个国王的女儿。但是她却没能得到想要儿子的父亲的疼爱，反而被遗弃在了森林中。阿尔忒弥斯见此于心不忍，就用母熊的乳汁把她哺育成人。\n    长大的阿塔兰忒最终成为了无人能及的猎人，还完成了狩猎卡吕冬野猪、参与阿尔戈号远航之类的诸多冒险。慕名而来的求婚者却也因此不计其数。不厌其烦的阿塔兰忒，就统统以赛跑输赢定夺。\n    赛跑中未尝败绩的阿塔兰忒，却最终因男方借助了女神的力量，而输给了对方的奸计，半是强迫地被对方娶走了。虽未被明确证实，不过后来似乎也有受到惩罚变成狮子的传说。","C","D","A","B","C","C");
            CharacterDataBase.getInstances(context).insert(16,"美杜莎","rider","女","172","57","希腊、无形之岛","混沌・善","    希腊神话登场的戈耳工三姐妹的幺妹。本来是本土的地母神，因为奥林匹斯众神的策略和人们的狂信而逃到无形的岛屿上生存。被描述为能把看到的东西变为石头的蛇妖。虽是美人却能感觉到带刺的气质，只能从冰冷的言行中感觉到她冷酷无情的性格，但她只是单纯觉得麻烦，是个可以的话能什么都不做就这样下去的美女。喜欢喝酒看书。这样严苛的言行是为了不让对手留下好的印象。\n    虽然是个身材高挑、气质超群的美女，但对于美杜莎而言她觉得美丽的标准是“娇小可爱的样子”，因此高挑又像大人般的形象让她有些自卑感。\n    戈耳工三姐妹中唯一“成长”了的女神。由于只是被人们爱着的女神，成长为拯救（支配）人们的女神的要素也有，但是来自人类那里的迫害让她染上恨意，最后成为了被英雄杀死的魔兽。","A++","A++","A","B","D","A+");
            CharacterDataBase.getInstances(context).insert(17,"尤瑞艾莉","archer","女","134","30","希腊、无形之岛","混沌・善","    希腊神话中的戈耳工三姐妹的次女。男性憧憬的具现化，完成的作为“偶像”“理想的女性”生成的堕落的女神。集无垢与纯粹为一身的美丽少女。\n    对美丽、可爱的东西就不计一切地献上油然的爱意。对丑陋之物则是无条件地心生嫌恶。说到底她就是令男性如此倾心的“可爱少女”。至少，是装作如此的。\n    她的确是无垢与纯粹兼备。可喜怒无常、蛮不讲理的程度却也是无以复加。按她的思考方式，只要不出声就不会被迁怒，没有露馅就不算耍花招，抱有诸如此类的想法（但是事后会讨厌这样的自己）。\n    作为位列古代希腊众神的一位，本来，是不能作为从者被召唤的。而且，作为永远的美貌的代价可以说是这世上最弱的家伙……本来应该是这样的女神，却伴着从者化而变得稍微强了一点点。","E","E","C","EX","EX","C");
            CharacterDataBase.getInstances(context).insert(18,"斯忒诺","assassin","女","134","30","希腊、无形之岛","混沌・善","    希腊神话中的戈尔工三姐妹的长女。男性憧憬的具现化，完成的作为“偶像”“理想的女性”生成的堕落的女神。有尤瑞艾莉、美杜莎两个妹妹。\n    不管是怎样的男人都对她奉承并充满赞美。兼备优雅与高尚，更加深入地说也有极度懒惰的性质。对于非常好的对手极其冷酷。到了能使冥府的看门狗发抖的地步。\n    虽然只要逮着机会就会跟另一个自己（斯忒诺）一起欺负妹妹（美杜莎），但她是真心喜欢着妹妹。——是爱着才对。发自心底地。至死不渝。\n    她并没有要对圣杯许下的愿望。硬要说的话只有：姐妹三人永远生活在一起。但是，她也知道这是不可能完成的愿望。降临到现世的她如今想的只有一件事。——这是否有趣。仅此而已。","E","E","B","EX","EX","B");
            CharacterDataBase.getInstances(context).insert(19,"伊丽莎白·巴托里","lancer","女","154","44","匈牙利","混沌・恶","    吸血鬼卡米拉的原型的血之伯爵夫人。……但是，作为从者被召唤的是她尚未犯下罪行之前十四岁的姿态。自称偶像的甜食系从者。高贵、霸道、残忍、无情，但其实并不像传说里一样惨无人道。\n    虽然是邪恶的反英灵，却同时也是个向往恋爱的少女。性子上胆小的部分简直是灾难，结果上要么是帮了自己人，要么就是放跑了敌人，会在关键时刻“哎，怎么说也是个英灵嘛”地发起善心来。但她很讨厌被人说“其实是个好人来的吧？”之类的话。\n    尽管是生为贵族而没有一般人的道德观念，又因为技能“头痛”不把别人当人来看的伊丽莎白，这次也因为有所改悔、或者说是有所成长的关系，在本作成了还算懂事的乖乖反英灵。","A+","A+","A+","A","A+","C");
            CharacterDataBase.getInstances(context).insert(20,"布狄卡","rider","女","174","62","英格兰","中立·善","    一世纪时，古代不列颠年轻的战斗女王。罗马帝国无情的侵略甚至令她的女儿们都被凌辱，无法忍受的她最终率领诸王发动了叛乱，但在皇帝尼禄的军势之下失败而丧命。后来，不列颠就流传起了“胜利女王”的传说。\n    她热爱着不列颠尼亚的一切。爱着清风与大地。爱着鲜花与草木。爱着泉水与清流。爱着虫豸与鸟兽。以及，她最热爱的人民。然而，那一天，那一刻。她的夫君普拉苏塔古斯王去世了——等待着她和女儿的是残酷到极致的命运。嘲笑与侮蔑。暴力与凌辱。痛苦与鲜血。虽然身心都受到深深的伤害，她依然下定了决心。要对罗马发起反抗。要将故乡守护到底。要（为自己与女儿）复仇。就这样，她成为了年轻的战斗女王。\n    不列颠、英国……对所有与不列颠岛有关的后世的英灵，她都抱着如同对待自己孩子的慈祥胸怀。尤其，对虽说只有一时，但却为故乡之地带来「胜利」的骑士王完全抱持着——大概是非常想亲近的亲戚家的姐姐般的感情吧。\n    在近代以后的英国拥有深厚信仰的她，现在已经失去了过去战斗中的激昂。作为英灵存在的布狄卡，现在以她本来的姿态，也就是作为一个慈爱的女性挥舞手中之剑。思念着不列颠尼亚、思念着故乡，以一位母亲的力量（投身于战斗之中）。","B","A","B","D","C","B+");
            CharacterDataBase.getInstances(context).insert(21,"源义经","rider","女","168","55","日本","混沌·中庸","    日本可谓无人不知无人不晓的悲运武将。与天赋异禀、受人拥戴的哥哥赖朝疏远，最后与从者弁庆一同被打倒。牛若丸是源义经的幼名。\n    说源义经（牛若丸）是日本史上最为有名的武将也不为过。能够拥有堪比她的知名度的，只有像织田信长那样的人物了吧。……只不过，在历史上存在许多不明了的疑点，尤其是举兵之前的半生都被包裹在谜团之中。传说在十一岁时，被托付给鞍马寺的牛若丸与阴阳师鬼一法眼（一说他遇到的是鞍马天狗）相遇，并被传授了兵法。虽然作为优秀的兵法家是毫无疑问的事实，但义经缺少着致命的东西。那就是对战场的恐惧。她的整个生涯中，都与其他的武将无法相容。赖朝对义经抱有杀意这件事，她大概终生都没能理解吧。那是由于作为天才的她不存在对能力的恐惧的缘故。","D","C","A+","B","A","A+");
            CharacterDataBase.getInstances(context).insert(22,"玛丽·安托瓦内特","rider","女","160","48","法兰西","秩序・善","    身负哈布斯堡家的系谱的法国王妃。十八世纪路易十六的妃子，梦幻般的贵妇人。是欧洲世界的“以高贵进行支配”的象征般的存在。在王权的绝对性逐渐丧失的时代的奔流中，在世界发生变化之前殒命。\n    天生的偶像,只是微笑就能治愈众生，一个眼神就能使人心醉。因为能受人爱戴而对作为天生的偶像之事感到喜悦，决定继续为了回应人们的期望而行动。那份精神的特性，某种程度上已经接近女神了。\n    虽然在革命期成为了许多人憎恨的对象，但现代的法国为她恢复了名誉。在饥荒的状况下削减宫廷费用来支付捐款，亲自为民众向贵族们寻求援助等，被认为一位是心系万民的女性。\n    悲剧发生了。但是——她决不会向圣杯许愿，将这悲剧消去。她只是想要完成自己的使命而已。也就是，使天空充满光辉，使大地布满恩惠。————使人民，感到幸福。","D","D","B","A","B","A+");
            CharacterDataBase.getInstances(context).insert(23,"玛尔达","rider","女","161","49","欧洲","秩序・善","    镇服了恶龙塔拉斯克的一世纪的圣女。与妹妹和弟弟一起被传颂，成为人们信仰的救世主。拥有美丽的容貌，热情洋溢，完美无缺的人。——连恐怖的怪兽都为之倾倒的神圣的少女。\n    救世主被处刑之后也不曾舍弃信仰，被时任的罗马总督流放也没有死去，而是受到神的恩宠而向着法国南部漂流。在罗讷河沿岸的奈鲁克镇，与令人们感到痛苦的暴虐之龙对峙。\n    外表内心都是完美的圣女，由于妹妹的存在，基本上像姐姐风格的言行会比较多。温柔纯洁，稳重和蔼——仿佛没有一处不闪耀着的人。只是……特别是对和她成为亲密之人的对象来说，也有见到“不是圣女的马大”的可能性。\n    “不是圣女的马大”表情与言辞都会变得锐利，变得好动好胜，这是圣女以前“与弟弟妹妹一起生活的城里姑娘”时候的样子，但在这种言行之下她的内在仍然保持是圣女，主要是隔阂的开启与关闭的区别。","B","B","B","A","A+","A+");
            CharacterDataBase.getInstances(context).insert(24,"美狄亚","caster","女","163","51","希腊、科任托斯","中立・恶","    拥有金羊毛皮的埃厄忒斯王的女儿，被月之女神赫卡忒教授魔术，因为英雄伊阿宋从国家离开，由于长期流浪的结果被刻上背叛的魔女的烙印而离世。\n    将面容隐藏在斗篷下的女魔术师。冷酷、残忍、为了目的不择手段，擅长各种奸计的名副其实的恶女。但是，这个性格是她为了反抗自己背负的命运所形成的。由于连续遭到背叛的结果，如今自己也堕入了自己背叛别人的立场的悲剧的女性。\n    暂时相处一段时间就谁都能明白的事，由于是深闺中的公主，是个有正规根性持有良知与道德的大小姐。本来是个清纯的女性，为迷恋之人竭尽一切的才女。虽然这么说，但对迷恋的对象故意作态与逃避自己已有的创伤贯彻了退一步的态度。不擅长应对诚实的人。","E","D","C","A+","A","C");
            CharacterDataBase.getInstances(context).insert(25,"紫幽","saber","女","162","49","中国","秩序・中庸","    盘古三清之一的上清通天，三清中的老幺，六大混元圣人之一，无论法宝还是法力都是六者中最强的。“紫幽”是本名，然而就连两位兄长也不得而知。创立截教，教系是三教中势力最大的派别，故而门下仙人数量最多，享有“万仙来朝”之誉。门人弟子多为兽禽异物修炼得道而化形，故此常被阐教、人道称为不够正宗：“不分披毛带角之人，湿生卵化之辈，皆可同群共处。”\n    紫幽外表高冷，实则性格坚毅且，豪爽，比较护短，封神一战中受不了其余的圣人亲自下场打杀她的门人，竟然摆下“诛仙阵”、“万仙阵”与他们正面对抗，最终以一敌四惜败。\n    紫幽的对剑的领悟作为saber来说无人能及，然而应为对于道的造诣更高所以没有成为冠位。本人觉得女性作为一教之主没什么威严所以从来都以男装出镜，然而实在是张不出胡子，所以才有老子、元始天尊都是中老年形象而通天教主确实年轻人的言论。\n    作为混元圣人的紫幽其实不可能作为servent现界，然而因为一个人寂寞了太久突发奇想想要谈恋爱所以任性的响应了召唤。事实上就是一个闭关了太久的宅女天然呆。" ,"A+++","EX","EX","EX","EX","EX");
            CharacterDataBase.getInstances(context).insert(26,"嬴政","saber","男","185","71","中国","中立・中庸","    秦始皇，又名赵政、秦政，或称祖龙，中国历史上著名的政治家、战略家、改革家，首位完成华夏大一统的铁腕政治人物，“千古一帝”是中国历史上一位叱咤风云富有传奇色彩的划时代人物，对中国和世界历史产生深远影响。\n    嬴政本人天纵奇才，不光是绝无仅有的政治家、战略家、改革家，还在神秘学、武学和科学技术方面卓有成效，几乎是以一己之力改变了整个人类历史的进程，可以称得上是结束了诸神行走世间的神代，开启了只属于人类的时代，以科学替代神秘推动了人类文明的发展，并且建立了万古未有的盛世帝国。\n    十三岁便继承了王位，然后一口气击败了诸多政敌掌握大权，然后厉兵秣马，辅以超越时代的技术，只耗时五年便横扫六国，建立起大一统的中央帝国，以人道气运放逐无尽的真以太，驱灭神灵，自封为皇帝，凌驾于诸神之上。紧接着废分封、设郡县、书同文、车同轨、收天下兵锋典籍、立科举、东渡扶桑、西逐匈奴、南平百越、北定罗刹......一系列改革打破了几乎所有的传统格局，奠定了人理之基。\n    然而嬴政本人却仿佛被迷雾环绕一般十分神秘，没有人知道他为何能够完成这样的伟业，也没有人知道他一身学识来源于何处。\n    唯有在他体内的超越时空的寂寞灵魂才知道，一切早就在不知不觉中面目全非了。" ,"A+++","A","A++","EX","EX","EX");
            CharacterDataBase.getInstances(context).insert(27,"徐福","caster","女","170","48","中国、日本","中立·善","    字君房，是秦朝著名方士，道家名人、曾担任秦始皇的御医，出生于战国时期的齐国。相传海中有蓬莱、方丈、瀛洲三座仙山，有神仙居住。于是秦始皇派徐福率领童男童女数千人，以及已经预备的三年粮食、衣履、药品和耕具乘坐蜃楼入海求仙，但从此一去不回。实际上徐福奉秦始皇的命令来到了东瀛列岛，在这神代残余的岛国建立了等同于传说中的星之里侧阿瓦隆的秘境，起名为“幻想乡”，而徐福本人则自号“伊邪那美”，和“伊邪纳岐”踏上了封神之路。后来貌似收留了同乡的狐狸什么的......" ,"C","C","A","EX","A+","EX");
            CharacterDataBase.getInstances(context).insert(28,"荆轲","assassin","女","159","30","中国","混沌・善","    荆轲并不是以暗杀为生业，而是读书与剑术，与贤友一起畅谈，还是个把酒看作比什么都重要的潇洒之人。她接受了燕国太子丹委派的刺杀秦始皇的任务后，马上开始练习刺杀谨慎的皇帝的演练计划。然而最终结果确完完全全的失败了。相传荆轲在暗杀失败后被处死，实际上却感动于嬴政的气量与志向，作为赎罪成为了他的影子。在暗杀一道上荆轲无人能及，是冠位的有人选之一。","C","C","A++","C","B","EX");
            CharacterDataBase.getInstances(context).insert(29,"白起","avenger","女","175","53","中国","秩序·恶","    白起，又称公孙起，战国时期秦国郿县人，曾在伊阕之战大破魏韩联军，攻陷楚国国都郢城，长平之战重创赵国主力，功勋赫赫，是杰出的军事家、统帅。怪物般理性的思考分析，详细周密的部署作战计划，战斗时毫不留情，坚持彻底消灭的原则，反映出其恐怖之处。“人屠”的称号当之无愧。\n    冷艳而强气的女子，对于帝王的命令会一丝不苟的完成，即使怨灵缠身亦尤未悔。这一切除了源于绝对的忠诚意外，可能还包含着她对帝王的那一丝连自己都没有察觉到的特殊情感吧。","A","B","A","C","C","EX");
            CharacterDataBase.getInstances(context).insert(30,"李斯","ruler","女","172","50","中国","秩序·中立","    李氏，名斯，字通古。战国末期楚国上蔡人 。秦代著名的政治家、文学家和书法家。早年为郡小吏，后从荀子学帝王之术，学成入秦。初仕于吕不韦。后劝说秦王政灭诸侯、成帝业，被任为长史。在秦王政灭六国的事业中起了较大作用。秦统一天下后被任为丞相。\n    严肃古板，一丝不苟的大姐姐，绝对的认真负责，将对于秩序的制定和遵从放在第一位，身为ruler，与其说是秩序的维护者还不如说是秩序的建立者。嬴政的全能大管家，但有时候也会因为太过认真而被嬴政吐槽————实际上内心深处的李斯还有着腹黑的另一面。\n    面对敌人狠辣绝不手软，在维持秩序的同时也赞同弱肉强食的自然法则，但李斯毕生的目标是却是用绝对的秩序打破这样的自然法则。对李斯来说，人生路上唯有嬴政一人才是真正的家人和同党，其余挡在她路上的皆是敌人。","D","D","D","A+++","B","EX");
            CharacterDataBase.getInstances(context).insert(31,"吉尔伽美什","archer","女","173","53","巴比伦、乌鲁克","混沌・善","    公元以前统治着苏美尔的都市国家乌鲁克的半神半人的王者。不仅仅是传说而是真实存在的人物，记述于人类最古的叙事诗《吉尔伽美什叙事诗》中的王。\n    性格刻薄无情。从不听从他人的意见，只把自己的基准作为绝对准则的暴君。炫耀着华美无比的黄金铠甲、将无穷尽的财宝像泼水一样释放出去的破格的英灵。第一人称写作“我”读作“本王”。\n    “收集了人间所有宝物”是吉尔伽美什的口头禅，不过这并不是单纯的比喻。吉尔伽美什将他的时代里产生的，所有技术的雏形收集起来，收归己有。与其说里面是吉尔伽美什贮藏下来的财宝，不如说是“人类智慧的原典”其本身。","B","B","B","A","A","EX");
            CharacterDataBase.getInstances(context).insert(32,"玛塔·哈里","assassin","女","165","49","法国~德国","混沌・中庸","    世界的黑幕中来去自如的女间谍。玛塔・哈里恐怕是间谍中最为奇异的存在了。最初只是个脱衣舞娘的她，在作为间谍被行刑之前，可是藉着自己的身体把整个军队的将校玩弄于鼓掌之中的。\n    想来玛塔・哈里在人生开始的地方，她完全无能为力的时候就已经挫折不断。父亲经营的公司破产，不断重复外遇。母亲因为心劳病倒，在玛塔・哈里只有十四岁的时候去世了。\n    结婚生活也因为丈夫的暴力，嗜酒，外遇癖失败了，对于青春时代的大半都因为男人们自私的欲望浪费掉的她来说，玩弄男性的间谍恐怕与她真实的性格更为合拍——即使是在等待最后处刑的时刻。","E","E","E","E","D","A+");
            CharacterDataBase.getInstances(context).insert(33,"卡米拉","assassin","女","168","49","匈牙利","混沌・恶","    因为，谁都没有这样说过！谁都没有说过这样是错误的！所以，我才会沦落到这个结果！啊啊，我的真名是——伊丽莎白・巴托里！\n    伊丽莎白・巴托里完全成长为怪物的姿态。司管伊丽莎白黑暗面的存在。并不具有昔日伊丽莎白的可爱，仅仅以“卡米拉”这一化名表现出她残忍追求鲜血的一生。\n    成为了卡米拉的她，脾气和伊丽莎白完全不合，彼此处于互相残杀的关系。这是因为年轻的伊丽莎白拒绝成为卡米拉，伊丽莎白对卡米拉而言也是安于无知讴歌青春的无可原谅的象征。\n    对圣杯的祈愿大概是祈求永恒的青春吧。那个时候，她说不定才能取回真正沉着的治政者的姿态。……在那过程中的牺牲者，大概会全部被无视掉吧。","D","D","A","C","D","B");
            CharacterDataBase.getInstances(context).insert(34,"清姬","berserker","女","158","41","日本","混沌・恶","    爱着，喜欢着，爱着，那么喜欢着，被背叛了，伤心，伤心，伤心伤心伤心，恨啊恨啊恨啊恨啊恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨恨——所以就烧死杀掉了。\n    在《清姬传说》中登场。对前往熊野参拜途中前来求宿一夜的美貌的僧侣安珍一见钟情。但是，在夜深时来访安珍下榻处的清姬，却被无情地拒绝了。即便如此，安珍也与她作出了“去熊野参拜归来时再会”的约定。然而——害怕着清姬的安珍打破了约定，没有与清姬再见便逃走了。察觉到此事的清姬因被背叛了而绝望、悲叹、愤怒，化为龙而开始了追踪，追上躲藏在前方寺内大钟里的安珍并把他烧死了。\n    并没有她混有龙族之血的记录，有的只是对苦苦爱恋着的人永无止境的虚妄执念。……可以说那就是仅凭着“深深的思念”便化身为龙的她执念的具现。有着坚信着Master是安珍转世的情结，作为从者使唤时要格外小心。在她已经提醒过“希望不要说谎”后仍然说了谎的情况下，甚至可能需要花费令咒来使她平静下来。除此以外是个气质端庄又擅长料理的贤良妻子。","D","D","B","E","A+","EX");
            CharacterDataBase.getInstances(context).insert(35,"玉藻前","caster","女","162","49","日本","中立・恶","    是传说在平安时代末期、鸟羽上皇院政期间出现由白面金毛九尾狐变化而成的绝世美女，由于其才识广博而又绝世美艳，被人称为天下第一美女以及日本第一才女。\n    玉藻前诞生在中国，本来是守护轩辕坟墓的神灵，其真面目是地脉（龙）的阴性姿态，懂得人化之术，是从遥远的过去一直存在至今的Caster的根源。纪元前十一世纪时，化身为绝色美女妲己，当上了当时商纣王子辛的宠妃。不久之后商便被西边新兴的周政权推翻。妖狐也跑到印度去，化身为摩竭佗国斑足太子的王妃华阳天，之后又回到中国，暂时过着隐姓埋名的生活。唐朝时，日本派遣使者吉备真备到中国来，妖狐便溜进了吉备真备的船里到日本来了。在日本受到了同为老乡的旧友“徐福”的热情接待，并给予了玉藻前神位，就这么在日本安定了下来。之后的历史中玉藻前收获了“天照大御神”的称号。\n    平安时期，由于神代的残余在日本也渐渐的要消失了，玉藻前也随着徐福回到高天原，仅留下一条尾巴的分身在人间巡视————最终结局可想而知，被阴谋家以“九尾妖狐祸乱宫闱”的名义退治了。\n    朋友出乎意料的多，徐福、天宇受卖命、辉夜姬、清姬、刑部姬、剪舌麻雀均是其好友。虽然是至少毁灭了五个王朝的人间祸水，内心深处却也有着渴望成为好妻子这样的愿望，在这方面对于徐福的君上相当感兴趣。","B+","C","A","A","EX","EX");
            CharacterDataBase.getInstances(context).insert(36,"贞德·达尔克","ruler","女","159","44","法国","秩序·善","    主呀，委以此身————\n    世界上最有名的圣女。从17岁时从故乡发迹至19岁时被处以火刑，仅仅用这两年时间就名垂青史。拯救了法国的圣女，在成功地完成了堪称为奇迹的快速反攻后，因被诬陷迎来了悲剧般的结局。\n    贞德在被抓捕之后仍不断地创造奇迹。据传这位除了《圣经》上的几句祈祷外什么都不知道的农家女，也毫不退让地与一流的神学家进行了随机应变的辩论，因此把她作为异端者的处刑也一度变得十分困难。\n    还有这样的传说——“像贞德这样的魔女的话，我是很乐意给她点火的，”如此扬言的士兵在她被烧死之后，看到了飞去的白鸽，才意识到自己杀了真正的圣女并为此感到深深的后悔。\n    只要是为人正直的master…不、就算不是正直的master，贞德也绝不会抛弃他，而是为他奋斗。但是意外的有着斯巴达式的思考方式，所以master会受到她严厉的教育吧！","B","B","A","A","C","A++");
            CharacterDataBase.getInstances(context).insert(37,"贞德·达尔克(Alter)","avenger","女","159","44","法国","混沌・恶","    ———倘若神存在的话，\n    想必会对我降下天罚吧———\n    虽然被称呼为Alter，但并不能说她是贞德的另一面。而是叹惋贞德之死的法军元帅，吉尔・德・雷利用圣杯虚构出的，复仇的贞德。作为与原本的贞德完全相反的英灵，以Avenger职阶现界。\n    原本的贞德并不是英雄而是圣女，因此绝无“以另一面召唤”的可能性。这位黑色圣女是其根本性部分将吉尔・德・雷的愤怒……偏见以及希望会如此的愿望……混入其中，从而造就出的原本不该出现的“另一面”。\n    向法国复仇的龙之魔女。法国贵族）旁若无人地夸耀着所谓的正义，人们却对此深信不疑——被对人们的愤怒所驱使的圣女才是，吉尔・德・雷所盼望的她的姿态。\n    各种各样的事情堆叠在一起，使本是架空存在的她作为黑色圣女响应召唤成为了可能。对待Master通常是一副尖酸刻薄的态度，但因为她的基础——圣女贞德相当忠厚的缘故，还是能感觉到她内心对Master的敬爱的。没有少女的爱好，不过好像有少女的愿望。“深层意识中还是想要被自己中意的美男子们包围，在这个枯燥的复仇生涯里！”同为Avenger职阶的一位Servant如此评价道。\n","A","C","A","A+","E","A+");
            CharacterDataBase.getInstances(context).insert(38,"阿尔忒弥斯","archer","女","165","44","希腊","混沌・中庸","    又名辛西娅，宙斯和勒托之女，阿波罗的孪生姐姐，是希腊神话中的狩猎女神，为奥林匹斯十二主神之一，经常穿戴束腰的短裙和猎靴，拿着弓箭，身边伴随着鹿或者猎犬。经常被描绘成美丽、青春的少女。她是野兽的女主人、荒野的女领主、喜欢和保护不嫁的处女们，是三大处女神之一。她自由独立，热爱户外生活，反对男女婚姻。\n    阿尔忒弥斯外表看上去相当的冷淡，然而却讨厌“隐忍”“忍耐”这样的话。性格单纯爽朗但还是个神，因此几乎没有对人命的尊重。对于所有的追求者都不屑一顾，但实际上反而对于对她毫不客气的家伙青眼有加(说的就是你吧，嬴政)，甚至到了花痴的地步。是赶时髦的甜品系，无论做什么事都会用全力——特别是追求爱情更是会一心一意地使出全力。\n    害怕的事情有两件：被爱人讨厌还有阿尔蒂拉。","B","B","A+++","EX","A+","EX");

        }
    }
    
    static void insertSkill(Context context){
        if (SkillDataBase.getInstances(context).query().getCount() == 0){
            SkillDataBase.getInstances(context).insert("赵云(子龙)","职阶技能", "对魔力", "B", " 较高的对魔力，可以毫不困难地无效化三节以下的魔术，即使是大魔术、仪礼咒法也难以给予其伤害。");
            SkillDataBase.getInstances(context).insert("赵云(子龙)","职阶技能", "骑乘", "B", "  由于“骑士”本来就是擅长马上战斗的军人，所以骑乘等级非常高。");
            SkillDataBase.getInstances(context).insert("赵云(子龙)","固有技能", "千里护主之骑", "A+", " 当自身存在于Master远处，Master遇到危险时，可以不消耗令咒的力量将其呼唤到其主身边。同时，在通过这个技能召唤出现之时，赵云的全属性在一定时间内会上升一个等级。");
            SkillDataBase.getInstances(context).insert("赵云(子龙)","固有技能", "千军之将七进七出", "EX", "   此技能为赵云最有名的事迹‘长坂坡之战’的具现。赵云的运气属性会根据敌人的数量成正比例提升。若对拥有此技能的赵云，使用人海战术，无疑是找死般的行为。");
            SkillDataBase.getInstances(context).insert("赵云(子龙)","固有技能", "心眼（真）", "A", "   在修行与锻炼中得到的洞察力和战斗理论。纵然是绝境，都可以冷静走出扭转形势的一步。");
            SkillDataBase.getInstances(context).insert("赵云(子龙)","固有技能", "龙胆", "A", "  无效化精神干涉的能力。并且有使格斗伤害上升的效果。");
            SkillDataBase.getInstances(context).insert("赵云(子龙)","固有技能", "无穷之武练", "A+++", "    在过去某个时代的盖世无双的武艺.由于将心、技、体完全融合为一,不管在何种精神制约下都能将自身的战斗能力完美发挥。");
            SkillDataBase.getInstances(context).insert("赵云(子龙)","宝具", "涯角枪", "A+", "  枪身乃混铁精钢打造而成，带盘龙雕文，坚固而带韧性，枪头乃白金铸就，寒光凛凛，锋锐无比，上书“天涯海角无对”。为常胜将军赵云的佩枪，只有其本人才能发挥出此枪的潜在威力。\n    藉由将所有者的灵气变换成焰，再从往下挥的枪的前端如大爆炸一般地放出来破坏万物。");
            SkillDataBase.getInstances(context).insert("赵云(子龙)","宝具", "青釭剑", "A", "   三国时代的霸主之一曹操所铸造的神兵，故有“云乃拔青虹剑乱砍，手起处，衣甲平过，血如涌泉”的描述，被赵云所得，助其在战场上大放异彩。\n    拥有“破甲”的效果，能够对防具，结界等造成大幅度的损伤。");
            SkillDataBase.getInstances(context).insert("赵云(子龙)","宝具", "枪技·百鸟朝凤", "A+++", "    是赵云的老师——枪法宗师童渊所创的一种枪法，幻化出百鸟之影，最终身化凤凰，百虚而一实的致命一击。无法被格挡或者闪避。");
            SkillDataBase.getInstances(context).insert("孙尚香","职阶技能", "对魔力", "C", "    能将咏唱少于两节的魔术无效化，但无法防御大魔术、仪式咒法等大规模魔术。");
            SkillDataBase.getInstances(context).insert("孙尚香","职阶技能", "单独行动", "B", "   失去master后，可以2日间持续一直现界。不过这是避免战斗和使用宝具等所带来的消耗、尽可能保存魔力的情况下的理想值。");
            SkillDataBase.getInstances(context).insert("孙尚香","固有技能", "枭姬", "B", " 孙尚香有着与传统女性截然不同的桀骜不驯的个性，刚强勇猛，技艺过人，在战斗时能够激发出更进一步的力量和技巧，同时能大幅强化孙尚香的视力和命中力。");
            SkillDataBase.getInstances(context).insert("孙尚香","固有技能", "美的显现", "A", "  名传世间的绝世美人，拥有无匹的魅力，能轻易获得异性乃至同性的好感。");
            SkillDataBase.getInstances(context).insert("孙尚香","固有技能", "猛虎", "C", " 孙尚香流淌着江东孙氏的猛虎之血，在战斗中容易进入狂战状态，以失去理智为代价获得更高的出力，同时能够放出火焰属性的魔力。");
            SkillDataBase.getInstances(context).insert("孙尚香","固有技能", "兵圣传人", "D", " 孙尚香来自江东孙氏，乃是兵圣孙武之后，虽然本身不太擅长指挥,但是天赋的血脉还是赋予了他一定的统御力。");
            SkillDataBase.getInstances(context).insert("孙尚香","宝具", "红莲弓", "B", "  缠绕着火焰的弓，能释放出火属性的箭矢，当真名解放后便如同炮台一般，能够射出如同导弹一般威力的攻击。");
            SkillDataBase.getInstances(context).insert("孙尚香","宝具", "天命的结合", "A++", "  作为两国友好合作的象征，孙尚香作为联姻的对象远嫁蜀汉。\n   该宝具发动后能够大幅的强化目标和我方的各能力值，并且完全恢复损伤。不过孙尚香本人似乎非常不满这样的命运。");
            SkillDataBase.getInstances(context).insert("黄月英","职阶技能", "阵地作成", "B", "   作为魔术师，造出对自己有利的阵地。B等级只能够作出“工房”而不是“神殿”");
            SkillDataBase.getInstances(context).insert("黄月英","职阶技能", "道具作成", "EX", "  制作带有魔力的器具。被称为“工神”的她能够制作出超越时代的魔术造物和机关傀儡");
            SkillDataBase.getInstances(context).insert("黄月英","固有技能", "天赋的奇才", "EX", " 黄月英是绝世奇才，任何知识、技巧和魔术都能轻易的习得，即使是现代科学的技术也轻易完全掌握了的程度，英雄个人技能以及肉体上的负荷以外的技能都能发挥出A级甚至以上的熟练度。");
            SkillDataBase.getInstances(context).insert("黄月英","固有技能", "奇门遁甲", "A", "   熟读兵书，上知天文，下知地理，文韬武略，足智多谋，尤其擅长玄门数算，奇门遁甲之术，能够有限的计算未来，同时在风水构建，阵地作成方面也无可匹及。");
            SkillDataBase.getInstances(context).insert("黄月英","宝具", "工神的无限机巧秘库", "EX", "   储藏着黄月英无数作品的宝库，拥有包括“连弩”、“木牛流马”、“机巧傀儡”等各种各样超越时代的黑科技发明——然而在黄月英眼里这些大概都是失败品吧。\n  为了追求超越人类的造物黄月英仍然在努力中，正因如此，这座名为宝库实为垃圾堆的仓库库存依旧在不断的增加。");
            SkillDataBase.getInstances(context).insert("黄月英","宝具", "石兵八阵", "B", " 侵入这巨石构成的大阵之人会被就此迷惑，并被迫入死亡。原本是某位军师的宝具，实际上是由黄月英的父亲所教——作为女儿的黄月英实际上也掌握着这样的技巧，但是看起来这大概只是她无聊时候的顺手之作吧。");
            SkillDataBase.getInstances(context).insert("黄月英","宝具", "生命创造·神性机巧", "EX", "   名为“夜夜”的神性机巧傀儡，黄月英所追求的最终造物，拥有超越人类达到物质化的完美灵魂和强大的机巧躯体，虽然只是个半成品，但二者合一还是产生了神明般的力量。\n   她是黄月英以人类之身超越神明而抵达根源的奇迹——从无到有而的创造的机巧生命体。\n    这是与人类别无二致的机巧傀儡，诞生于一次实验意外，虽然事后黄月英多次重复同样的实验，但是仍然无法再次创造生命了。");
            SkillDataBase.getInstances(context).insert("蔡琰(文姬)","职阶技能", "阵地作成", "B", "    作为魔术师，造出对自己有利的阵地。B等级只能够作出“工房”而不是“神殿”");
            SkillDataBase.getInstances(context).insert("蔡琰(文姬)","职阶技能", "道具作成", "B", "    以魔术来创造出各种道具的能力。虽然不懂魔术，但无比的才气应用宝具而写成的诗词文章，也能够进行制作。");
            SkillDataBase.getInstances(context).insert("蔡琰(文姬)","固有技能", "艺术审美", "A", "    蔡琰博览群书，对艺术作品、文学作品拥有无比的执着心。目睹在艺术界与文学界有着相关传说的宝具时，可以看破其真名。");
            SkillDataBase.getInstances(context).insert("蔡琰(文姬)","固有技能", "过目不忘", "A", "    “博闻强识，不辱才女之名。”，蔡琰拥有过目不忘的才能，只要看过一遍的东西就能完全的记忆并且复刻下来——无论是怎样的魔术，或者A级以下的技能，只要目睹，即使不知道原理也可以完美的复制并且使用。");
            SkillDataBase.getInstances(context).insert("蔡琰(文姬)","固有技能", "音乐神的加护", "EX", "能听到并理解所有的声音，使天才般的演奏成为可能，更甚的是，可以将音乐魔术的行使加强补正，这些效果可以作为“自身之力”被发挥出来。");
            SkillDataBase.getInstances(context).insert("蔡琰(文姬)","宝具", "一曲悲歌愁断肠", "A+", "  感念自身以及天下万民悲惨的命运所作的一曲，名为《胡笳十八拍》的旷世杰作——使得听闻之人感受到命运的残酷与无情，永远的徘徊在苦难之中直至死亡,是能够撬动命运因果之弦的乐曲。");
            SkillDataBase.getInstances(context).insert("蔡琰(文姬)","宝具", "焦尾琴", "C", "   父亲留给蔡琰的名琴，能够奏出超出演奏者水平的声音，用于行使音乐魔术时使魔术等级增加一级。");
            SkillDataBase.getInstances(context).insert("貂蝉","职阶技能", "屏蔽气息", "B", "    断绝作为Servant的气息。适合于隐密行动。当自己转移至攻击姿态时，屏蔽气息的等级会大幅下降。");
            SkillDataBase.getInstances(context).insert("貂蝉","固有技能", "连环之谋", "B", "    如何将对象暗杀的战术思考。与军略不同，只能应用在少数的暗杀计。使用该技能能够推演未来的方式布置计划，只有足够高等级的幸运才能对抗该技能。");
            SkillDataBase.getInstances(context).insert("貂蝉","固有技能", "魅惑的容颜", "EX", "  拥有足以闭月的美貌，这份美貌在“美人计”的传说中被升华为超越神魔的魅惑力——只要是异性，无论怎样的请求都能够答应这样的等级，但对于貂蝉本人来说同样是一份枷锁吧，拥有如此美貌的她要怎样才能找到真正爱着她的人呢？");
            SkillDataBase.getInstances(context).insert("貂蝉","固有技能", "离间", "C", "  实际上是超出常规的精神暗示与干扰的技巧，不知不觉间干扰对方的思维使其互相之间产生强烈的敌意，配合貂蝉倾世的舞技甚至能让整个军队自相残杀。");
            SkillDataBase.getInstances(context).insert("貂蝉","固有技能", "舞之真意", "A", "    虽然也擅长音乐，但是舞蹈才是貂蝉真正的传世之技。华丽的舞姿甚至能够沟通天地，相当于仪式一般的产生大型魔术的效果。");
            SkillDataBase.getInstances(context).insert("貂蝉","宝具", "一舞倾城·再舞倾国", "A++", "   终极的舞技与魅力的结合，貂蝉舞的最终奥义。动人的舞姿之下整个城市的人都会头脑麻痹，成为被貂蝉的傀儡，就连精神耐受不足的从者也无法抵御。实际上，这段舞蹈的第二段从未被展现过。");
            SkillDataBase.getInstances(context).insert("甄宓","职阶技能", "阵地作成", "EX", "   本身并不能制作阵地，但是只要有水的地方就是她的主场，拥有相当于“神殿”的效果，而处于洛水之中时的她几乎无所不能。");
            SkillDataBase.getInstances(context).insert("甄宓","职阶技能", "道具作成", "B", "    以魔术来创造出各种道具的能力。虽然魔术能力不足，但是借由水可以完成各种不可思议的魔术造物");
            SkillDataBase.getInstances(context).insert("甄宓","固有技能", "美的显现", "A++", "  “翩若惊鸿，婉若游龙。荣曜秋菊，华茂春松。”曹植是这么描述她的美丽的。拥有卓绝的魅力，吸引他人的能力。虽然足以与貂蝉媲美，但是由于并没有美色祸乱世间的传说，所以并没有超越人与神的范畴。");
            SkillDataBase.getInstances(context).insert("甄宓","固有技能", "女神的神核", "EX", "  作为与生俱来就是完成型的女神代表性的技能。是包含了神性的复合技能。维持着肉体和精神的绝对性。不会受到精神干涉，肉体也不会成长变化。");
            SkillDataBase.getInstances(context).insert("甄宓","固有技能", "洛水之神", "EX", "   是掌控水与冰的绝对力量，只要是液体就能够随意操控的魔法级别的权能。");
            SkillDataBase.getInstances(context).insert("甄宓","宝具", "河图洛书", "EX", " 是五行八卦数术的起源，也是能够操控风水，预知未来的终极宝具，因为产生于洛水的传说而成为了甄宓的宝具。");
            SkillDataBase.getInstances(context).insert("甄宓","宝具", "洛神赋", "A", "   相传是曹植为赞颂宓妃而写下的千古奇文，实际上是洛神的魔术原典：\n  翩若惊鸿，婉若游龙：洛神的神之武艺，惊鸿游龙般的剑法。\n   荣耀秋菊，华茂春松：御使生之力的技巧，操纵植物的魔术。\n   轻云蔽月，流风回雪：操纵大气的魔术，不同于奇门遁甲依靠改变风水来操纵大气，而是靠着操纵水的能力影响大气。\n  芳泽无加，铅华弗御：常驻的加护魔术，C级以下的攻击和诅咒无法对甄宓产生效果。\n    凌波微步，罗袜生尘：内按九宫八卦，十分飘逸的步法，使用后敏捷力大幅提升，同时难以被命中。\n   ......");
            SkillDataBase.getInstances(context).insert("甄宓","宝具", "洛水清波，沐浴人心", "EX", "    固有结界，借由洛神的权能召唤而来的洛河的具象化。由于哺育了中华文明的缘故，洛河拥有远超一般河流的幻想的力量，立于洛水之上的洛神无可匹敌。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","职阶技能", "对魔力", "C", "    无效化以二工程以下咏唱引起的魔术。不能防御大魔术、礼仪咒法等，大规模的魔术。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","职阶技能", "骑乘", "B", "    能够灵活驾驭较为优秀的坐骑和交通工具，但不能驾驭神兽、圣兽及龙。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","固有技能", "领导力", "A", "    指挥军团的天生才能，A级的领导力足以建立世界级的大帝国，但是由于多为英杰的阻拦，曹操的这个野望最终还是未能成功。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","固有技能", "军略", "A", "  多数人参加的战斗中的战术上的直感力。使用对军宝具，应对对手的对军宝具时获得正，曹操高超军事才能的体现。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","固有技能", "皇帝特权", "A", "    本来不能持有的技能，也可以因为本人的主张而能在短时间内获得。符合的技能是骑乘、剑术、艺术、统率力、谋略等。等级是A以上的情况下，连肉体层面的负荷（神性等）也能获得。虽然生前并没有称帝，但是千古威名和魏武帝的称呼还是令他拥有了这个技能。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","固有技能", "鉴识眼", "A", " 对于观察对象的人类将来会获得何种形式的可用性这一点，有着十分卓 越的眼力，曹操唯才是举政策的保证。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","宝具", "短歌行", "B", "   曹操在文学方面也有着无上的才能，《短歌行》就是他才华的终极体现。能够增加我方的士气与能力数值。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","宝具", "倚天剑", "A", "   三国时代的霸主之一曹操所铸造的两把神兵之一，拥有“破甲”的效果，能够对防具，结界等造成大幅度的损伤。另一把交付给了夏侯恩，最后被赵云所夺取。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","宝具", "绝影", "B", "    曹操生前所乘坐的名马，曾多次带着曹操逃离险情，影子都跟不上的绝世好马。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","宝具", "孟德新书", "C", "  曹操所作的兵书，能够使使军略一类的技能增加一个等级。");
            SkillDataBase.getInstances(context).insert("曹操(孟德)","宝具", "铜雀台", "EX", "  固有结界，是曹操与麾下文武共同构筑的时代神话。能够暂时召唤出曹操麾下的奇谋良将，其中不乏“郭嘉”、“典韦”等强大的从者存在。");
            SkillDataBase.getInstances(context).insert("吕布(奉先)","职阶技能", "狂化", "A", "  让参数等级提升，但夺去大部份理性。由于被强行与Master的战斗意识进行连结，所以变成了较机械性的Servant。");
            SkillDataBase.getInstances(context).insert("吕布(奉先)","固有技能", "无穷之武练", "A+++", "    在过去某个时代的盖世无双的武艺.由于将心、技、体完全融合为一,不管在何种精神制约下都能将自身的战斗能力完美发挥。");
            SkillDataBase.getInstances(context).insert("吕布(奉先)","固有技能", "反骨之相", "B", "    不会逗留在同一个地方，也不会拥戴同一个君主的天性。不适合亲自当君主，亦无法找到自己君主的流浪之星。将相同等级的「领导力」无效化。");
            SkillDataBase.getInstances(context).insert("吕布(奉先)","固有技能", "鬼神", "A++", "    鬼神般的怪力，使自身的筋力提高。效力几近顶级，其力量和巨人已是别无二致。");
            SkillDataBase.getInstances(context).insert("吕布(奉先)","宝具", "赤兔", "B", "    “人中吕布，马中赤兔”，赤兔乃是马中之王，拥有无匹的速度和力量，与吕布心意相通，二者加在一起时战力倍增。");
            SkillDataBase.getInstances(context).insert("吕布(奉先)","宝具", "军神五兵", "A", "  作为吕布奉先的主武器而广为人知的双手武器方天画戟的真名。能够变形成六个形态的多重兵器。就像是吕布一个人持有六名Servant的宝具一样。\n  “斩切”将所有物理防御无效化或者切断破坏的大伤害攻击。\n   “突刺”藉由枪的贯穿来封锁行动，并将纵列的敌人贯通的大伤害攻击。\n “打击”化为巨大的护臂提升防御力，或是承受住对手的攻击并且返还的特殊防御。\n    “刈割”横扫一横排敌人的大伤害攻击。\n   “挥扫”弹开物理系攻击的同时给予伤害的特殊反击。\n “射击”大口径波动炮一样的光束。");
            SkillDataBase.getInstances(context).insert("诸葛亮(孔明)","职阶技能", "阵地作成", "A", "    以魔术师的身份，创造出对自己有利的阵地。能做成远在「工房」之上的「石兵八阵」。");
            SkillDataBase.getInstances(context).insert("诸葛亮(孔明)","职阶技能", "道具作成", "B", "    能制作诸葛孔明生前所有的、如连弩等众多效果多样的武具和道具。然而实际上多是黄月英所发明的造物。");
            SkillDataBase.getInstances(context).insert("诸葛亮(孔明)","固有技能", "军师的忠言", "A+", "    军师系Servant的技能。能对战况进行分析，并给予对我方形势有用的建议。等级越高准确性越高。等级A+的情况下可以把意外事态在内、进行100%预测。若要对抗此技能，需要拥有非常强大的幸运。");
            SkillDataBase.getInstances(context).insert("诸葛亮(孔明)","固有技能", "军师的指挥", "A+", "    军师系Servant的技能，把包括自己在内的兵士最大力量发挥出来。等级A+的情况，能让士兵使出逼近“做好了死的觉悟”程度的实力。");
            SkillDataBase.getInstances(context).insert("诸葛亮(孔明)","固有技能", "空城绝技", "C", "    空城计传说的具现，诸葛亮本身力量极度虚弱时幸运会有额外的加成。");
            SkillDataBase.getInstances(context).insert("诸葛亮(孔明)","固有技能", "奇门遁甲", "B", "    黄承彦所教授的玄门数算，奇门遁甲之术，能够有限的推演未来，改变风水，甚至能够逆天改命。");
            SkillDataBase.getInstances(context).insert("诸葛亮(孔明)","宝具", "续命七星灯", "B", "    命不久矣时布下的续命法门，成功后便能逆转死亡的逆天数术，但是对于幸运属性有着苛刻的要求，A级以下就几乎不可能成功，即使是A级的幸运也有着一半的可能失败");
            SkillDataBase.getInstances(context).insert("诸葛亮(孔明)","宝具", "石兵八阵", "B", "    本军的败退不可避免之际布下的阵势。侵入这巨石构成的大阵之人会被就此迷惑，并被迫入死亡。\n    作为宝具则是将对方位处的场所强制改换为石兵八阵的大魔术。只要没有脱离石兵八阵，作为目标的众人每回合受到的追加伤害就会一直累积下去。");
            SkillDataBase.getInstances(context).insert("诸葛亮(孔明)","宝具", "出师表", "EX", "    诸葛孔明在编制讨伐敌国的军队时，为时年尚幼的皇帝留下的奏表。能够大幅度的增加我方的士气与能力数值");
            SkillDataBase.getInstances(context).insert("周瑜(公瑾)","职阶技能", "骑乘", "B", "    能够灵活驾驭较为优秀的坐骑和交通工具，但不能驾驭神兽、圣兽及龙。");
            SkillDataBase.getInstances(context).insert("周瑜(公瑾)","职阶技能", "对魔力", "B", "    较高的对魔力，可以毫不困难地无效化三节以下的魔术，即使是大魔术、仪礼咒法也难以给予其伤害。");
            SkillDataBase.getInstances(context).insert("周瑜(公瑾)","固有技能", "暴风航海者", "A", "    驱使被理解为船的东西的才能。由于也需要作为集团领袖的能力，所以也兼备了军事谋略、统率力效果的特殊技能。");
            SkillDataBase.getInstances(context).insert("周瑜(公瑾)","固有技能", "艺术审美", "C", "    “曲有误，周郎顾”，目睹在艺术界有着相关传说的宝具时，可以看破其真名。");
            SkillDataBase.getInstances(context).insert("周瑜(公瑾)","固有技能", "红颜美少年", "C", "    作为吸引他人的美少年的性质。发动时是对男女都有效果的魅惑魔术，但只要对方有反抗的意思的话效果就会减弱。拥有对魔力技能的话完全回避也是可能的。");
            SkillDataBase.getInstances(context).insert("周瑜(公瑾)","固有技能", "军师的忠言", "A", "    军师系Servant的技能。能对战况进行分析，并给予对我方形势有用的建议。等级越高准确性越高。");
            SkillDataBase.getInstances(context).insert("周瑜(公瑾)","宝具", "楼船之阵", "B", "    周瑜所率领的东吴水师，只要在水上就能够无敌的军队，拥有强大的作战的能力。即使是日常也会召唤出一艘楼船作为座驾。");
            SkillDataBase.getInstances(context).insert("周瑜(公瑾)","宝具", "赤壁之业炎", "EX", "    曾经一口气燃尽七十万大军的红莲业火，是将魏武帝击下神坛的火焰。即使是神明也不敢面对这缭绕着无尽冤魂的大火，面对越多的敌人就越是强大。\n    作为释放的代价，周瑜会进入持续的虚弱状态。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","职阶技能", "对魔力", "A", "    阿尔托利亚拥有能使魔法阵和瞬间契约大魔术无效化的对魔力。即便是当代最高等级的魔术师也不能用魔术直接伤害到Saber。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","职阶技能", "骑乘", "A", "    她是过去常在马上战斗的军人，成为从者后拥有B~A等级的骑驾能力。能娴熟的驾驭各种坐骑，包括了古代的双马战车和现代的陆上交通工具。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","固有技能", "直感", "A", "    “直感”是在战斗中一瞬间判明“对自身最适合行动”的能力。A等级的直感，已进入“预测未来”的领域。能通过风声和直觉预测弹道，回避枪械火器的攻击。对视觉·听觉的妨碍减半。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","固有技能", "魔力放出", "A", "    “魔力放出”是指通过魔力对自己的武器和肉体进行强化。换言之，就是用魔力来Jet喷射，A等级的话，能让原来贫弱无力的少女骑士拥有轻松压过多个强壮男性的力量。Saber战斗时所穿的银色铠甲也是用魔力编织成的。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","固有技能", "领袖气质", "B", "    足以治理一个国家的能力。依靠这个能力，阿尔托利亚可以使自己所率领的军队士气变得高昂。虽然能管理一个王国，但只有B等级的话无法建立世界级的大帝国。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","固有技能", "狩猎巨兽", "B", "    亚瑟王与蹂躏不列颠的诸巨兽作战，并将其悉数击倒。是表示具有丰富的「与巨大敌性生物作战的经验」的技能。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","宝具", "风王结界", "C", "    借着缠绕数层的风，而使光的折射率变化以遮盖剑身的结界。相比于宝具更接近于魔术。透过此结界，可让对方认不清剑招的距离与轨道而进行攻击。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","宝具", "必胜黄金之剑", "B", "    本来是为了选出王者的剑。对人宝具的『对人』所指的不是敌人，而是针对于接下来会持有它的人。当该名持有主是一名正确的王者，或是他完全成长的时候，其威力将会与圣剑之名相乎。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","宝具", "誓约胜利之剑", "EX", "    被当成亚瑟王的象征、最为强大、最为尊贵的圣剑。是在圣剑这一范畴中立于顶点的剑，锻造出它的并不是人类。以人们的想念为原料，在星球内部结晶化，作为“最强之幻想”的究极神造兵装之一。原来是由星之精灵管理着的，经过湖之少女的管理，以魔术师梅林为中介人，交付到了亚瑟王的手中。星之内海所生（炼成）的这把剑，据说在威胁这颗行星的外敌出现时，方可发挥真正的力量。\n将持有者的魔力变换成光，通过收束·加速来增加动量，再如同激光束一般从往下挥的剑的前端发放出来，藉以破坏万物，使得行使神灵等级的魔术成为可能的圣剑。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","宝具", "遥远的理想乡", "EX", "    誓约胜利之剑（Excalibur）的鞘，源于亚瑟王安息的妖精乡阿瓦隆的宝具。持有者会从任何伤势当中痊愈，就连老化的进行也会停止。另外透过解放它的真名，带来最强守护的结界将会展开。连基于魔法的干涉也无效化的这件宝具，其存在本身就等同于“魔法”。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡","宝具", "闪耀于终焉之枪", "A++", "    圣枪。系住星辰的岚之锚。其真实姿态据说是系住世界表皮的塔。在真名解放时等级和种类会发生变化。纵使被十三拘束限制了其本来的力量，也将歌颂星辰之光而闪烁的至远之枪———圣枪伦戈米尼亚德将维系世界表层的「光之柱」为本体。由于和「拯救世界的星之圣剑」具有同等程序的十三拘束存在，处于勉强维持作为宝具身形的状态。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡(Alter)","职阶技能", "对魔力", "B", "    因染上了黑暗而比原来有所降低了。但级数依然高，会无效化B等级以下的魔术.");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡(Alter)","职阶技能", "骑乘", "-", "    在黑化引起的暴走状态里，不可能精妙地操纵缰绳，变得无法先考虑骑行兽或乘坐物的界限再运用。事实上骑乘技能被看作是丧失了。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡(Alter)","固有技能", "直感", "B", "    直感是在战斗中瞬间认清“对自己而言最适合的行动”的能力。在黑化状态下保持理性，需要不断的自我抑制。因为集中于抑制凶暴性，对外界的注意变得疏忽，直感力变迟钝。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡(Alter)","固有技能", "魔力放出", "A", "    让自己的武器和肉体带有魔力来进行强化的能力。体格上贫弱的阿尔托利亚能跟Berserker那般的怪物正面交锋，也是用魔力大幅度强化了身体能力的缘故。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡(Alter)","固有技能", "领袖气质", "E", "    过去作为崇高的王吸引与鼓舞士兵的魅力已经没有。由于以恐怖来率领，统率力上升但士兵的士气极为低。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡(Alter)","固有技能", "狩猎巨兽", "B", "    亚瑟王与蹂躏不列颠的诸巨兽作战，并将其悉数击倒。是表示具有丰富的「与巨大敌性生物作战的经验」的技能。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡(Alter)","宝具", "风王结界", "C", "    借着缠绕数层的风，而使光的折射率变化以遮盖剑身的结界。相比于宝具更接近于魔术。透过此结界，可让对方认不清剑招的距离与轨道而进行攻击。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡(Alter)","宝具", "誓约胜利之剑", "A++", "    阿尔托利亚最大的力量“誓约胜利之剑”即使黑化也健在。可是，其剑身染上了不吉的黑色。就像湖之精灵存在善恶（薇薇安和摩根勒菲）两面，圣剑也有反面。话虽如此，作为圣剑的“格”依然是最高。通过剑身将所有者的魔力变换成光、击出这一性能也没有变化，但其光改变成和刀身同样的漆黑的暗色。");
            SkillDataBase.getInstances(context).insert("阿尔托莉雅·潘德拉贡(Alter)","宝具", "闪耀于终焉之枪", "A++", "    圣枪。系住星辰的岚之锚。其真实姿态据说是系住世界表皮的塔。在真名解放时等级和种类会发生变化。纵使被十三拘束限制了其本来的力量，也将歌颂星辰之光而闪烁的至远之枪———圣枪伦戈米尼亚德将维系世界表层的「光之柱」为本体。由于和「拯救世界的星之圣剑」具有同等程序的十三拘束存在，处于勉强维持作为宝具身形的状态。");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","职阶技能", "对魔力", "C", "    无效化以二工程以下咏唱引起的魔术。不能防御大魔术、礼仪咒法等，大规模的魔术。由于她本身毫无对魔力，所以对魔力低到可以说是Saber职阶不应有。");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","职阶技能", "骑乘", "B", "    能够灵活驾驭较为优秀的坐骑和交通工具，但不能驾驭神兽、圣兽及龙。");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","固有技能", "皇帝特权", "EX", "    本来不能持有的技能，也可以因为本人的主张而能在短时间内获得。符合的技能是骑乘、剑术、艺术、统率力、谋略等。等级是A以上的情况下，连肉体层面的负荷（神性等）也能获得。");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","固有技能", "头痛", "B", "    从生前出生开始就继承的诅咒。由于有着慢性头痛，使用精神系技能的成功率会显著地降低。难得的艺术才能，也因为有这个技能而难以充分发挥。");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","固有技能", "即使迎来落日三度", "A", "    由她临死前经历三次落日一事演变而来的技能。");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","固有技能", "予天繁星,予地百花,予人爱恋", "A+++", "    「不论疾病 余来照料\n    不论健康 余来扶持   \n不论幸福 余来同享     \n在此起誓永远与余相伴！」");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","宝具", "陨铁之鞴[原初之火]", "B", "    Saber所持的深红色大剑。她被召唤成Saber职阶时所带过来的，她为自己亲手打造的武器。在Saber情绪高涨时会带有火焰。剑上刻着regnum caelorum et gehenna（拉丁语：天堂与地狱）的铭文。");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","宝具", "邀至心荡神驰的黄金剧场", "B", "    使用魔力来形成、重现出她生前于罗马兴建的剧场。她将亲自设计的剧场起名为Domus Aurea。据说这个剧场开张后，许多观众在第一次公演途中离去了。为此愤慨的她，在第二次公演时将出入口全部封锁了，直到演出落幕为止，哪怕是一个人都没有出到外面去。\n   她在作为一个皇帝之前，就深信不疑自己是个“匹敌乐神阿波罗的艺术家”与“匹敌太阳神的战车取手”。这是唯有抱持着这种想法的她才能够完成的，与固有结界相似而不相同的大魔术。达成自己愿望的绝对皇帝圈。");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","宝具", "童女讴歌的荣华帝政", "B", "    仅在“邀至心荡神驰的黄金剧场”展开中能够使用的剑技的名字");
            SkillDataBase.getInstances(context).insert("尼禄·克劳狄乌斯","宝具", "星辰驰骋的终幕蔷薇", "B+", "    原本只是单纯的剑技、但是本人强烈主张，如此大手笔、如此华丽、从新娘衣装中散发出的那压倒性的纯洁之力，就算称之为宝具也不过分吧？嗯？");
            SkillDataBase.getInstances(context).insert("阿尔提拉","职阶技能", "对魔力", "B", "    能够将咏唱少于三节的魔术无效化。即使使用大魔术、仪式咒法等方法难以将对其造成伤害。");
            SkillDataBase.getInstances(context).insert("阿尔提拉","职阶技能", "骑乘", "A", "    能自由驾驭除幻兽、神兽级别以上的所有野兽和交通工具。");
            SkillDataBase.getInstances(context).insert("阿尔提拉","职阶技能", "神性", "B", "    神灵适性的有无。阿蒂拉自身并没有与神灵的血缘关系，因蹂躏欧洲世界这个事实而被视作神威，成为了受人畏惧的对象，甚至得来『神之惩罚』、『神之鞭』两个名号。因为这个缘由，作为地上的英灵阿蒂拉持有高等级的神灵适性。");
            SkillDataBase.getInstances(context).insert("阿尔提拉","固有技能", "军略", "B", "    多数人参加的战斗中的战术上的直感力。使用对军宝具，应对对手的对军宝具时获得正。");
            SkillDataBase.getInstances(context).insert("阿尔提拉","固有技能", "天性的肉体", "EX", "    与生俱来，持有作为生物而言完全的肉体。可以暂时使筋力参数等级上升。加之，不论摄取多少卡路里，基本设计（体型）也不会变化");
            SkillDataBase.getInstances(context).insert("阿尔提拉","固有技能", "星之纹章", "EX", "    身体上刻画游星的纹章,某种高等术式所产生的纹——并不是匈人族特有的纹饰，而是阿蒂拉个人所有的不可思议的纹饰。等级越高威力越会增加。借著通过纹饰来消耗魔力，可以使任意的身体部位的能力提升。虽非魔力放出技能般爆发性的增幅，但是魔力消费少性价比高。而且，还是兼备直感技能效果的特殊技能。");
            SkillDataBase.getInstances(context).insert("阿尔提拉","固有技能", "文明侵蚀", "EX", "    英灵阿蒂拉本人无自觉地发动着的技能，手中的东西会向对于现在的自己最好的属性变化，「最好」不是说「优异」的意思、而是指阿蒂拉本人着迷的事物。");
            SkillDataBase.getInstances(context).insert("阿尔提拉","宝具", "军神之剑", "A", "    被欧洲全境所畏惧的“神之惩罚”、“上帝之鞭”所具有的武勇与恐怖，与“得到军神马尔斯之剑”这一逸话结合而成的宝具。宝具“军神之剑”虽然具有长剑的形状，但却不知为何是会让人觉得十分超前的设计。由三色光芒构成的“刀身”，据说能破坏存在于大地之上的“一切存在”。\n    透过施展真名解放，“刀身”会释放出如彩虹般的魔力光，阿蒂拉则如流星般以突进方式对敌方阵营进行广范围的歼灭。");
            SkillDataBase.getInstances(context).insert("阿尔提拉","宝具", "泪之星，军神之剑", "A++", "    这把光剑的真身，其实不过是用来指定攻击位置的某种指针罢了。解放真名的同时会针对阿蒂拉指定的地点从遥远的高空降下巨大的光柱进行广范围歼灭。说穿了就是来自卫星轨道上的镭射攻击。");
            SkillDataBase.getInstances(context).insert("阿塔兰忒","职阶技能", "对魔力", "D", "    将一工程的魔术行使无效化。驱除魔力的护身符程度的对魔力。");
            SkillDataBase.getInstances(context).insert("阿塔兰忒","职阶技能", "单独行动", "A", "   没有Master也能行动。不过使用宝具等需要庞大魔力的场合必须有Master的支援。");
            SkillDataBase.getInstances(context).insert("阿塔兰忒","固有技能", "跨越阿卡迪亚", "B", " 「吾遥远的故乡阿卡迪亚，险峻山岭连绵，吾跳跃于岩间游玩」\n   能够跨越场地上包括敌人在内的所有障碍进行移动。");
            SkillDataBase.getInstances(context).insert("阿塔兰忒","固有技能", "追逐的美学", "C", "  让敌人取得先手，然后自己能在确认敌人的行动后再抢先行动。纵然是在赛跑，她都一定会让对手先跑。");
            SkillDataBase.getInstances(context).insert("阿塔兰忒","固有技能", "金苹果", "C", " 「看吧，此乃命运之果实。此宝物只要轻轻一投，足以烧光那极尽繁华的特洛伊。尽情靠前观看吧」\n    炫耀宝物，吸引敌人靠近。");
            SkillDataBase.getInstances(context).insert("阿塔兰忒","固有技能", "狩猎卡莱敦的野猪", "A", "    阿塔兰特在狩猎卡莱敦的野猪时所展现的高超猎人技巧，等同于“直感”，是在战斗中一瞬间判明“对自身最适合行动”的能力。能通过风声和直觉预测弹道，回避枪械火器的攻击。对视觉·听觉的妨碍减半。");
            SkillDataBase.getInstances(context).insert("阿塔兰忒","宝具", "天穹之弓", "B", "  守护神阿耳忒弥斯所赐予的「天穹之弓」,领受过女神阿尔忒弥斯的祝福。藉向阿尔忒弥斯和她的弟弟阿波罗献上的祈祷，能以此发动强力的对军宝具“诉状的箭书”。");
            SkillDataBase.getInstances(context).insert("阿塔兰忒","宝具", "诉求的箭书", "B", "  「引弓放箭」这一概念具现化而成的宝具。射出祈求太阳神阿波罗与月女神阿尔忒弥斯加护的箭书。以给与敌方灾厄的形式授予Archer加护，天上降落豪雨一般的光箭，进行广泛围全体攻击。箭书会随机由阿耳忒弥斯和阿波罗的其中一方收到。由阿耳忒弥斯收到的话，在场的所有女性会变成目标，由阿波罗收到的话便是男性被瞄准。");
            SkillDataBase.getInstances(context).insert("阿塔兰忒","宝具", "神罚之野猪", "B", "  据说是被阿塔兰忒射杀的卡吕冬魔兽，藉将其外皮包裹身躯而获得魔兽之力的诅咒宝具。乍看之下像猪，但那只是偶然以猪作为依附生物罢了。\n    披在身上时封印天穹之弓，幸运外的全能力上升，并得到A级「狂化」和「变化」，给予敌人伤害能够恢复自己等量的生命力。但精神会被野猪控制，无法认知Master。由于已不再是Servant，也无法被观测情报。此状态下的弓名字改为「闇天之弓」，以魔力生成的箭不但可以迅速连发还全都具备宝具级威力。");
            SkillDataBase.getInstances(context).insert("美杜莎","职阶技能", "骑乘", "A+", "  美杜莎有着高等级的骑乘能力。而且该能力并非只能对特定的兽或乘坐物发挥，而是万能到几乎全部的兽，以至幻兽、神兽类都自由地驾御的程度。不过，连拥有极为优秀的骑乘能力的美杜莎，也被认为唯有龙种不能驾御。");
            SkillDataBase.getInstances(context).insert("美杜莎","职阶技能", "对魔力", "B", " 等级B的对魔力可以毫不困难地无效化三节以下的魔术。若更进一步地说，即使是大魔术、仪礼咒法，也难以给予美杜莎伤害。");
            SkillDataBase.getInstances(context).insert("美杜莎","固有技能", "魔眼", "A++", "   拥有最高级别的魔眼「库柏勒」。但是，平常处于封印状态中。被美杜莎的魔眼捕捉到者，对魔力（游戏为“魔力”）在C级以下时就会无条件石化。B级者则须受到豁免检定来判定是否被石化。虽然无法石化A级者，但会带给对方“重压”的效果，使全能力下降一个等级。");
            SkillDataBase.getInstances(context).insert("美杜莎","固有技能", "单独行动", "C", "    即使主人的魔力供给中断，也有暂时自力行动的能力。等级C，在失去Master(或是契约被废除)的状态下，美杜莎可以没有魔力供给持续现界1天左右。另外，因为美杜莎可以通过吸血来得到魔力，因此也可以视状况袭击人类，持续现界更加久。");
            SkillDataBase.getInstances(context).insert("美杜莎","固有技能", "怪力", "A+", "   虽为英灵却兼具怪物的特性，只有美杜莎才拥有的技能。使用的话能够短暂地提高筋力。对并不拥有适合接近战的宝具的美杜莎来说是不可或缺的能力，例如在拉起刺进了带锁链的短剑的对手时使用，其应用范围很广。接近战中发挥很高的战斗能力。");
            SkillDataBase.getInstances(context).insert("美杜莎","固有技能", "神性", "E", "   就像希腊神话所说的那样，美杜莎原本是美丽的女神。为此本来拥有非常高的神性。然而，因为她后来转变为怪物，所以也是个拥有通常英灵不能拥有的相反特性“怪物”的珍稀存在。");
            SkillDataBase.getInstances(context).insert("美杜莎","固有技能", "魅惑的美声", "B", "   与姐姐们所持的固有技能一样。对男性会有魅惑的魔术效果、但对魔力技能会使其回避可能。即使没有对魔力、只要有抵抗的意思也可以减轻效果。");
            SkillDataBase.getInstances(context).insert("美杜莎","固有技能", "变转之魔", "B", "   代表着英雄或者神灵在生前曾转变为魔物。通过强调过去曾存在的事实而大幅强化身为从者的能力的技能。戈耳工有着以人类之身绝对不可能拥有的筋力和耐久力等级。");
            SkillDataBase.getInstances(context).insert("美杜莎","固有技能", "恐怖的咆哮", "A++", "   能使生物本能地感受到恐惧的咆哮。使敌方全体恐惧、持续降低防御力、短时间内防御力大幅下降、并给予诅咒等状态。");
            SkillDataBase.getInstances(context).insert("美杜莎","宝具", "骑英之缰绳", "A+", "  美杜莎拥有的最大的攻击方法，攻防都具有超常的能力的强力宝具。没有单体效果，并非用于1对1的战斗的宝具，而是能扫灭广大范围的“对军宝具”。是缰绳与鞭子成对的珍稀类型的宝具，可以飞跃性地提高召唤出的幻想种的能力。实际攻击的时候，美杜莎会骑上被强化的幻想种，进行人马一体的突击攻击。");
            SkillDataBase.getInstances(context).insert("美杜莎","宝具", "自我封印·暗黑神殿", "C", "    美杜莎眼罩，作用于自身的“魔眼杀”。封印解除后便会一直使用“魔眼·Cybele”。美杜莎拥有的对人宝具之一，以一个结界(世界)封印住强力的魔眼。");
            SkillDataBase.getInstances(context).insert("美杜莎","宝具", "他者封印·鲜血神殿", "B", "    事先设置数个成为起点的魔法阵，从而形成。魔法阵设置后不久，只有略微夺取区域内人类体力的程度的效果；但是正式发动的话，结界内部的人类将会被急速溶解。但对于有魔术知识的人则稍为难以起效。之所以这样，是因为这并不是用来战斗的宝具，而是用吸血来获 得魔力的美杜莎，为了更有效率地聚集血液而制造出的结界。");
            SkillDataBase.getInstances(context).insert("美杜莎","宝具", "强制封印·万魔神殿", "A", "    放弃了作为女神最后的矜持，使曾经最终堕落后的姿态『戈耳工的怪物』暂时实体化，将指定领域内所有生命全部溶解。人类将会即刻毙命、对从者也能够造成强烈的伤害。");
            SkillDataBase.getInstances(context).insert("美杜莎","宝具", "不死杀之刃", "B", "    登场于希腊神话的神剑，形状特殊如镰刀一般，内侧带刃。虽然本身并不优秀，但被不死杀之刃伤到后伤口是绝对无法复原的。据说此剑有让不死属性无效的力量，英雄珀尔修斯以不死杀之刃砍掉了睡着的美杜莎的头。");
            SkillDataBase.getInstances(context).insert("尤瑞艾莉","职阶技能", "对魔力", "A", "    拥有能使魔法阵和瞬间契约大魔术无效化的对魔力。即便是当代最高等级的魔术师也不能用魔术直接伤害到她。");
            SkillDataBase.getInstances(context).insert("尤瑞艾莉","职阶技能", "单独行动", "A+", "   没有Master也能行动。不过使用宝具等需要庞大魔力的场合必须有Master的支援。");
            SkillDataBase.getInstances(context).insert("尤瑞艾莉","职阶技能", "女神的神核", "EX", "  作为与生俱来就是完成型的女神代表性的技能。是包含了神性的复合技能。维持着肉体和精神的绝对性。不会受到精神干涉，肉体也不会成长变化。");
            SkillDataBase.getInstances(context).insert("尤瑞艾莉","固有技能", "吸血", "C", " 可以通过吸血来得到魔力，因此也可以视状况袭击人类。");
            SkillDataBase.getInstances(context).insert("尤瑞艾莉","固有技能", "魅惑的美声", "A+", "   对男性会有魅惑的魔术效果、但对魔力技能会使其回避可能。只有坚定的意志才可以减轻效果。");
            SkillDataBase.getInstances(context).insert("尤瑞艾莉","固有技能", "女神的变化无常", "A", "    尤瑞艾莉的确是无垢与纯粹兼备。可喜怒无常、蛮不讲理的程度却也是无以复加。这种特性作用在魔术上也一样。");
            SkillDataBase.getInstances(context).insert("尤瑞艾莉","宝具", "女神的视线", "B", "    掳获勇士之心的女神魅力升华而成之物。愁闷悲苦的视线正是刀刃，摄魂夺魄的耳语正是剧毒。");
            SkillDataBase.getInstances(context).insert("斯忒诺","职阶技能", "气息遮断", "A+", "    完全隐藏自己的气息，几乎不可能被发现。但是在转入攻击状态之时，气息遮断的等级会大幅下降。");
            SkillDataBase.getInstances(context).insert("斯忒诺","职阶技能", "对魔力", "A", "    拥有能使魔法阵和瞬间契约大魔术无效化的对魔力。即便是当代最高等级的魔术师也不能用魔术直接伤害到她。");
            SkillDataBase.getInstances(context).insert("斯忒诺","职阶技能", "女神的神核", "EX", "  作为与生俱来就是完成型的女神代表性的技能。是包含了神性的复合技能。维持着肉体和精神的绝对性。不会受到精神干涉，肉体也不会成长变化。");
            SkillDataBase.getInstances(context).insert("斯忒诺","固有技能", "吸血", "C", " 可以通过吸血来得到魔力，因此也可以视状况袭击人类。");
            SkillDataBase.getInstances(context).insert("斯忒诺","固有技能", "魅惑的美声", "A", "   对男性会有魅惑的魔术效果、但对魔力技能会使其回避可能。只有坚定的意志才可以减轻效果。");
            SkillDataBase.getInstances(context).insert("斯忒诺","固有技能", "女神的一时兴起", "A", "    斯忒诺想的只有一件事。——这是否有趣。仅此而已，当兴致来时，任性的女神能够完成许多不可思议的事。这种特性作用在魔术上也一样。");
            SkillDataBase.getInstances(context).insert("斯忒诺","宝具", "女神的微笑", "B", "    掳获勇士之心的女神魅力升华而成之物。愁闷悲苦的视线正是刀刃，摄魂夺魄的耳语正是剧毒。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","职阶技能", "对魔力", "A", "    拥有能使魔法阵和瞬间契约大魔术无效化的对魔力。即便是当代最高等级的魔术师也不能用魔术直接伤害到她。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","职阶技能", "阵地作成", "B", "  建造出监狱城，将少女们监禁起来，榨取血液。本来是Caster职阶的能力，但由于生前的经历所以例外获得了。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","职阶技能", "战斗续行", "B", "  处于困境中的顽强生命力。受到濒死的重伤也能继续战斗。没有受到决定性的致命伤就能存活……虽然是这样的技能，不过对于这个Servant来说，会变成“不论被打倒多少次都会不知悔改的再次出现”的能力。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","固有技能", "拷问技术", "A", "    卓越的拷问技术。为拷问器具所造成的伤害施以正面补正。就这名Servant来说，将捉到的人类关进铁处女榨取血液，用屈指器或者拘束器具进行折磨使其发狂，有时还会像忽然想起来般地咬住手指、手臂、后颈或乳房并将其撕掉一块等等，她的残虐行为涉及到许多方面。配合上阵地作成的技能，简直是在杀人方面特化的Servant。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","固有技能", "嗜虐的领导力", "C", "    表示出作为支配阶级的威压。由于特殊的传承辅助，对于女性会上升一等级。面对男性的话奇妙地有些洁癖，虽然很喜欢隔着器具来触摸，但是直接触摸的情况很少。\n    指挥军队的才能。在复数对复数的战斗中提高己军的能力。拥有者稀少。B级的领袖气质就足以治理一国了。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","固有技能", "精神异常", "A", "    精神已然患病。并不是普通的Berserker身上被附加的狂化。变得感觉不到他人的痛苦，理解不了周围的气氛。精神上的霸体能力。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","固有技能", "无辜的怪物", "EX", "    这名Servant因为技能『无辜的怪物』而魔人化了。虽然看起来像恶魔一般，但是她的角和尾巴是龙的东西。虎牙似乎不是吸血鬼的牙齿而是龙的牙齿。\n    “无辜的怪物”是，由于从生前的行为中产生的印象使得过去和存在方式被扭曲，能力、姿态也会发生改变的技能。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","固有技能", "龙之息吹", "E", "    作为最强的幻想种，拥有仅仅是呼吸就能生成魔力的强大力量。身为最强幻想种的龙所放出的Mana湍流。虽然因为技能“无辜的怪物”而龙化了，不过有点像是在勉强自己，威力低微。\n   伊丽莎白的龙息属于超音波。她因为魔人化而使得肺部本身异界化，得到了惊人的肺活量。通过宝具增幅过的伊丽莎白的声音，甚至被认为是能响彻一个东京巨蛋并且让其倒塌的噪音。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","宝具", "龙鸣雷声", "D", "    将匈牙利自古流传的气候精灵，雷鸣之龙的威风变换成了宝具。Sarkany就是这条龙的名字。被认为是将声音和振动增幅，通过其共鸣来呼唤风雨。\n    本来的机能是将持有者的声音里的威严和领袖气质、治愈的波动、光是聆听就会摧毁心灵的恶意，又或者单纯是将声量增幅到9的9倍。不光是聆听者的身体，就连心灵也会被破坏和蹂躏的魔之歌声。据拉妮所说，龙鸣雷声的威力可以将一万头非洲象一击必杀。");
            SkillDataBase.getInstances(context).insert("伊丽莎白·巴托里","宝具", "鲜血魔娘", "E", "    召唤出伊丽莎白终生在其中君临天下的居城・监狱城赛伊特,把其当成衬托自己的舞台。唱着达到了毁灭级的音程以外的歌，展开等同于地狱般的舞台。");
            SkillDataBase.getInstances(context).insert("布狄卡","职阶技能", "对魔力", "D", "    将一工程的魔术行使无效化。驱除魔力的护身符程度的对魔力。");
            SkillDataBase.getInstances(context).insert("布狄卡","职阶技能", "骑乘", "A", "    能自由驾驭除幻兽、神兽级别以上的所有野兽和交通工具。");
            SkillDataBase.getInstances(context).insert("布狄卡","固有技能", "对女神的誓约", "B", "    布狄卡女王所许下对抗罗马，拯救不列颠的誓言，在面对视为“罗马”一方的敌人时能够强化自己的战斗力。");
            SkillDataBase.getInstances(context).insert("布狄卡","固有技能", "战斗续行", "A", "    让人在负了濒死重伤的状态下仍能够战斗的技能。并且伤患死亡率亦会下降。");
            SkillDataBase.getInstances(context).insert("布狄卡","固有技能", "安德拉斯塔的加护", "A", "    凯尔特胜利女神“安卓斯特”对于布狄卡女王的祝福，预示着胜利的祝福让女王在战场上一往无前。");
            SkillDataBase.getInstances(context).insert("布狄卡","宝具", "无以约定胜利之剑", "B", "    跟自己一样冠以“胜利”之名的单手剑。但是，绝对不是星之圣剑，也没办法约定什么胜利。只是一把心愿未竟之剑。真名解放之际，可以一次性地发射多重的魔力块。");
            SkillDataBase.getInstances(context).insert("布狄卡","宝具", "无以约定守护的车轮", "B", "    原本的模样是两匹名马拉动的战车。其为不列颠尼亚守护的象征，以高强的耐久力而著称。真名解放之际战车便会出现，守护布狄卡及其友军。虽然凯尔特众神的护佑使其得到了飞行能力，但突进的攻击力却并不如何强大。将其作为守护盟友的「盾」才是正确的运用方法。而她驱驰着战车的英姿，即便是在现代，也仍能从位于伦敦西敏区泰晤士河沿岸的铜像中得以领略。");
            SkillDataBase.getInstances(context).insert("源义经","职阶技能", "对魔力", "C", "    无效化以二工程以下咏唱引起的魔术。不能防御大魔术、礼仪咒法等，大规模的魔术。");
            SkillDataBase.getInstances(context).insert("源义经","职阶技能", "骑乘", "A+", "    能自由驾驭除幻兽、神兽级别以上的所有野兽和交通工具。");
            SkillDataBase.getInstances(context).insert("源义经","固有技能", "天狗的兵法", "A", "    源于她从身为非人存在的天狗学习过兵法的逸闻。对剑术、弓术、枪术等近接战斗力以及军略和对魔力等给予加成。");
            SkillDataBase.getInstances(context).insert("源义经","固有技能", "领导力", "C", "    指挥军队的才能。在复数对复数的战斗中提高己军的能力。拥有者稀少。C级的领导力还不足以治理一国。");
            SkillDataBase.getInstances(context).insert("源义经","固有技能", "燕之神技", "B", "    源义经如燕子般轻盈的飞跃，是能够增强敏捷的强大技巧。");
            SkillDataBase.getInstances(context).insert("源义经","宝具", "遮那王流离谭", "A++", "    牛若丸成长为源义经、直至身死奥州的一生中缔造的各式传说之具现。\n    自在天眼·六韬看破    对区域内的全员进行强制移动，改变为对本军压倒性地有利、而对敌军压倒性不利的状态。\n    薄绿·天刃缩步    藉薄绿施以炫光斩击。这以天狗步法缩地而出的一击，极其地难以躲避。\n    弁庆·不动立地    将且仅将武藏坊弁庆的肉体进行模拟再现。对弁庆的信赖越强，弁庆充作的盾就越坚固。至多能防御至B等级的对军宝具。\n    坛之浦·八艘跳    据传于坛之浦所展现出的八艘跳一举的具现化。不论立足点如何不利，只要有能够勉强落脚的地点便能藉跳跃进行移动。此外，也可以仅针对跳跃力进行强化。\n    吼丸·蜘蛛杀　　将薄绿原本的「力量」发挥出来，驱退周遭的「魔」，藉由声音附加伤害。");
            SkillDataBase.getInstances(context).insert("玛丽·安托瓦内特","职阶技能", "对魔力", "C", "    无效化以二工程以下咏唱引起的魔术。不能防御大魔术、礼仪咒法等，大规模的魔术。");
            SkillDataBase.getInstances(context).insert("玛丽·安托瓦内特","职阶技能", "骑乘", "A+", "    能自由驾驭除幻兽、神兽级别以上的所有野兽和交通工具。");
            SkillDataBase.getInstances(context).insert("玛丽·安托瓦内特","固有技能", "魅惑的美声", "C", "    既是能吸引人的魅惑系技能的同时，也是行使王权的力量的宣言。作为象征性的存在现界的玛丽，其歌声能对王权的敌对者造成魔力伤害。");
            SkillDataBase.getInstances(context).insert("玛丽·安托瓦内特","固有技能", "美丽的公主", "A", "    吸引周围的人的领导力性质。仅仅只是存在就能够吸引想成为守护自己的骑士的人。");
            SkillDataBase.getInstances(context).insert("玛丽·安托瓦内特","固有技能", "神之恩宠", "B", "    最高级别的美貌与肉体，展示“王权之美”的技能。");
            SkillDataBase.getInstances(context).insert("玛丽·安托瓦内特","宝具", "愿荣光存于百合的王冠", "A", "    象征法兰西光荣王权的宝具。其外观为，纳有法兰西皇家纹章（百合花纹章）的玻璃所构成的美丽马匹。藉由真名解放，玛丽便会唤来这匹宝马，在驱驰中将灿烂的光粒轻盈地撒满战场，对王权的敌对者施予伤害。同时也会解除友方的Bad Status，并回复体力和魔力。");
            SkillDataBase.getInstances(context).insert("玛丽·安托瓦内特","宝具", "万人爱戴的光辉将永垂不朽", "B", "    示出历代法兰西皇家权势的展现、以其巨大和优美著称的宫殿。玛丽及其友方的Status会暂时性地提高等级。即便王权业已失却，挚爱的重任和法兰西仍会永远地留存——将玛丽的这一信念作为新时代及发展的象征而苏醒的，即是这座Crystal Palace。至于和邻国英国在位于伦敦的世界博览会中建成的「水晶宫」同名一事，则断然不是什么嘲讽奚笑，而是将玛丽的爱所遍及的范围广大的展现才对。");
            SkillDataBase.getInstances(context).insert("玛尔达","职阶技能", "对魔力", "A", "    拥有能使魔法阵和瞬间契约大魔术无效化的对魔力。即便是当代最高等级的魔术师也不能用魔术直接伤害到她。");
            SkillDataBase.getInstances(context).insert("玛尔达","职阶技能", "骑乘", "A++", "    能自由驾驭除幻兽、神兽级别以上的所有野兽和交通工具。原本的骑乘技能无法乘坐的龙种，也例外地可以骑乘，连龙种都能驾驭的力量。");
            SkillDataBase.getInstances(context).insert("玛尔达","职阶技能", "神性", "C", "    作为救世主的旅途上的同行者，在水边之街将利维坦之子、邪龙塔拉斯克降服的圣人，玛尔达成为了被崇敬，崇拜的对象。");
            SkillDataBase.getInstances(context).insert("玛尔达","固有技能", "信仰的加护", "A", "    由信仰而生的，肉体与精神的绝对性。");
            SkillDataBase.getInstances(context).insert("玛尔达","固有技能", "奇迹", "D+", "    时而将不可能化为可能的奇迹。与星之开拓者技能有着相似的部分，但本质上是不同的东西。能够适用的事物也不同。");
            SkillDataBase.getInstances(context).insert("玛尔达","固有技能", "天性的肉体", "A", "    玛尔达脱下圣衣后其肉体作为生物是完美的。一脱发现很厉害。虽然是显示肉体绝对性的技能，但也有作为对他人的魅惑技能的效果。");
            SkillDataBase.getInstances(context).insert("玛尔达","固有技能", "水边的圣女", "C", "    在船上进行了漂流，在罗纳河之滨制服了塔拉斯克的马大和水非常有缘。所处位置被认知为水边的时候，其攻击力会上升，变得亢奋起来。");
            SkillDataBase.getInstances(context).insert("玛尔达","固有技能", "雅各的手足", "B", "    雅各、摩西，然后到玛尔达，这样代代相传来的古老格斗技巧。如果能练到炉火纯青，连大天使都能打败。据传说，或曾习得这个技巧的圣者，打死了率领一万二千天使的『破坏天使』。宝具真名解放时玛尔达能够做出「那样的举动」，也都是因为这个技能。");
            SkillDataBase.getInstances(context).insert("玛尔达","宝具", "圣护手", "C", "    被圣子祝福过的圣护手，玛尔达引以为傲的武具，带上这对手套，即使是怎样的邪魔外道也能送他们上天堂(物理)。");
            SkillDataBase.getInstances(context).insert("玛尔达","宝具", "刀枪不入的龙之盾啊", "C", "    召唤塔拉斯克的甲壳为盾，保护自己或一位同伴。提升对象物理防御力并短时间免疫物理攻击。");
            SkillDataBase.getInstances(context).insert("玛尔达","宝具", "不懂爱的悲哀之龙啊", "A+", "    召唤怪兽塔拉斯克，真名读法和「刀枪不入的龙之盾啊」一致。\n    巨大的头部、遍布锐刺的甲壳、六肢脚、长有毒刺的长尾巴，持有这些特征的怪物，这正是塔拉斯克，旧约圣经中记载的海怪利维坦之子。无论水陆都能自在移动的龙种塔拉斯克潜伏在隆河底，使来往的船只沉到水里并大肆吃人，为了讨伐它而来访的战士们无论使用刃矢都会被那副大铁甲弹开，最后被它吐出的火焰烧成灰。\n    能个降伏这头无敌怪物的，只有圣女玛尔达。作为玛尔达的宝具被召唤出来的塔拉斯克，会以大铁甲龙·灼热大回转击将敌阵体无完肤的燃烧殆尽，彻底击溃。");
            SkillDataBase.getInstances(context).insert("美狄亚","职阶技能", "阵地作成", "A", "    作为魔术师得以制作对自己有利的名为「工房」的阵地。A级的话，甚至可以构筑比「工房」更加高级的「神殿」。");
            SkillDataBase.getInstances(context).insert("美狄亚","职阶技能", "道具作成", "A", "    可以制作带有魔力的器具，从用于战斗的道具到日用品，能自由自在地造出林林总总的物品。就连近似不死之药的药品也可调配出。龙牙兵也是用这个能力造出来的东西。此外，还能造出被称为“魔术礼装”的魔术道具,不过，以道具作成等级A自豪的美狄亚所制作的魔术礼装，和其他魔术师制作出来的东西相比有着天壤之别。");
            SkillDataBase.getInstances(context).insert("美狄亚","固有技能", "高速神言", "A", "    不连接魔术回路而能够发动魔术的咒文。瞬间契约，能以一工程的时间启动大魔术。辅佐魔术咏唱的技能。“神言”是各个神话时代所使用，也就是上级咒文言语 。人类的发声器官无法再现 。");
            SkillDataBase.getInstances(context).insert("美狄亚","固有技能", "金羊毛皮", "EX", "    传承于科尔基斯的金色的羊的皮。拥有“投向地上的话龙就会出现”的传说。");
            SkillDataBase.getInstances(context).insert("美狄亚","固有技能", "耐毒", "A", "    美狄亚对于毒素拥有强大的抗性，掌握着各种治疗咒法的她无论是怎样的毒素都可以解除。");
            SkillDataBase.getInstances(context).insert("美狄亚","宝具", "万符必将破戒", "C", "    魔女美狄亚的生涯所化成的概念法具。能够破戒一切魔术的短刀，能使被魔力强化的物体，由契约形成的紧密关系，由魔力赋予生出的生命回归初始的对魔术宝具。");
            SkillDataBase.getInstances(context).insert("美狄亚","宝具", "万疵必行修补", "C", "    “万符必将破戒”对应的治疗宝具。不论什么样的诅咒，魔法造成的损伤都回复成零。\n    “万疵必行修补”不是时间操作，是计算本来应该有的样子而进行自动修复。不知道的人只会认为是时光倒流吧，“死”之外所有的不讲理现象都可以打破，但是只有死者无法救回。");
            SkillDataBase.getInstances(context).insert("紫幽","职阶技能", "对魔力", "EX", "    紫幽作为混元圣人万法不侵，无论是怎样的魔术甚至是魔法都无法对她造成影响。");
            SkillDataBase.getInstances(context).insert("紫幽","职阶技能", "骑乘", "EX", "    即使是神龙、凤凰和麒麟这样的神兽都无法违抗她的命令，然而沉迷有教无类的她见到异兽也只是会把他们收作门徒，再加上本人遁术惊人，所以“骑乘”的技能相当于不存在");
            SkillDataBase.getInstances(context).insert("紫幽","固有技能", "玄门数术", "EX", "    最顶级的测算之术，只要不是同等级的圣人遮掩天机，无论过去、现在还是未来都能够掐指一算立刻知晓。");
            SkillDataBase.getInstances(context).insert("紫幽","固有技能", "上玄清气", "EX", "    紫幽所修炼的法诀，混沌初开的玄清气之一，威力到了可以重练地水风火，再造世界的地步。");
            SkillDataBase.getInstances(context).insert("紫幽","固有技能", "截教教主", "EX", "    紫幽作为截教之主的能力，包括统御力和传道受业的能力等等，是能够统治一个终极神系的能力。");
            SkillDataBase.getInstances(context).insert("紫幽","固有技能", "圣人之体", "EX", "    紫幽修成五气朝元，三花聚顶，也是万劫不坏的身体。不光威力惊人，也代表了作为女性的超越界限的魅力。");
            SkillDataBase.getInstances(context).insert("紫幽","固有技能", "神性", "EX", "    作为截教通天教主，拥有超越任何神明，仅次于鸿钧老祖的神性。");
            SkillDataBase.getInstances(context).insert("紫幽","宝具", "青萍剑", "EX", "    剑长三尺六寸五分。剑身与剑鞘通体皂黑，有青色莲花覆绕其上。三十六品净世青莲之莲叶所化，三大先天功德灵宝之一，由三清的师尊鸿钧老祖赐予。");
            SkillDataBase.getInstances(context).insert("紫幽","宝具", "诛仙四剑", "EX", "    天道第一凶器。一旦祭出顿时无穷毁灭之气笼罩混沌，无尽杀戮之色覆盖鸿蒙。有诗为证：\n      非铜非铁亦非钢，曾在须弥山下藏。\n      不用阴阳颠倒炼，岂无水火淬锋芒？\n      诛仙利、戮仙亡，陷仙四处起红光。\n      绝仙变化无穷妙，大罗神仙血染裳。");
            SkillDataBase.getInstances(context).insert("紫幽","宝具", "诛仙剑阵图", "EX", "    三千大道天魔尸身所化，结合诛仙四剑可以布下天道第一杀阵——诛仙剑阵，有炼化地水风火，再开洪荒世界的能力。");
            SkillDataBase.getInstances(context).insert("紫幽","宝具", "碧游宫", "EX", "    固有结界，实际上是通天教主的道场，除了作为仙宫召唤之外也能作为珍宝库使用，里面储藏着紫幽多年来的珍藏，其中不乏六魂幡、穿心锁，紫电锤等EX级别的宝物。");
            SkillDataBase.getInstances(context).insert("嬴政","职阶技能", "煌煌天子，神鬼莫侵", "A++", "    “对魔力”技能的升华，嬴政乃是最高位的天子，龙气加身，神鬼莫侵，拥有能使魔法阵和瞬间契约大魔术无效化的对魔力。即便是当代最高等级的魔术师也不能用魔术直接伤害到他。");
            SkillDataBase.getInstances(context).insert("嬴政","职阶技能", "率土之滨，莫非王臣", "EX", "    “骑乘”技能的升华，用来驾驭乘坐物的能力，始皇帝本人凌驾万物之上，就连龙种也无法拒绝他的命令。该技能就连让人类臣服，甚至让英灵效忠也不是做不到。");
            SkillDataBase.getInstances(context).insert("嬴政","职阶技能", "雷霆雨露，皆为君恩", "A", "    “道具作成”技能的升华，始皇帝本身就代表了人道主宰，任何被他使用过甚至触摸过的物品都蕴含了无尽的神秘。");
            SkillDataBase.getInstances(context).insert("嬴政","职阶技能", "普天之下，莫非王土", "EX", "    “阵地作成”的升华，始皇帝本人所在之处自有起运镇压，世间各处对于他来说都是“魔术工坊”等级的阵地。一手设计出咸阳城、长城、阿房宫等建筑的嬴政只要愿意，就能作为国土展开更加高级的阵地，甚至等同于“神国”。");
            SkillDataBase.getInstances(context).insert("嬴政","固有技能", "万皇之始，千古一帝", "EX", "    秦始皇是最初也是最伟大的皇帝，拥有着最高的特权，本来不能持有的技能，也可以因为本人的主张而获得，用心的话甚至有可能就此真正掌握。符合的技能是骑乘、剑术、艺术、统率力、谋略等。等级是A以上的情况下，连肉体层面的负荷也能获得。");
            SkillDataBase.getInstances(context).insert("嬴政","固有技能", "宇内八荒，天下一统", "EX", "    中央集权，给予始皇帝的特殊技能“一统”，体现嬴政做为中华历史上第一位皇帝制度的缔造者的技能。对始皇而言，则是进行了“车同轨，书同文，万事归一”之统一，是将纷繁万物全部归于为皇帝之概念下的统一。根据皇帝的意志，随心所欲地削弱乃至剥夺他人的技能，A以上的等级甚至能让其完全消失。");
            SkillDataBase.getInstances(context).insert("嬴政","固有技能", "天上天下，唯我独尊", "EX", "    嬴政一生毁城灭国无数，废分封立郡县，驱神魔而独尊，无数王族传承、神灵道统断绝与其手中，对持有“王”、“神”的概念或作为王、神灵的对手来说嬴政是致命的天敌。");
            SkillDataBase.getInstances(context).insert("嬴政","固有技能", "人皇在世，天命昭昭", "EX", "    作为天命观盛行的华夏中帝王的顶点，嬴政本身就是天命的化身，比任何人都能得到天命的青睐————即便是EX级的幸运都比不上的终极的幸运。");
            SkillDataBase.getInstances(context).insert("嬴政","固有技能", "星之开拓者", "EX", "    赋予给成为人类历史转折点的英雄的特殊技能。一切困难航程、苦行会“仍旧不可能”地变成“可以实现的事情”，而对于人理来说没有比秦始皇的伟业更加不可能完成的奇迹了。");
            SkillDataBase.getInstances(context).insert("嬴政","固有技能", "超越时空的双重灵魂", "EX", "    说是双重的灵魂实际上是只有一个意识而有双倍的灵魂力量，所以可以同时以“saber”、“caster”的职介现界。由于灵魂间有着超越时空的力量，即使是抑制力也无法干涉。");
            SkillDataBase.getInstances(context).insert("嬴政","宝具", "履至尊而制六合", "EX", "    嬴政接受了封禅，抛弃王的封号，接受皇帝名号，致昆山之玉，有随和之宝，垂明月之珠，服泰阿之剑，乘纤离之马，建翠凤之旗，树灵鼍之鼓，加冕至尊之位，德兼三皇，功盖五帝，统御六合，四海宾服。\n    放弃隐蔽真名而解放这个技能，此时的嬴政才真正的取回了帝王的冠冕和权柄，解封昆山玉、随和宝、明月珠、泰阿剑、纤离马、翠凤旗、灵鼍鼓等一身A级以上的宝具，同时获得各种EX级别的能力：\n    作为千古一帝，受亿万人数千年膜拜而形成的远超任何神灵的“神性”；\n    超越人之极限，攻无不克战无不胜，能够建立跨星球级别帝国的“领导力”；\n    千金散尽复还来，足以短时间内颠覆国际金融的“黄金律”；\n    言出即法随，在领域内发布圣旨御令的绝对“言灵”能力。\n    眼识忠奸，唯才是举的“鉴识眼”。");
            SkillDataBase.getInstances(context).insert("嬴政","宝具", "筑长城而守藩篱", "EX", "    最终的防御宝具，嬴政为守卫国境而修筑的万里长城的具象化，A级以下只要是被判断有敌意，作为敌人的一切都无法突破这份防御。真名解放后转变为即使是EX等级的攻击也无法击破的结界。");
            SkillDataBase.getInstances(context).insert("嬴政","宝具", "削锋镝而铸金人", "EX", "    秦始皇收取天下兵器，铸造了十二金人————巨型魔像。超越人类的科技与魔道组合而成的极致魔导机甲，功能各不相同，但每一个都拥有破灭星球的能力。\n    在真名解放之前作为手办饰品而存在，但无论是怎样的状态都拥有无解的能力：吸引并且吞噬四周的武器————或者被使用者定义为武器的存在，范围随魔力而定，A级以下的武具完全无法抵抗这种吸引力。");
            SkillDataBase.getInstances(context).insert("嬴政","宝具", "历百家而藏典籍", "EX", "    秦始皇创造了纸，印刷术和书籍，拓印了世间的任何典籍而收藏于一处的大图书馆，被称为“阿卡夏的图书馆”。人类文明的任何艺术造物和知识都以书籍的形式收藏在这里————也就是说任何知识和艺术品在面世的时候他的原本就会出现在图书馆中。\n    图书馆的书籍拥有持有就能够立即掌握知识的特性，并且使用时会有极大的加成，然而如果不真正的学习，只要不再持有书籍就会立刻忘记技能。\n    来到21世纪的今天，始皇帝的图书馆貌似也升级了，目前好像多了大量的服务器用作电子图书馆。");
            SkillDataBase.getInstances(context).insert("嬴政","宝具", "传国玺", "EX", "    全称“大秦万世传国玉玺”，为中国历代皇帝相传之印玺，乃奉秦始皇之命所镌。被视为王朝正统的象征。正面刻有“受命于天 既寿永昌”八字、环刻“双龙戏珠图案“、最下面有三道尖波浪线、双边。是帝王的终极象征，持有它的人能够无视等级获得至少A++级别的幸运，而作为敌人的存在幸运会立即下降至少两个等级。\n    实际设计出来是为了操纵龙脉的力量，完全解放时能够操纵至少一国的灵脉（魔术师对龙脉的称呼）。如果不计代价的解放即使是整个星期的灵脉都会被控制。");
            SkillDataBase.getInstances(context).insert("嬴政","宝具", "朕所在之处即为大秦", "EX", "    大秦始皇帝嬴政，为自己修建的巨大陵寝——阿房宫，但其实是汇聚着始皇帝一生功绩的强大固有结界。宝具的展开分为四个层次：\n    第一层·咸阳城\n    将周围变为自己的领地，作为阵地来说已经到了A级，但并不改变环境，嬴政身在此中会得到大量的加成，同时可以在周围环境中迅速汲取魔力，并且“履至尊而制六合”所带来的言灵能力能够完全作用在这个范围内，此状态可以始终保持解放。\n    第二层·兵马俑\n    同第一层一样并不改变环境，但会召出一定数量的兵马俑军士来协助自己战斗。兵马俑战斗力大约在D到C级从者的水平，制作原理是混和了中国古代易经以及机关术，附上秦军军魂的魔导傀儡，在领域范围之内兵马俑即使受了再大的伤害也能立刻修复，可谓是不死的军团\n    第三层·阿房宫\n    环境开始出现异化，开始展现出阿房宫的面貌，作为始皇帝的宫殿，所有闯入者都会受到皇权的压制，所有的能力都会下降一个等级。\n    第四层·秦帝国\n    对周围环境的侵蚀完全完毕，心想风景的完全展现。宏大肃穆的殿堂，远处的长城巍峨蜿蜒，耸立的十二金人，整装待发的兵马俑军队，绝无仅有的帝王领域，同时作为臣子的大秦英杰们也都会响应召唤作为英灵一一现界，其中不乏“白起”、“李斯”、“徐福”这样的破格级别的英灵。");
            SkillDataBase.getInstances(context).insert("徐福","职阶技能", "阵地作成", "EX", "    作为魔术师得以制作对自己有利的名为「工房」的阵地。建立了神国“高天原”和秘境“幻想乡”的徐福在这方面拥有无可媲美的才能。");
            SkillDataBase.getInstances(context).insert("徐福","职阶技能", "道具作成", "EX", "    可以制作带有魔力的器具，徐福擅长炼丹术与炼器术，传说炼制出了完美的不死之药。");
            SkillDataBase.getInstances(context).insert("徐福","固有技能", "神性", "EX", "    徐福以日本神话中“伊邪那美”、“伊邪纳岐”之名踏足神位，本身就属于最顶级的神灵了。");
            SkillDataBase.getInstances(context).insert("徐福","固有技能", "高速神言", "A", "    不连接魔术回路而能够发动魔术的咒文。瞬间契约，能以一工程的时间启动大魔术。辅佐魔术咏唱的技能。“神言”是各个神话时代所使用，也就是上级咒文言语 。人类的发声器官无法再现 。");
            SkillDataBase.getInstances(context).insert("徐福","固有技能", "阴阳五行", "EX", "    徐福所修行的术法之道，简化改动后以阴阳术之名传播于东瀛。有这样的传说加成，即使是怎样的阴阳五行之术也达到了EX级别的水平");
            SkillDataBase.getInstances(context).insert("徐福","固有技能", "世界创造", "EX", "    日本神话中创造世界与人类的神灵，这样的传说使徐福在创造之道上拥有了超凡的造诣。");
            SkillDataBase.getInstances(context).insert("徐福","固有技能", "神祖", "EX", "    身为日本神话中的神祖，面对日本的英灵与神灵都有着强大的等级压制。");
            SkillDataBase.getInstances(context).insert("徐福","固有技能", "和之缔造者", "A+", "    徐福东渡日本，传播文明，缔造这个和之国度。作为大和文明的缔造者，徐福对于她的后人和子民们有着绝对的权利————日本的英灵和宝具会被完全克制，甚至可以做到夺取地域属于日本的宝具。");
            SkillDataBase.getInstances(context).insert("徐福","宝具", "黄泉之国", "EX", "    固有结界，以伊邪那美的权能展开黄泉的国度，召唤八大雷神和无尽的亡灵军势。在黄泉之国中，一切生灵死亡后都会化作亡灵为伊邪那美而战。");
            SkillDataBase.getInstances(context).insert("徐福","宝具", "天沼矛", "EX", "    传说中日本的创世之矛，在破坏方面并没有什么特别的威力，但是拥有将被划过的地方完全分开的能力，被这个能力分开的东西不能以时间逆流以外的方式重新合并。真名解放后可以用于操纵板块，引发地裂、地震、火山甚至是海啸这样的天灾。");
            SkillDataBase.getInstances(context).insert("徐福","宝具", "天羽羽斩", "A", "    又名“十拳剑”，传说中伊邪纳岐的佩剑，被这把剑杀死的人灵魂会被封印至剑中去向往生，克制复活和转生之类的技能。由于有着杀死“加具土命”的传说，挥动这把剑就能“杀死”火焰。");
            SkillDataBase.getInstances(context).insert("徐福","宝具", "神国降临·高天原", "EX", "    徐福终极的固有结界，召唤出名为高天原的领域，领域范围内的一切除了人类意外的事物都会化作“八百万神明”————其实只是万物的精灵。虽然不是真正的神灵，但仍有着英灵等级的战力。这个固有结界全力释放甚至可以召唤出以某狐狸为首的三御神。");
            SkillDataBase.getInstances(context).insert("荆轲","职阶技能", "气息遮断", "EX", "    完全隐藏自己的气息，几乎不可能被发现。");
            SkillDataBase.getInstances(context).insert("荆轲","固有技能", "抑制", "A", "    在攻击前完全不露半丝杀气的暗杀者奥义。A等级的话，直到手握住武器前都无法感觉到她的杀气。");
            SkillDataBase.getInstances(context).insert("荆轲","固有技能", "谋划", "B", "    如何将对象暗杀的战术思考。与军略不同，只能应用在少数的暗杀计划。另外，荆轲不会将自己的生还纳入考虑。");
            SkillDataBase.getInstances(context).insert("荆轲","固有技能", "帝王之阴影", "A", "    常年作为皇帝的阴影存在，无论是怎样的黑暗都能够面对。不可思议的藏匿于阴影中的技巧，诸如全知全能，千里眼之类的技能都无法了解到荆轲的存在。");
            SkillDataBase.getInstances(context).insert("荆轲","固有技能", "五步绝杀", "A+++", "    号称“五步之内，百人不当”。荆轲的绝杀之剑，也是强大的加速技巧，凡人之躯够踏破空间的技之顶点，天下无人能够逃生。是荆轲的绝技，但秦王政为何没有死，无人知晓其原因。");
            SkillDataBase.getInstances(context).insert("荆轲","宝具", "不归匕首", "A", "    为暗杀始皇帝而准备的匕首。由于有着暗藏于卷起的地图中的逸话，在隐匿这一方面十分优秀。动用这把匕首，即是意味着有了「自己不会归来」的觉悟。故而，荆轲会将自己的死全盘接受下来，倾尽全力将暗杀进行到底。而以自己不会归来为前提进行任务这一点，也正意味着这是极难回避的暗杀宝具。");
            SkillDataBase.getInstances(context).insert("荆轲","宝具", "直死之魔眼", "A", "    被称作魔眼的，异能之中最高级别的能力。无论无机物还是有机物，只要读取到“活物”的死亡因素，就被视作可以干涉的现象。从直死之魔眼中看到的世界是在“死线”上满布着的终结景象。这是世界对于终极的生命剥夺者的认可和礼物。");
            SkillDataBase.getInstances(context).insert("白起","职阶技能", "复仇者", "A++", "    职阶的证明。当作战目标为复仇时，或从者本身存在复仇的判定时，强化从者自身的Status。EX级别效果为除幸运外Rank上升二级。");
            SkillDataBase.getInstances(context).insert("白起","职阶技能", "忘却补正", "A++", "    为了复仇，将曾经的自己舍弃，强调自己作为复仇者的一面，并给予职阶补正。");
            SkillDataBase.getInstances(context).insert("白起","职阶技能", "自我回复", "B", "    复仇者职阶赋予的，通过魔力修复创伤的技能。");
            SkillDataBase.getInstances(context).insert("白起","固有技能", "军略", "A", "    并非一对一的作战，而是团体战斗中的战术有着敏锐的触觉，在我方对军宝具的使用和对方对军宝具的防御方面有着附加的效果。\n    白起作为战国四大名将之首，兵家四圣之一，其军事能力在整个中国历史上可是说的是数一数二的，其所领导的军事行动，极大推进了秦统一战国的进程。");
            SkillDataBase.getInstances(context).insert("白起","固有技能", "人屠", "EX", "    只有历史上的屠杀者才会拥有的技能。白起则正是此技能最初的拥有者，或者说，白起与【人屠】等同一体，因此白起拥有最高等级的【人屠】。\n    在面对『灵长类』时，能够确实击破对方的能力。换句话说，敌人只要是『灵长类 』，与之战斗时白起会获得绝对的优势加成和补正，并对对手产生天敌般的压制，等同于“灵长类杀手”的位格。");
            SkillDataBase.getInstances(context).insert("白起","固有技能", "绝灭", "A", "    只要对方还有一丝生机，就不会停止战斗。代表将所有残存生力粉碎，彻底断绝。反击可能的战术和执行力。能够无效化同等级的战斗续行类的技能，并在作战中给予对方一定的精神威压。同等级的勇猛可以无效此技能的效果。\n    白起一生最为推崇歼灭战，追求每战必胜，每胜必歼。不给敌人留下生机，断绝后患。\n");
            SkillDataBase.getInstances(context).insert("白起","固有技能", "怨灵缠身", "-", "    据后世学者考证，战国时期共战死两百万人，而死在白起所领导的战役之下的足有一百万，白起脚下不可否认的铺满了无数的尸骨。\n    被怨灵与鬼魂所附身者拥有的技能，带给技能持有者对诅咒和瘟疫极强的抗性，同时能够隐蔽从者的部分信息和能力值。面对不具备“恶”属性从者时，会随机下降敌方的数值。");
            SkillDataBase.getInstances(context).insert("白起","宝具", "怨与血之哀嚎", "C", "    白起生前作战所持的武器的集合。其形态包括剑、戈和弩三种形态，可以随意转换。是被Avenger这一职阶所扭曲的产物，原本普通的武器被歪曲成了一种包含“恶”的概念，被白起杀死的人的灵魂会被囚禁在这把武器里，在白起进行攻击时，发散自己的怨恨。");
            SkillDataBase.getInstances(context).insert("白起","宝具", "黄土万骨，冤魂恸哭", "EX", "    白起一生征战的缩影，固有结界。解放缠绕在白起周身数千年的百万怨魂，它们哭嚎、咆哮，寻找一切有生命之物，然后将其吞噬，并与其一同消灭。结界一般改变周遭环境，甚至会导致范围内的世界崩裂。释放后，对范围内的所有有效目标进行判定，排除【恶】与【死灵】等特性后，会先降低目标的能力数值，之后展开源源不断攻击，剥夺生命力至枯竭。");
            SkillDataBase.getInstances(context).insert("李斯","职阶技能", "对魔力", "A", "    拥有能使魔法阵和瞬间契约大魔术无效化的对魔力。即便是当代最高等级的魔术师也不能用魔术直接伤害到她。");
            SkillDataBase.getInstances(context).insert("李斯","职阶技能", "看破真名", "A+++", "    以Ruler身份被召唤出来的情况下，所有直接遇见的Servant其真名、职阶以及性能情报将会自动揭露。对方有隐藏真名及性能的固有能力或宝具时，须按幸运等级来判定，但作为大学者的李斯在这方面有着学识的加成。");
            SkillDataBase.getInstances(context).insert("李斯","职阶技能", "自我回复", "A", "    Ruler的最高特权，使用对参加圣杯战争的每个Servant的两划令咒的权利，不能用其他Servant的令咒来代替。说是“神明裁决”，对于李斯而言不如说是“帝王裁决”。");
            SkillDataBase.getInstances(context).insert("李斯","固有技能", "领导力", "A++", "    指挥军团的天生才能，A级的领导力足以建立世界级的大帝国，作为大秦帝国的宰相，大政治家与大战略家，李斯在这方面有着超越极大部分王者的才能，也只有千古一帝秦始皇才能在这方面压制住她。");
            SkillDataBase.getInstances(context).insert("李斯","固有技能", "秩序创造者", "EX", "    作为人类封建时代完整秩序的最初创建者，李斯有着在一定范围内建立秩序的能力。在这个范围内所有的秩序会被世界所认可并且被无条件的执行。范围大小与秩序的数量影响魔力的消耗。");
            SkillDataBase.getInstances(context).insert("李斯","固有技能", "严刑峻法", "A", "    与拷问技术类似的技能，对于被李斯认定违逆“正法”的对手的攻击获得伤害补正。因强化出血与给予痛苦方面的机能，在普通攻击的伤害后会渐渐追加伤害。");
            SkillDataBase.getInstances(context).insert("李斯","固有技能", "军师的忠言", "A+", "    军师系Servant的技能。能对战况进行分析，并给予对我方形势有用的建议。等级越高准确性越高。等级A+的情况下可以把意外事态在内、进行100%预测。若要对抗此技能，需要拥有非常强大的幸运。");
            SkillDataBase.getInstances(context).insert("李斯","固有技能", "军师的指挥", "A+", "    军师系Servant的技能，把包括自己在内的兵士最大力量发挥出来。等级A+的情况，能让士兵使出逼近“做好了死的觉悟”程度的实力。");
            SkillDataBase.getInstances(context).insert("李斯","宝具", "千古帝王之相", "B", "    李斯作为辅佐嬴政最重要的文臣功绩而升华的宝具，能够辅佐主君成就帝王霸业的绝对才能。能无条件的强化任意的目标，除了激发出最大潜力之外，除了幸运之外的能力也能够无条件上升两个等级。");
            SkillDataBase.getInstances(context).insert("李斯","宝具", "大秦律", "EX", "    李斯一生的杰作，一切律法的起源，升华为了人理秩序的终极，虽然是“大秦律”但对全世界的“灵长类”都适用。使用“大秦律”所发布的律令对于“人”、“人造产物”、“人类幻想”等有着绝对的权力，虽然有着只能发布无差别律令而不能针对个体这样的限制，但是使用方法合适的话仍然无可匹敌。全力解放这个宝具时能够覆盖整个世界，这时候如果发布了“否定人类存在”之类的乱来的律令的话能够轻易的造成全人类的毁灭，所以该宝具被施加了封印————不得到嬴政的认可无法完全解封。");
            SkillDataBase.getInstances(context).insert("吉尔伽美什","职阶技能", "对魔力", "C", "    对魔力的等级低微，但由于齐备了以黄金之铠甲为代表的多种对魔术用防具，实际上能无效化大部分的魔术。");
            SkillDataBase.getInstances(context).insert("吉尔伽美什","职阶技能", "单独行动", "A+", "    没有Master也能行动。不过使用宝具等需要庞大魔力的场合必须有Master的支援。");
            SkillDataBase.getInstances(context).insert("吉尔伽美什","职阶技能", "神性", "A+", "    吉尔伽美什拥有在英灵之中最高级别的神灵适性，但是因为吉尔伽美什本人憎恶着杀死友人恩奇都、让天之公牛在地上暴乱等等总是给他添麻烦的神，所以等级降低。");
            SkillDataBase.getInstances(context).insert("吉尔伽美什","固有技能", "领导力", "A+", "    吉尔伽美什拥有出色的指挥率领大军团的才能，她也被称赞为最优秀的王。\n    领导力是稀少的才能，如果统治一个王国等级B就很足够了，吉尔伽美什的领导力等级是A+。达到这种境界，已经超越了人望或技术，称得上是魔力或诅咒一类。姿态威风凛凛、自信洋溢的吉尔伽美什，得到他率领的军队，光是那样能力就会大大提高，士气会变得非常高昂。");
            SkillDataBase.getInstances(context).insert("吉尔伽美什","固有技能", "黄金律", "A", "    吉尔伽美什拥有在其一生里财运缠身的命运，一辈子都不为金钱所困，过着大富豪的生活。");
            SkillDataBase.getInstances(context).insert("吉尔伽美什","固有技能", "收藏家", "EX", "    取得更好品质的道具的才能。虽然是一份连稀有道具也会频繁地获得的幸运，但由于只适用于吉尔伽美什本人，不会给Master带来恩恵。");
            SkillDataBase.getInstances(context).insert("吉尔伽美什","固有技能", "魔杖的支配者", "EX", "    操纵着丰富多彩的魔术礼装的吉尔伽美什所展示的技能。付予魔术系攻击的额外能力。全力战斗便会小心对待道具。这就是本来的王。");
            SkillDataBase.getInstances(context).insert("吉尔伽美什","宝具", "王之财宝", "A++", "    吉尔伽美什拥有的连向“黄金之都”钥匙状的剑。与宝物库的空间相连，可以自由地取出在收藏在其中的宝物。等级为E～A++，意指放入到宝物库的道具的等级。若果宝物库未放入像样的财宝，就并不是那么有用的宝具。\n    “收集了人间所有宝物”是吉尔伽美什的口头禅，不过这并不是单纯的比喻。吉尔伽美什将他的时代里产生的，所有技术的雏形收集起来，收归己有。与其说里面是吉尔伽美什贮藏下来的财宝，不如说是“人类智慧的原典”其本身。\n    被打出去的宝具在使用后，很快就会回到吉尔伽美什的宝库中去。他也曾说过“哼，因为有用于回收的优秀宝具”。");
            SkillDataBase.getInstances(context).insert("吉尔伽美什","宝具", "全知全能之星", "EX", "    宛如星之光辉一样遍及大地各处，看透万象，是英雄王的精神升华为宝具之物。永久发动型的宝具。效果惊人，可以一眼看穿对手的真名或是宝具等等施加了多重掩藏的真实。");
            SkillDataBase.getInstances(context).insert("吉尔伽美什","宝具", "王之号炮", "B", "    从乌鲁克城塞发起远距离的轰击。不仅仅是吉尔伽美什，生于神所在的时代乌鲁克的人民集全部之力发出惊人的炮击。吉尔伽美什悲痛万分将自己的收藏装填进弩中，交付于士兵们。\n    「崩坏的幻想？那种东西，4000年之前本王就想要这么做了！」");
            SkillDataBase.getInstances(context).insert("吉尔伽美什","宝具", "天地乖离开辟之星", "EX", "    吉尔伽美什持有的号称“切裂世界”的剑,初始形态为王之财宝的钥匙，在现世首次使用时必须要解析现世的法则才能使用。跟“切开世界”这个传说毫无二致的效果，让此剑进入了特殊的类别。如果获得“王之财宝”内宝具的支援，其威力将进一步提升。这是连“无限剑制”也不能复制的最强之剑。\n    其剑发出风压的断层，成为拟似的空间断层粉碎敌人。吉尔伽美什将其表达为「认识“开天辟地前还是地狱的星球”之物」。\n    名字“天地乖离开辟之星”是指将“乖离剑・Ea”作出的最大出力状态，而“乖离剑·Ea”才是宝具。");
            SkillDataBase.getInstances(context).insert("玛塔·哈里","职阶技能", "谍报", "A++", "    这个技能并不是将自身的气息遮断，而是让敌对者本身无法感知气息。A++的场合只要从友方阵营无人告发。敌对者就不可能有所察觉。");
            SkillDataBase.getInstances(context).insert("玛塔·哈里","固有技能", "荷尔蒙", "B", "    对男性会有魅惑的魔术效果、但对魔力技能会使其回避可能。只有坚定的意志才可以减轻效果。");
            SkillDataBase.getInstances(context).insert("玛塔·哈里","固有技能", "双重封印", "B", "    潜移默化的封印之术。玛塔·哈里伪装伺机接近敌人，然后利用魅惑之术迷惑敌人并且施加封印，能够完全限制住行动力，对异性有特效。");
            SkillDataBase.getInstances(context).insert("玛塔·哈里","宝具", "有着白昼之眼的女子", "A", "    传说的具现化，洗脑宝具。在跳起妖艳的舞的同时，麻痹思考回路，使对方成为被操纵的傀儡，没有精神耐性技能的从者毫无疑问也会中招。");
            SkillDataBase.getInstances(context).insert("卡米拉","职阶技能", "气息遮断", "D", "    断绝Servent的气息，适合隐密行动。转换成攻击态势的话气息遮断会消失。");
            SkillDataBase.getInstances(context).insert("卡米拉","固有技能", "吸血", "C", "    通过沐浴鲜血来吸收和回复体力。虽然近似于自我催眠，但她的肌肤确实恢复了年轻。等级提升的话，吸收力也会上升。");
            SkillDataBase.getInstances(context).insert("卡米拉","固有技能", "拷问技术", "A", "    使用拷问用具的攻击会获得补正。因强化出血与给予痛苦方面的机能，在普通攻击的伤害后会渐渐追加伤害。这项技能要达到这种等级，必须得从年轻时就开始累积漫长的经验。");
            SkillDataBase.getInstances(context).insert("卡米拉","固有技能", "沐浴鲜血", "A", "    通过沐浴鲜血来维持青春的传说，利用鲜血为祭品，可以大幅度的增加自己的能力，同时损伤也能得到治疗。");
            SkillDataBase.getInstances(context).insert("卡米拉","宝具", "幻想的铁处女", "C", "    据传是卡米拉使用过的著名拷问器具。……然而经过长年的调查，可以考虑为并不实际存在。即使如此，汇集了众多信仰的这项拷问用具，成了伴随恐怖将纯洁的少女杀害的绝妙宝具。宝具会浮在卡蜜拉的头上，与被关在里面的受害者的惨叫声一同，将鲜血灌注给卡蜜拉。");
            SkillDataBase.getInstances(context).insert("清姬","职阶技能", "狂化", "EX", "    意思的沟通是完全可以成立的。不过会将御主视为「爱人」，并严禁说谎行为。要是说了谎，无论怎样的谎言都必将被看破，并且会自动消耗掉一划令咒。\n    「——您，说谎了呢。」");
            SkillDataBase.getInstances(context).insert("清姬","固有技能", "变化", "C", "    即借体成形。女人的执念最终化为毒蛇，渡过大河。变身成东洋的低级龙。还长着脚的期间不断地奔走，而脚消失后，则开始伏行以爬之。也能吐出火炎。到底怎么了呢？");
            SkillDataBase.getInstances(context).insert("清姬","固有技能", "跟踪狂", "B", "    为了能够持续追求所爱的目标而生的技能。甚至可说是将包含五感与魔力在内的野生本能其替代物，无论安珍到哪去她都能追上。");
            SkillDataBase.getInstances(context).insert("清姬","固有技能", "焰色的接吻", "A", "    清姫向御主索取的东西。一唇重合之后，化身为将所有障碍都轻松铲除的超级清姬酱也不是问题。作为代价，御主的未来会被固定为（丈夫）的状态，不过这只是个小代价吧。");
            SkillDataBase.getInstances(context).insert("清姬","宝具", "道成寺钟百八式火龙薙", "A", "    啊啊，我爱你，我爱你，我爱你！\n    我是真的，从心底里爱着你的。\n    如果这份心意叫做伪物的话，这世上就没有什么是真实的了。\n    所以，烧掉了。\n    爱也好，悲伤也好，仅仅只是燃烧殆尽了。");
            SkillDataBase.getInstances(context).insert("清姬","宝具", "转身火生三昧", "EX", "    喷吐火炎的大蛇。即是化为龙的转变。每回合进行缠卷抑或火炎其中一者的攻击。缠卷是直接攻击暨单体攻击。火炎是最大10范围程度的远距离全体攻击。\n    以及，这并不意味着她继承着龙种的血脉。她所拥有的，不过是对向自己撒谎的男人永无餮足的妄执罢了。");
            SkillDataBase.getInstances(context).insert("玉藻前","职阶技能", "阵地作成", "A", "    作为魔术师，造出对自己有利的阵地。A等级能够作出超越“工房”的“神殿”");
            SkillDataBase.getInstances(context).insert("玉藻前","职阶技能", "道具作成", "A", "    可以制作带有魔力的器具，作为阴阳术的创造者之一，玉藻前在这方面有着特别的成就。");
            SkillDataBase.getInstances(context).insert("玉藻前","固有技能", "神性", "EX", "    大地阴脉的化身，持有“太阳神”位格的天照大御神之名，玉藻前属于最顶级的神灵。");
            SkillDataBase.getInstances(context).insert("玉藻前","固有技能", "高速神言", "A", "    不连接魔术回路而能够发动魔术的咒文。瞬间契约，能以一工程的时间启动大魔术。辅佐魔术咏唱的技能。“神言”是各个神话时代所使用，也就是上级咒文言语 。人类的发声器官无法再现 。");
            SkillDataBase.getInstances(context).insert("玉藻前","固有技能", "咒术", "EX", "    荼吉尼天法。有着得到地位与财产的术法、得到权力者宠爱的术法等等，得到权力的秘术或者看破死期的术法。不过大概是因为过去曾吃过很多苦头，不太希望使用。不过除此之外对于阴阳五行术法，风水之术等等也颇有建树\n    Caster所使用的咒术，全都是使用Caster自己身体来施行的物理现象。普通的魔术是“编排已有之物”的程式，但咒术是“把自己的肉体当作素材来编排”的程式。");
            SkillDataBase.getInstances(context).insert("玉藻前","固有技能", "变化", "EX", "    也被称为借体成形。被视为等同于玉藻前的中国千年狐狸精所使用的术法。凭依、变身成殷周革命『封神演义』期妲己的术法，不过大概是因为精神创伤，不太希望使用。");
            SkillDataBase.getInstances(context).insert("玉藻前","固有技能", "王朝毁灭者", "EX", "    玉藻前有着五次化身美女祸乱人间，毁灭王国的传说，对于“王”、“国家”、“文明”等目标有着极大的克制和攻击补正。");
            SkillDataBase.getInstances(context).insert("玉藻前","固有技能", "太阳的化身", "EX", "    玉藻前身为“天照大御神”，是神话中太阳的化身，能够操纵日炎的力量————无论是改变天象还是召唤太阳之火甚至直接召唤太阳的投影都能够做到。");
            SkillDataBase.getInstances(context).insert("玉藻前","固有技能", "狐嫁女", "EX", "    把技能・道具创造进行了各种自行改造而成的技能。单方面地宣告出嫁，让天气下起太阳雨，把赠物硬塞给刚好在场的看起来像同伴的人们然后获得他们的祝福，这样的简直可以说是狐狸巫女的代名词的作弊技能。耍赖也要有个限度啊，天照大神！");
            SkillDataBase.getInstances(context).insert("玉藻前","宝具", "常世开裂大杀界", "A++", "    又名“彼岸花杀生石”，玉藻前死后变成的石头称为“杀生石”，它带有猛烈的咒毒，会将靠近的人或者兽毒死。是玉藻前作为九尾妖狐妖力的结晶，其中蕴含着无穷的妖力和被她毁灭的五个王朝的龙脉之力，普通的妖怪仅仅是触碰到杀生石就会得到无穷的力量。");
            SkillDataBase.getInstances(context).insert("玉藻前","宝具", "八咫镜", "EX", "    附着太阳权能的神器，玉藻前的本命三神器之一，也是日本的象征神物，有着强大、破除虚妄的神光，也可释放出名为“水天日光天照八野镇石”的结界。");
            SkillDataBase.getInstances(context).insert("玉藻前","宝具", "天丛云剑", "A++", "    又名草薙剑，传说中素盏鸣尊斩杀八岐大蛇后献给天照的战利品，玉藻前的三神器之一，拥有超越天羽羽斩的硬度和锐利，并且附带着操控风雷天候的能力。");
            SkillDataBase.getInstances(context).insert("玉藻前","宝具", "八尺琼勾玉", "EX", "    玉藻前的贴身宝玉，三神器之一，拥有趋吉避凶、增加幸运的祝福，除此之外还有着创造幻境，影响精神，寄宿与操纵灵魂的力量。");
            SkillDataBase.getInstances(context).insert("贞德·达尔克","职阶技能", "对魔力", "EX", "    由于不可动摇的信仰心，加上Saber的对魔力加成，而发挥出高强的抗魔力。不过，只是将魔术错开而已，在广范围魔术攻击的情况下，能得救的只有贞德。并不适用于教会的秘迹。");
            SkillDataBase.getInstances(context).insert("贞德·达尔克","职阶技能", "看破真名", "B", "    以Ruler身份被召唤出来的情况下，所有直接遇见的Servant其真名、职阶以及性能情报将会自动揭露。对方有隐藏真名及性能的固有能力或宝具时，须按幸运等级来判定。");
            SkillDataBase.getInstances(context).insert("贞德·达尔克","职阶技能", "自我回复", "A", "    Ruler的最高特权，使用对参加圣杯战争的每个Servant的两划令咒的权利，不能用其他Servant的令咒来代替。");
            SkillDataBase.getInstances(context).insert("贞德·达尔克","固有技能", "领导力", "C", "    指挥军团的天性才能。贞德在战场上举旗参与突击的姿态，把士兵的士气提高至极限，让大军化成一体。由于领导力的缘故，她能使他人相信毫无根据的“启示”内容。");
            SkillDataBase.getInstances(context).insert("贞德·达尔克","固有技能", "启示", "A", "    和“直感”同等的技能。直感是战斗中的第六感，但“启示”适用于所有关乎到目标达成的事象(例如在旅途中选择最适合的道路)。由于(本人认为)毫无根据，所以没办法向他人好好说明。");
            SkillDataBase.getInstances(context).insert("贞德·达尔克","固有技能", "圣人", "B", "    表示她被认定为圣人。圣人的能力是在作为Servant被召唤时，从“秘迹的效果上升”、“HP自动回复”、“领导力提升1级”、“可以制作圣骸布”当中选择其一。");
            SkillDataBase.getInstances(context).insert("贞德·达尔克","宝具", "我的神明在此", "A", "    贞德生前挥舞的圣旗所变成的宝具。透过天使的祝福来守护著以此旗为中心的10距离单位内部。可以把规格外的对魔力直接转变为物理防御力挡住对方的攻击。但是，举起圣旗的期间，贞德将无法进行一切攻击。并且旗帜本身会持续积累对方的攻击伤害，所以滥用的话将会再也无法使用。");
            SkillDataBase.getInstances(context).insert("贞德·达尔克","宝具", "红莲之圣女", "EX", "    她用银剑划破自己的手掌，然后虔诚的跪下来，双手并拢，合上眼睛，做出了祈祷的姿势。以“主呀，委以此身――”这句临终诗作为发动的咒文，让火焰显现的圣剑。将贞德的烤刑诠释成攻击而产生的概念结晶武装。固有结界的亚种，将心象世界结晶化而成的剑。由于此剑正是英灵贞德其本身；所以一旦让宝具显现，战斗结束后贞德就会从现世消失。");
            SkillDataBase.getInstances(context).insert("贞德·达尔克(Alter)","职阶技能", "复仇者", "B", "    因为容易积累憎恨和怨念而让她遭受攻击时NP上升率变高。但是因为奥尔良被修正，恨意不再那么强烈了。");
            SkillDataBase.getInstances(context).insert("贞德·达尔克(Alter)","职阶技能", "忘却补正", "A", "    无论时间如何流逝，她的憎恨都不会消散。纵使在她知道了比憎恨更美好的事物后也依然如此。");
            SkillDataBase.getInstances(context).insert("贞德·达尔克(Alter)","职阶技能", "自我回复", "A+", "    在复仇终结之前，魔力都会源源不断的涌出。每回合都会回复微量的魔力。是她从圣杯的愿望中诞生的原因吗？这是特级的回复量。");
            SkillDataBase.getInstances(context).insert("贞德·达尔克(Alter)","固有技能", "龙之魔女", "EX", "    具驯龙的能力，因吉尔的愿望所诞生的她、生来就持有龙种之力。想象得到的是以圣女玛尔达、或是圣人圣乔治等等有着驱散龙种的逸闻的圣人们的反转现象。持有使龙能够服从的特殊的领导力、以及队伍的攻击力上升的力量。在邪龙百年战争中肆虐过的技能。支配低级的龙种只需要挥动旗子便能操纵。同时兼具规格外的骑乘技能，获得该技能后便能让龙种们拥有骑乘。");
            SkillDataBase.getInstances(context).insert("贞德·达尔克(Alter)","固有技能", "自我改造", "EX", "    这是通过圣杯进行的特级改造。圣女完全反转堕入混沌·恶。这是通过圣杯进行的特级改造。圣女完全反转堕入混沌·恶。");
            SkillDataBase.getInstances(context).insert("贞德·达尔克(Alter)","固有技能", "泡沫般的梦幻", "A", "    是从个人的愿望和幻想中所诞生的生命体。因为是从愿望中诞生的，所以保留了强大的力量。但同时作为一个生命体永远无法获得认可，当一切终结后，她便会静静沉眠。");
            SkillDataBase.getInstances(context).insert("贞德·达尔克(Alter)","宝具", "火刑的地狱", "A", "    燃烧，燃烧，一切都燃烧倒塌。肉烤焦的味道，令人不快的惨叫，每当呼吸，五脏六腑都受到严重打击。然后每当回想起这个记忆时，每次回首，我的脸颊都扭曲着做出笑容。\n    因为你看，是这个火焰赋予了我形状。这对我来说是坟墓，同时也是摇篮。\n    ———来吧，在地狱呐喊吧。将诞生的喜悦，诞生的憎恶，诞生的绝望,全部咆哮出声吧！");
            SkillDataBase.getInstances(context).insert("贞德·达尔克(Alter)","宝具", "咆哮吧！吾之愤怒", "A+", "    作为龙之魔女所降临的贞德所持的诅咒之旗。复仇者的名下、自身和周围的怨念变换为魔力并焚烧、对手的不正当或污浊、独善直到骨髓都燃烧殆尽。好可怕。");
            SkillDataBase.getInstances(context).insert("阿尔忒弥斯","职阶技能", "对魔力", "EX", "    身为月之女神的阿尔忒弥斯对于魔力的免疫达到了最高等级，现代的魔术无法对她造成任何损伤。");
            SkillDataBase.getInstances(context).insert("阿尔忒弥斯","职阶技能", "单独行动", "EX", "    没有Master也能行动。阿尔忒弥斯是月之女神，只要能得到月亮的支援就能无限期的现界。");
            SkillDataBase.getInstances(context).insert("阿尔忒弥斯","职阶技能", "神性", "EX", "    身为奥林匹斯十二主神之一，阿尔忒弥斯拥有最高的神性。");
            SkillDataBase.getInstances(context).insert("阿尔忒弥斯","固有技能", "千里眼", "A++", "    优良的视力。能捕捉远方目标、动态视力、透视的能力，同时也可以做到有限的未来视。。阿尔忒弥斯的千里眼赋予了她“只要射出就一定会中”的箭术");
            SkillDataBase.getInstances(context).insert("阿尔忒弥斯","固有技能", "狩猎", "EX", "    狩猎的女神阿尔忒弥斯在这方面有着无可匹敌的技巧，包括超凡的敏捷、直觉般的追踪能力、布置陷阱的能力、与野兽搏斗所锻炼出来千锤百炼的战斗技巧……");
            SkillDataBase.getInstances(context).insert("阿尔忒弥斯","固有技能", "月亮的加护", "EX", "    阿尔忒弥斯是月之女神，拥有对于月亮的绝对权力，操纵月光、控制天像、召唤月亮的投影来砸人什么的都能够做到。");
            SkillDataBase.getInstances(context).insert("阿尔忒弥斯","固有技能", "森之支配者", "EX", "    阿尔忒弥斯是自然与森林的女神，喜欢在广阔的山林里自由徜徉，森林就是她的领域。");
            SkillDataBase.getInstances(context).insert("阿尔忒弥斯","宝具", "月神之弓", "A++", "    宙斯所赠予的金银色的弓和箭，拥有毁灭的力量，只是一箭就能射出漫天的箭雨。");
            SkillDataBase.getInstances(context).insert("阿尔忒弥斯","宝具", "月女神的恋爱箭矢", "A++", "    所谓「爱矢恋矢」，读作爱死恋死。藉阿尔忒弥斯对于某始皇帝爱的力量射出的箭，由于是偕着她过剩的爱意发射而出，目标除了极大的伤害之外，还会被极度的混乱所波及。");
            SkillDataBase.getInstances(context).insert("阿尔忒弥斯","宝具", "月亮战车", "EX", "    是由被黄金包裹的战车由四个金色的长角鹿拉扯，发出金色的灿烂光芒。阿尔忒弥斯驾驶这辆战车巡视着夜空。");
            SkillDataBase.getInstances(context).insert("阿尔忒弥斯","宝具", "阿尔忒弥斯的兽群", "EX", "    阿尔忒弥斯是狩猎女神，本身也饲养着许多的神兽：四只为她拉战车的金角鹿、两条黑色和白色的，三个微红的，和有一个斑点的共七只猎狗、一头卡吕冬野猪、鵟鹰和珍珠鸡等等。");

        }
    }

    static void insertImage(Context context){
        Cursor query = CharacterDataBase.getInstances(context).query();
        File nf = new File(Environment.getExternalStorageDirectory()+"/FateDictionary");
        nf.mkdir();

        if (query.moveToFirst()) {
            do {
                int number = query.getInt(query.getColumnIndex("number"));
                String str = "a"+number;
                if (getResId(str)>0){
                    Bitmap imageBig = BitmapFactory.decodeResource(context.getResources(),getResId(str));
                    File f1 = new File(Environment.getExternalStorageDirectory()+"/FateDictionary", str+".png");
                    FileOutputStream out1 = null;
                    try {
                        out1 = new FileOutputStream(f1);
                        imageBig.compress(Bitmap.CompressFormat.PNG, 100, out1);
                        try {
                            out1.flush();
                            out1.close();
                        } catch (IOException e) {
                            e.printStackTrace();
                        }

                    } catch (FileNotFoundException e) {
                        e.printStackTrace();
                    }
                }
                if (getResId(str+"_little")>0){
                    Bitmap imageLittle = BitmapFactory.decodeResource(context.getResources(),getResId(str+"_little"));
                    File f2 = new File(Environment.getExternalStorageDirectory()+"/FateDictionary", str+"_little.png");
                    FileOutputStream out2 = null;
                    try {
                        out2 = new FileOutputStream(f2);
                        imageLittle.compress(Bitmap.CompressFormat.PNG, 100, out2);
                        try {
                            out2.flush();
                            out2.close();
                        } catch (IOException e) {
                            e.printStackTrace();
                        }

                    } catch (FileNotFoundException e) {
                        e.printStackTrace();
                    }
                }


            }while (query.moveToNext());
        }
    }

    private static int getResId(String imageName){
        Class mipmap = R.mipmap.class;
        try {
            Field field = mipmap.getField(imageName);
            return field.getInt(imageName);
        } catch (NoSuchFieldException | IllegalAccessException e) {//如果没有在"mipmap"下找到imageName,将会返回0
            return 0;
        }

    }
}